{
  "backend/main.mo": "Main Motoko actor for the pool scorekeeper app, handling access control, user approval, profiles, and match entry storage/retrieval across multiple game modes (Accepting Gifts, Straight Shot, APA Practice).",
  "feature_evidence.json": "Feature evidence report specifying a single change: updating the candlestick series legend label in StraightShotTrendChart.tsx from 'Candle (day)' to 'Shots (day)'.",
  "frontend-file-summaries.txt": "Auto-generated summary document describing the purpose and key behaviors of each frontend source file in the project.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation for a UI-only change in ModeCard.tsx that reorders buttons so 'Start New Game' appears before 'Resume Game', with a testing checklist.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the app's design token system (colors, radius, chart colors, sidebar).",
  "frontend/index.html": "Root HTML entry point for the Vite/React frontend, mounting the app into a div#root and loading the main.tsx module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes, wraps the app in ThemeProvider and AuthGate, and provides a shared error fallback UI.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component displaying win/loss records grouped by starting ball count (2–7) for the Accepting Gifts game mode.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Circular button component representing a pool ball in APA practice mode, supporting unscored/playerA/playerB/dead states with color-coded styling and locked/disabled states.",
  "frontend/src/components/apa/apaBallStyles.ts": "Provides shared utility functions for APA 9-Ball rack scoring, including ball point value calculation with the one-away rule and rack totals computation for both players.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "React component for scoring a single rack in an APA 9-ball match, managing ball states (unscored/playerA/playerB/dead), defensive shots, innings flow, and emitting rack completion data when all balls are assigned.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays a post-match summary card showing each player's skill level, points needed/earned, defensive shots, innings, PPI, and the team match point outcome with winner highlighted.",
  "frontend/src/components/apa/MatchupAnalysisDropdown.tsx": "A dropdown button that lists unique opponents from official APA matches and calls a callback when one is selected; shows a disabled state if no opponents exist.",
  "frontend/src/components/apa/MatchupAnalysisDropdownPlayerStats.tsx": "Extended matchup analysis dropdown that filters official and optionally practice matches against a selected opponent, then renders a MatchupAnalysisPanel with the filtered match history.",
  "frontend/src/components/apa/MatchupAnalysisPanel.tsx": "Panel component that aggregates and displays head-to-head match history (official and practice) against a specific opponent, computing win/loss outcomes and PPI for each match.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form component for creating or editing an official APA match log entry, with fields for date, opponent, skill levels, scores, innings, and defensive shots, including validation and backend save/update mutations.",
  "frontend/src/components/apa/useApaInningFlow.ts": "React hook that manages the innings counter and active player turn state for APA 9-Ball matches, incrementing innings when the bottom player ends their turn.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication and access-control gate component that blocks rendering of children until the user is logged in via Internet Identity and approved (when invite-only mode is active).",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog component that prompts newly authenticated users to create a profile (name and APA skill level) and allows existing users to edit their profile.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Table component displaying past matches with selectable rows, bulk delete functionality, and columns for date, results, PPI, and aPPI.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component rendering the sticky header with navigation, login/profile controls, an admin shield button, and a footer wrapping all page content via an Outlet.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Renders a destructive button that opens an AlertDialog confirmation before deleting a match, then navigates to history or calls an optional callback.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "A reusable AlertDialog component for confirming the end of a match, with configurable title, description, confirm text, and pending/disabled states.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a summary card for a single match showing mode, date, and narrative details, with a button to navigate to the match detail page.",
  "frontend/src/components/ModePill.tsx": "Small presentational component that renders a styled rounded pill/badge displaying a game mode name, used in match history views.",
  "frontend/src/components/navigation/ModeCard.tsx": "A navigation card for a game mode that shows start and optional resume buttons based on whether an in-progress session exists in local storage.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders Recharts line charts visualizing APA performance trends (PPI, aPPI, points, defensive shots) over time from aggregated data points.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Displays a bar chart histogram of Straight Shot session shot-count frequencies using Recharts.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Renders a table summarizing Straight Shot win/loss records grouped by total ball count, including the first win date.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Renders a candlestick-style composed chart showing daily open/close/high/low shot counts and an average trend line for Straight Shot sessions.",
  "frontend/src/dev/straight-shot-spot-check.md": "A manual QA checklist for verifying that the Straight Shot game mode remains functional after unrelated code changes.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous backend actor, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a `retryConnection` callback that clears and refetches the cached actor query without a page refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including match CRUD operations, user profile management, and APA/game-specific data queries and mutations.",
  "frontend/src/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level Accepting Gifts progression system with level metadata, and provides utility functions for clamping indices, retrieving levels, and computing the next baseline level after a match result.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Manages Accepting Gifts in-session game state, providing functions to apply attempt results and prepare the next set after a race-to-7 set completes.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts and aggregates per-player APA match data points (PPI, aPPI, points, defensive shots) from both practice and official APA match logs, with independent null-safe field cleaning.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines the APA 9-Ball Equalizer skill level to points-to-win mapping and provides helper functions for validating and formatting skill levels and point targets.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Implements the APA 9-Ball 20-point match point conversion chart, mapping loser skill level and points pocketed to win/loss point outcomes for all skill levels 1–9.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcome by identifying the loser's skill level and points pocketed, then returning winner/loser match points using the APA match points chart.",
  "frontend/src/lib/apa/apaScoring.ts": "Defines APA 9-ball rack scoring constants, validation utilities, and player stat aggregation including PPI calculation.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Provides functions to predict APA skill levels (1–9) from PPI and aPPI values using multiple sets of range tables for both the Official APA tab and detailed stats views.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Contains the official APA Expected PPI lookup table indexed by win-percentage bucket and skill level (SL2–SL7), with helpers to bucket a win percentage and retrieve the expected PPI value.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Derives an Official APA match outcome ('win', 'loss', or 'unknown') from skill levels and scores by comparing each player's score against their points-to-win target.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Calculates Official APA PPI (score divided by adjusted innings) and aPPI (max of PPI and table-expected PPI for wins only) for individual matches, using historical win percentage for the expected PPI lookup.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds a structured narrative (mode name pill + details string) for match history rows, handling Official APA, Practice APA, Straight Shots, and Accepting Gifts match types.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Determines the effective timestamp for a match by preferring the user-entered date for Official APA logs and falling back to the stored dateTime, with a helper to format the result as a human-readable string.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds an official APA match log record from form inputs, deriving win/loss outcome from skill levels and scores, and re-exports other match builders from matchBuildersOriginal.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Provides builder functions for APA 9-Ball practice matches, Accepting Gifts matches, and Straight Shot matches, constructing typed MatchLogRecord objects with computed outcomes and player stats.",
  "frontend/src/lib/session/inProgressSessions.ts": "Centralized helpers for reading, writing, and clearing per-mode in-progress game state in sessionStorage, with typed keys for APA Practice, Accepting Gifts, and Straight Shot modes.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes win/loss counts for Accepting Gifts matches grouped by starting ball count (2–7) from match history.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Computes summary statistics for Accepting Gifts matches, including total sessions and a rolling average of ending object ball counts over the last N sessions.",
  "frontend/src/lib/stats/officialApaStats.ts": "Computes official APA match statistics including win rate, average PPI over the last 10 matches, and best aPPI over the last 20 matches in chronological order.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes Straight Shot drill statistics including rolling and lifetime shot averages, lowest score, trend data, histogram data, and a win/loss summary table.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Main game page for the Accepting Gifts drill that manages session state, handles attempt inputs, tracks scores, and saves completed matches to the backend.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Static informational card component that displays the rules, level system, match format, and progression rules for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for the Accepting Gifts drill that lets users select a starting level, handles in-progress session detection, and initializes a new game session in sessionStorage.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Live APA 9-ball practice match game page that tracks rack-by-rack scoring, manages session state, and saves the completed match to the backend.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Setup page for an APA 9-ball practice match where users enter player names, skill levels, and determine the lag winner before navigating to the game page.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Edit page for an existing official APA match log that loads match data by ID and renders the RealApaMatchForm pre-populated with existing values.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Page for manually logging an official APA match after the fact by rendering the RealApaMatchForm in create mode.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Displays an access-denied page for invite-only apps, allowing users to submit an access request via the useRequestApproval hook and showing a confirmation message on success.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Shows detailed information for a single match by ID, including APA-specific stats (PPI, aPPI, innings, skill levels) and provides navigation back to history and to player aggregate pages.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Renders a paginated, sortable match history list with tabs for All/APA/Gifts/Straight modes, supporting both card and table view modes with preference persisted in localStorage.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying four mode cards (Official APA Match Log, APA Practice, Accepting Gifts, Straight Shot) and a link to Match History for authenticated users.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin-only page for managing user access approvals, allowing the owner to approve or reject individual or all pending requests and toggle invite-only mode.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays aggregate APA stats for a specific player (win rate, best-10-of-20 PPI/aPPI, predicted skill level) derived from official matches, with a matchup analysis dropdown.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Post-deployment verification page with a checklist and navigation buttons to Home and Match History for confirming core routing works after a deployment.",
  "frontend/src/pages/stats/StatsPage.tsx": "Personal stats dashboard with tabbed views for APA, Straight Shot, and Accepting Gifts modes, showing charts, trend data, and a matchup analysis panel for the logged-in user.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "React page component for an active Straight Shot drill session, allowing the user to track total shots, save the match to the backend, and navigate to history on completion.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Presentational card component that displays the rules and objective of the Straight Shot Strokes Drill, including win condition of 20 shots or fewer.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for the Straight Shot drill that shows the player's profile name, moving average of last 10 sessions, and options to start a new or resume an in-progress session.",
  "frontend/src/utils/errorText.ts": "Utility function `extractErrorText` that converts unknown error values (strings, Error objects, or plain objects) into a readable English string.",
  "frontend/src/utils/playerName.ts": "Utility functions for normalizing and comparing player names case-insensitively.",
  "frontend/src/utils/playerRoutes.ts": "Single utility function that builds the aggregate stats route path for a given player name using URL encoding.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/withTimeout.ts": "Utility function `withTimeout` that wraps a Promise in a race against a configurable timeout, rejecting with an error if the timeout is exceeded.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system tokens (colors, border radius, animations, fonts) using OKLCH variables, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking the current feature request to rename the candlestick legend label from 'Candle (day)' to 'Shots (day)' in the Straight Shot Trend Chart."
}