{
  "backend/main.mo": "Motoko canister handling access control, user approval, and user profiles with functions for authorization and storing match-related types. Includes invite-only mode logic and profile CRUD operations.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence for regression and schema mismatch fixes.",
  "frontend-file-summaries.txt": "JSON mapping of many frontend files to their descriptions for build planning and documentation.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and dark mode styles.",
  "frontend/index.html": "HTML entry point loading the React application.",
  "frontend/src/App.tsx": "React app routing configuration using TanStack Router with layout, auth gate, and all mode pages.",
  "frontend/src/components/apa/ApaBallButton.tsx": "UI component rendering a clickable APA ball button with state-based styles and accessibility labels.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types, value rules, and helpers to compute total points per rack by player and dead balls.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Interactive rack scoring UI for APA 9-ball, managing ball states, innings, defensive shots, and auto-dead logic when the 9-ball is pocketed.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays end-of-match results including winner, match points, skill levels, points earned, defensive shots, innings, and PPI for both players.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form for creating or editing official APA match logs with validation for scores, innings, defensive shots, and skill-level-based targets.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Hook managing inning flow, active player, inning counts, and transitions based on balls scored.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication and access-control wrapper handling login, approval, admin checks, and invite-only mode before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Button enabling login/logout using Internet Identity with automatic session clearing and query cache reset.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting users to set up or edit their profile with name and optional APA skill level, using profile-fetch and save hooks.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header, footer, navigation buttons, login, admin access, and profile dialogs.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button that opens a confirmation dialog and deletes a match, then navigates or triggers a callback.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Dialog to confirm ending and saving a session, handling async completion and error toasts.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Card displaying match mode, date, and summary text with logic for APA, gifts, and straight-shot modes.",
  "frontend/src/components/navigation/ModeCard.tsx": "Clickable card with icon and description that navigates to start a new game mode.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Charts showing APA PPI and match result trends with rolling averages using Recharts.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity loading, and auth-client configuration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating match data, user profiles, and object ball counts via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables for light and dark modes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Session logic for adjusting game state, applying attempt results, and advancing sets with clamped ball counts.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match stats, computes PPI, determines outcomes, and generates sorted data series and win rates.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA skill levels, points‑to‑win mapping, and helpers for formatting and validation.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines the APA 9‑ball match point conversion chart and thresholds for each skill level.",
  "frontend/src/lib/apa/apaScoring.ts": "Utilities for rack scoring, validation, PPI calculation, and aggregating player stats across racks.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Derives official APA match outcomes using skill levels and scores, with fallback to stored didWin.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Parses score fields and computes official APA PPI with validation and formatting.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses or formats match dates, preferring official APA date strings and falling back to nanosecond timestamps.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds official APA match log records, deriving outcomes and returning a matchId and MatchLogRecord; re-exports other builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Contains builders for APA 9-ball, Accepting Gifts, and other match types, constructing MatchLogRecord objects with stats and metadata.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider, then renders the root component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Manages Accepting Gifts game state, session persistence, scoring logic, and saving matches to the backend.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays rules, setup, scoring, and tips for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Provides a form to start an Accepting Gifts session, manage baseline ball count, and initialize session state.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Manages an APA practice game's state, rack scoring, completion detection, and saving to backend or session storage.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Collects player names and skill levels, builds initial practice game state, and stores it before navigating to the game screen.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Loads an existing official APA match and displays a form to edit its data, redirecting if the match is missing.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Provides a form for creating an official APA match log after the match is completed.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Shows an invite‑only access message and allows users to request approval to use the app.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays detailed information for a specific match, including APA stats and mode‑specific breakdowns.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows a sortable and filterable list of all past matches with navigation to details.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with navigation cards for match modes and a button linking to match history.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page to review, approve, reject, or bulk-reject user approval requests and toggle invite‑only mode.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays aggregated APA player stats, including win rates, counts, averages, and charts for selected players.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Runs the Straight Shot drill session, tracks in‑progress game state, computes scores, and saves the match.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Static panel explaining objectives and rules for the Straight Shot drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start screen for the Straight Shot drill where users enter details, view moving averages, and begin a session.",
  "frontend/src/utils/errorText.ts": "Utility to extract readable error messages from various error shapes, including nested backend errors.",
  "frontend/src/utils/playerName.ts": "Provides helpers for normalizing and comparing player names case‑insensitively.",
  "frontend/src/utils/playerRoutes.ts": "Builds URL paths for player aggregate stats pages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters via query strings or hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, app summary, architectural notes, and known issues for an APA pool practice and match-tracking app."
}