{
  "backend/main.mo": "Motoko canister implementing user profile access control and CRUD operations plus multiple match record types and conversion to a unified API format.",
  "feature_evidence.json": "Feature evidence report mapping implemented files to feature requirements, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten descriptions summarizing key frontend React components, pages, and hooks used throughout the app.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables for light/dark modes and applying base styles.",
  "frontend/index.html": "Root HTML file bootstrapping the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, themes, and authentication gating for all app routes including game modes and history pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper that shows a login welcome screen until the user is authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity auth and clearing cached queries on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component with header, footer, login button, routed content, and profile setup dialog.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button and confirmation dialog to delete a match and navigate or trigger callback after deletion.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Dialog for ending and saving a match, handling loading state and confirmation.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Clickable card showing match mode, date, players, and optional stats, navigating to match details.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card displaying a game mode with icon and description, linking to start a new game.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider handling authentication, identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and matches through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme tokens.",
  "frontend/src/lib/matches/matchBuilders.ts": "Provides builders for APA practice, Accepting Gifts, and Straight Shot match records, generating match IDs and timestamps.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Runs the Accepting Gifts session UI, managing score state, rules panel, and saving completed sessions.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Shows the rules and explanation for the Accepting Gifts drill inside a UI card.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Collects player name and notes to initialize an Accepting Gifts session and stores it in sessionStorage.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Handles APA practice gameplay including scoring, innings, and saving match results.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Gathers player names, target score, and notes to start an APA practice match and saves initial state.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays match details with players, mode, date, and stats, handling loading and not-found states.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows a filterable list of past matches with tabs by mode and navigation to home.",
  "frontend/src/pages/HomePage.tsx": "Displays the app home screen with navigation cards for different practice modes and match history.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Manages an active straight-shot session, recording shots, tracking streaks, and saving the match.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Collects initial player info and creates a new straight-shot session in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugin setup.",
  "project_state.json": "JSON describing the project’s current state, including version info, existing feature definitions, and high-level app goals for multiple pool practice modes. It lists implemented features, requirements, and metadata for planning."
}