{
  "backend/main.mo": "Main backend actor implementing access control, user approval, invite-only mode, user profiles, and match history for multiple game modes (Accepting Gifts, Straight Shot, APA Practice, Real APA Match) with CRUD operations and query methods.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: adding useCallback to React imports and wrapping handleLiveRackUpdate with useCallback in PracticeGamePage.tsx to prevent infinite render loops.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, authentication, game modes (APA Practice, Accepting Gifts, Straight Shot), match history, stats, and UI components with detailed implementation notes.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation for a UI-only change that reordered ModeCard buttons to display 'Start New Game' above 'Resume Game', with no changes to session storage, navigation logic, or gameplay functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, cards, buttons, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title describing the APA-style pool practice scorekeeper app, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with error boundaries for all routes (home, APA practice, Accepting Gifts, Straight Shot, match history, stats, admin), wrapped with ThemeProvider, AuthGate, and Toaster.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component displaying win/loss performance statistics for each starting ball count level (2-7) in Accepting Gifts mode, with empty state handling.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Reusable ball button component for APA scoring with four states (unscored, playerA, playerB, dead), hover colors based on active player, locked state support, and accessibility labels.",
  "frontend/src/components/apa/apaBallStyles.ts": "Provides shared UI helpers for APA 9-Ball rack scoring, including ball value calculation with one-away rule logic and rack total computation ensuring 10 points per rack.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Interactive panel for scoring individual APA 8-ball racks with ball-by-ball tracking, inning flow management, defensive shot counting, and automatic target detection for match completion.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results summary with player statistics including skill levels, points earned, defensive shots, innings, PPI, and team match point outcomes.",
  "frontend/src/components/apa/MatchupAnalysisDropdown.tsx": "Dropdown menu component that lists unique opponent names from official APA matches and triggers matchup analysis selection.",
  "frontend/src/components/apa/MatchupAnalysisDropdownPlayerStats.tsx": "Enhanced matchup analysis dropdown with practice match toggle that filters and displays head-to-head match history between a player and selected opponent.",
  "frontend/src/components/apa/MatchupAnalysisPanel.tsx": "Panel displaying detailed head-to-head statistics and match history between a player and opponent, including both official and practice APA matches with PPI calculations.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form component for creating or editing official APA match records with validation for skill levels, scores, innings, defensive shots, and automatic points-to-win calculation.",
  "frontend/src/components/apa/useApaInningFlow.ts": "React hook managing innings counter and turn flow for APA 9-Ball matches, incrementing innings when the bottom player completes their turn and preserving state across rack boundaries.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate component that enforces login and checks invite-only mode access control, showing appropriate loading states and access denial pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that manages Internet Identity authentication and clears query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog component for creating and editing user profiles with name and APA skill level, automatically prompting new users and handling backend connection retries.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Table component displaying match history with multi-select checkboxes, delete functionality, and navigation to match details, showing date, results, PPI, and aPPI metrics.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header navigation, authentication status, admin controls, stats access, and footer, showing connection status when backend is initializing.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "A button component that opens a confirmation dialog to delete a match, using the useDeleteMatch hook and navigating to history or calling a callback after deletion.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "A reusable alert dialog component for confirming match termination with customizable title, description, and confirm text, supporting pending and disabled states.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a summary card for a match with mode badge, date, and mode-specific details (APA scores, Accepting Gifts status, Straight Shot results), with click navigation to match details.",
  "frontend/src/components/navigation/ModeCard.tsx": "A card component for game mode selection that displays title, description, icon, and buttons to start new or resume in-progress sessions based on session storage.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders line charts for APA performance trends including PPI/aPPI, points scored, and defensive shots over time using unified timestamp-based data points.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Displays a bar chart showing the frequency distribution of shot counts across Straight Shot sessions.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Renders a table summarizing Straight Shot performance by ball count, showing wins, losses, and first win date for each count.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Displays a composed chart with bars and trend line showing shot count over time for Straight Shot sessions, including average calculation.",
  "frontend/src/dev/straight-shot-spot-check.md": "QA checklist document for manually verifying Straight Shot game functionality including session start, shot entry, save, and history display.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useActorRetry.ts": "Hook providing a retry mechanism that clears and refetches the cached actor query to recover from connection failures without page refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on matches and user profiles, including approval status management, using the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines a 12-level progression system for Accepting Gifts mode (2-7 object balls × 8-ball/9-ball), with helpers for level management and baseline computation based on win/loss outcomes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Manages Accepting Gifts game session state and logic, applying attempt results (runout vs miss) and preparing next sets in a race-to-7 format.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts and aggregates per-player APA statistics (PPI, aPPI, points, defensive shots) from practice and official matches, with independent field validation and null handling.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA 9-ball skill level to points-to-win mapping (SL1=14 to SL9=75) with validation and formatting utilities.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Implements APA 9-ball match point conversion (20-point system) based on loser's skill level and points pocketed, with threshold tables for each skill level.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcomes by determining the winner based on target scores, then using the loser's skill level and points to calculate match points for both players.",
  "frontend/src/lib/apa/apaScoring.ts": "Handles APA 9-ball rack scoring with 10 points per rack, validates rack totals, and calculates PPI (points per inning) statistics for players across multiple racks.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill levels (1-9) based on PPI and aPPI averages using different range tables for official tabs and detailed player stats pages.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Provides the official APA expected PPI lookup table organized by win percentage buckets (10-100%) and skill levels (SL2-SL7) for performance comparison.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Derives Official APA match outcomes (win/loss/unknown) by comparing player scores against their skill-level-based target points, with fallback to stored didWin field.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Calculates Official APA PPI (score divided by effective innings) and aPPI (adjusted PPI using expected values from win percentage tables, with special handling for wins vs losses).",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds formatted narrative strings for match history rows, displaying mode-specific details (scores, opponents, levels) with win/loss indicators for Official APA, APA Practice, Straight Shots, and Accepting Gifts matches.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Determines the effective match date for sorting and display, preferring user-entered dates for Official APA matches and falling back to system timestamps, with timezone-aware parsing for YYYY-MM-DD format.",
  "frontend/src/lib/matches/matchBuilders.ts": "Exports buildOfficialApaMatchLog function that creates official APA match records with derived win/loss outcomes based on skill levels and scores, plus re-exports other match builders from the original file.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Contains builder functions for creating match records for APA 9-Ball practice matches, Accepting Gifts drills, and Straight Shot sessions with full player stats, scoring, and outcome computation.",
  "frontend/src/lib/session/inProgressSessions.ts": "Provides centralized helpers for managing per-mode in-progress session state in sessionStorage with separate slots for APA Practice, Accepting Gifts, and Straight Shot modes.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes Accepting Gifts performance statistics grouped by starting ball count (2-7), tracking wins and losses from completed race-to-7 sets.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Computes summary statistics for Accepting Gifts mode including total sessions and rolling average of ending object ball counts from the last N sessions.",
  "frontend/src/lib/stats/officialApaStats.ts": "Computes official APA match statistics including win rate, average PPI (last 10 matches), and average aPPI (best 10 of last 20) from chronologically sorted match data.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes comprehensive Straight Shot statistics including rolling/lifetime averages, lowest shot count, trend data, histogram data, and win/loss summary by ball count.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Main game page for the Accepting Gifts drill that manages game state (player/ghost scores, levels, attempts), handles rack attempts, set completion, and saving matches to the backend with session persistence.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules and instructions for the Accepting Gifts drill, explaining the 12-level progression system, match format (race to 7), and advancement/demotion logic.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for Accepting Gifts that allows users to select a starting level, displays their baseline level, handles session creation/resumption, and shows collapsible rules.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Live scoring page for APA 9-ball practice matches that tracks rack-by-rack scoring, innings, defensive shots, manages seat-based player positions, and saves completed matches.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Setup page for APA practice matches where users enter player names, skill levels, handle lag selection, and manage session creation/resumption with validation.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Edit page for official APA match logs that loads existing match data by ID and renders the RealApaMatchForm in edit mode with pre-populated fields.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Entry page for logging official APA matches after the fact (not live scoring) that renders the RealApaMatchForm in create mode.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Displays an access-denied page for invite-only apps with a button to request approval from the owner, showing success feedback after submission.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Shows detailed information for a specific match including player stats, mode-specific data (APA/Gifts/Straight), official PPI/aPPI calculations, and options to edit or delete the match.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Displays a filterable and sortable list of all matches with tabs for different game modes (All/APA/Gifts/Straight) and toggleable card/table view modes.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying four mode cards (Official APA Match Log, APA Practice, Accepting Gifts, Straight Shot) with navigation to match history for authenticated users.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin-only page for managing user access approvals with invite-only mode toggle, showing pending/approved/rejected users with bulk reject functionality.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays aggregate APA statistics for a specific player including best-10-of-20 PPI/aPPI averages, predicted skill levels, win rates, and matchup analysis from official matches only.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Deployment verification page with a checklist and quick navigation buttons to test routing to Home and Match History pages.",
  "frontend/src/pages/stats/StatsPage.tsx": "Main statistics dashboard with tabs for APA, Straight Shot, and Accepting Gifts game modes, showing charts, trends, performance metrics, and opponent matchup analysis for the current user.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Main game page for Straight Shot drill that manages game state (player name, notes, total shots), handles session persistence via sessionStorage, and provides UI for recording shots and ending/saving the session with backend integration.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Displays the rules for the Straight Shot drill in a card component, explaining the objective (clear all balls in 20 shots or fewer), gameplay mechanics, and winning criteria.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for Straight Shot drill that displays player stats (moving average of last 10 sessions), handles session creation/resumption, and shows confirmation dialog when overwriting an in-progress session.",
  "frontend/src/utils/errorText.ts": "Utility function that extracts readable error messages from various error types (strings, Error objects, nested objects) with fallback to generic error message.",
  "frontend/src/utils/playerName.ts": "Utility functions for normalizing and comparing player names case-insensitively, including checking if a name matches any in a list.",
  "frontend/src/utils/playerRoutes.ts": "Builds URL-encoded route paths for player aggregate stats pages.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities for extracting query params from both regular and hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/src/utils/withTimeout.ts": "Wraps a Promise with a timeout that rejects if the promise doesn't resolve within the specified time limit.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors (using OKLCH), typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking architectural notes about fixing React #185 infinite render loop by wrapping handleLiveRackUpdate with useCallback in PracticeGamePage.tsx."
}