{
  "backend/main.mo": "Main Motoko actor implementing access control, user approval, invite-only mode, user profiles, and match history storage for multiple game modes (Accepting Gifts, Straight Shot, APA Practice, Official APA) with CRUD operations and query methods.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: matchup analysis updates to include practice/official APA games with visual differentiation, PPI/aPPI calculations using best 10 of last 20 official matches, and skill level predictions using the same best-10-of-20 logic.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, and utilities covering authentication, game modes, stats, match history, and UI components.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation describing a UI-only change to ModeCard component that reorders buttons to show 'Start New Game' above 'Resume Game' without affecting any session storage, navigation, or gameplay logic.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for backgrounds, foregrounds, borders, charts, and sidebar components using OKLCH color space.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title for APA-style pool practice scorekeeper, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all route definitions (home, game modes, history, stats, admin), error boundaries with RouteErrorFallback component, ThemeProvider, AuthGate, and Toaster for notifications.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component displaying win/loss records for each starting ball count level (2-7) in Accepting Gifts mode with empty state handling.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Circular button component representing pool balls with four states (unscored, playerA, playerB, dead) using color-coded styling and accessibility labels showing ball number and point value.",
  "frontend/src/components/apa/apaBallStyles.ts": "Utility module defining ball state types and functions to calculate rack point totals with support for the one-away 9-ball rule where the 9-ball counts as 1 point instead of 2.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "React component for scoring a single APA 9-ball rack with ball-by-ball tracking, defensive shot counting, inning flow management, and auto-dead ball logic when match completion is imminent or 9-ball becomes irrelevant.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "React component that displays final match results including winner, skill levels, points earned/needed, defensive shots, innings, PPI, and team match points for both players.",
  "frontend/src/components/apa/MatchupAnalysisDropdown.tsx": "Dropdown menu component that extracts unique opponent names from official APA matches and allows selection for head-to-head analysis.",
  "frontend/src/components/apa/MatchupAnalysisPanel.tsx": "Panel component that displays head-to-head statistics (wins, losses, win rate, average PPI) against a specific opponent across both official and practice APA matches.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form component for creating or editing official APA match records with fields for date, opponent, skill levels, scores, innings, defensive shots, and notes, including validation and connection retry logic.",
  "frontend/src/components/apa/useApaInningFlow.ts": "React hook managing turn-based inning flow for APA matches, tracking active player, shared innings count, and ball scoring state with proper inning incrementation on player B turnover.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate component that checks user login status, invite-only mode, and approval status before rendering children. Shows loading states, login prompt, or access denied page based on authentication and authorization state.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that toggles Internet Identity authentication and clears the query cache on logout. Handles authentication errors and shows appropriate icons and text based on login state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog component for creating and editing user profiles with name and APA skill level fields. Automatically opens when authenticated user has no profile and shows connection warnings if backend actor is unavailable.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Table component displaying match history with checkboxes for bulk selection and deletion. Shows match date, results narrative, PPI/aPPI stats, and provides navigation to match details.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation, and footer. Displays app title, login button, profile setup, stats/admin navigation buttons, and a connecting indicator when backend is initializing.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button component with confirmation dialog for deleting a single match. Navigates to history page after deletion or calls optional callback.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Reusable alert dialog component for confirming match completion with customizable title, description, and confirm button text. Handles pending state and disabled conditions.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Card component displaying match summary with mode badge, date, and context-specific details (player names, scores, outcomes) based on match type (APA practice, accepting gifts, straight shot, or official APA). Navigates to match details on click.",
  "frontend/src/components/navigation/ModeCard.tsx": "A reusable card component for game mode selection that displays title, description, icon, and navigation buttons with optional resume functionality for in-progress sessions.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders line charts for APA performance metrics (PPI, aPPI, points, defensive shots) over time using Recharts, with custom dot shapes and unified timestamp-based data aggregation.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Displays a bar chart histogram showing the frequency distribution of shot counts across Straight Shot sessions.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Renders a table summarizing Straight Shot performance by ball count, showing wins, losses, and first win date for each ball count.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Displays a composed bar and line chart showing shot count trends over time with average calculation for Straight Shot sessions.",
  "frontend/src/dev/straight-shot-spot-check.md": "QA checklist document for manually verifying Straight Shot (20-shot game) functionality remains intact after code changes, covering session start, shot entry, save, and history viewing.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a retry mechanism for actor initialization by clearing and refetching the cached actor query without requiring page refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including CRUD operations for matches, user profiles, AG level index, approval status, and admin user management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like backgrounds, borders, buttons, charts, and sidebar elements.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level progression system for Accepting Gifts drill (2+8 through 7+9), with helpers for level management, clamping, and computing next baseline level based on win/loss outcomes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Manages Accepting Gifts session state including player/ghost scores, attempts, and set completion. Provides functions to apply attempt results and prepare next sets in race-to-7 format.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts and aggregates APA match statistics (PPI, aPPI, points, defensive shots) from both practice and official matches, with independent field validation and optional filtering for official-only matches.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA 9-Ball equalizer system mapping skill levels (1-9) to points-to-win targets (14-75), with validation and formatting utilities.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Implements APA 9-Ball 20-point match scoring system with conversion charts based on loser's skill level and points pocketed, mapping outcomes from 20-0 to 12-8.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcomes by determining winner/loser and calculating 20-point match scores using loser's skill level and points pocketed.",
  "frontend/src/lib/apa/apaScoring.ts": "Handles APA 9-Ball rack scoring with 10 points per rack, tracks player innings/defensive shots, validates rack totals, and calculates PPI (points per inning).",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill levels (1-9) based on PPI and aPPI averages using defined ranges, with separate range sets for Official APA Tab and Detailed Player Stats views.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Defines the official APA Expected PPI lookup table with win% buckets (10-100%) and skill levels (SL2-SL7), providing functions to bucket win percentages and lookup expected PPI values.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Derives Official APA match outcomes (win/loss/unknown) by comparing player scores against their skill-level-based targets, with helpers to use saved didWin field or derive from inputs.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Computes Official APA PPI (score divided by innings minus defensive shots) and aPPI (adjusted PPI using expected PPI table and win% from last 20 matches) with validation.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds narrative strings for match history rows, formatting results differently for Official APA, APA Practice, Straight Shots, and Accepting Gifts modes with scores and W/L indicators.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Determines the effective match date timestamp for sorting, preferring user-entered dates for Official APA matches and falling back to dateTime, with formatting helpers.",
  "frontend/src/lib/matches/matchBuilders.ts": "Provides buildOfficialApaMatchLog function to construct Official APA match records with auto-derived didWin outcome, re-exporting other match builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Contains builders for APA Practice, Accepting Gifts, and Straight Shot match records with player stats, outcomes, and UUID generation.",
  "frontend/src/lib/session/inProgressSessions.ts": "Manages per-mode in-progress session state in sessionStorage with helpers to check, clear, and list active sessions for APA Practice, Accepting Gifts, and Straight Shot modes.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes Accepting Gifts performance statistics (wins/losses) grouped by starting ball count (2-7) from completed race-to-7 sets.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Calculates Accepting Gifts summary statistics including total sessions and rolling average of ending object ball counts.",
  "frontend/src/lib/stats/officialApaStats.ts": "Computes official APA match statistics including win rate, total matches, and best 10-of-20 averages for PPI and aPPI metrics.",
  "frontend/src/lib/stats/straightShotStats.ts": "Calculates Straight Shot drill statistics including rolling/lifetime averages, lowest shot count, trend data, histogram, and win/loss summary by ball count.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Game page for Accepting Gifts mode managing session state, attempt tracking, set completion, and match saving with retry connection handling.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays rules and instructions for the Accepting Gifts drill including objective, level system, match format, progression rules, and progress tracking.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for the Accepting Gifts game mode that allows users to select a difficulty level, view rules, and start or resume a session with confirmation dialogs for overwriting in-progress games.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Live scoring page for APA practice matches that tracks rack-by-rack scoring, innings, defensive shots, and handles match completion with save functionality and retry connection logic.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Setup page for APA practice matches where users enter player names and skill levels, with auto-loading from user profile and validation to prevent duplicate player names.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Edit page for official APA match logs that loads existing match data and renders the RealApaMatchForm in edit mode with navigation back to match details.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Entry page for creating official APA match logs after the fact (not for live scoring), rendering the RealApaMatchForm in create mode.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Access denial page for invite-only app that allows users to request approval from the owner with success feedback after submission.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Match details page that displays comprehensive information about a completed match including mode-specific stats (APA practice or official), player performance metrics, and edit/delete actions.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Displays a paginated match history with tabs for filtering by match mode (All, APA, Gifts, Straight), sortable by date, and toggleable between card and table views.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying four mode cards (Official APA Match Log, APA Practice, Accepting Gifts, Straight Shot) with navigation to match history for authenticated users.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin-only page for managing user approvals (pending, approved, rejected) and toggling invite-only mode, with bulk reject functionality.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Shows aggregate APA statistics for a specific player including PPI/aPPI skill level predictions, win rate, and matchup analysis against selected opponents using official matches only.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Deployment verification page with a checklist and navigation buttons to test routing to Home and Match History pages.",
  "frontend/src/pages/stats/StatsPage.tsx": "Main stats dashboard displaying tabbed views of APA, Straight Shot, and Accepting Gifts statistics with charts, histograms, and matchup analysis for the logged-in user.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Interactive game page for tracking a Straight Shot drill session, recording total shots taken, and saving the completed match with session persistence.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Static informational card component explaining the rules and objectives of the Straight Shot strokes drill (clear all balls in 20 shots or fewer).",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for Straight Shot drill mode that displays player stats (moving average of last 10 sessions), allows starting new sessions or resuming in-progress sessions, and includes a rules panel.",
  "frontend/src/utils/errorText.ts": "Utility function to extract readable error messages from unknown error types, handling strings, Error objects, nested errors, and objects with message properties.",
  "frontend/src/utils/playerName.ts": "Utility functions for normalizing and comparing player names case-insensitively, including checking if a name matches any in a list.",
  "frontend/src/utils/playerRoutes.ts": "Helper function to build URL-encoded route paths for player aggregate stats pages.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/src/utils/withTimeout.ts": "Promise wrapper that adds timeout functionality, rejecting with an error if the promise doesn't resolve within the specified time.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors (using OKLCH), typography, animations, and plugins for container queries and animations.",
  "project_state.json": "Project state tracking document for a pool statistics app, defining pending feature requests to update matchup analysis to include practice/official games and change PPI calculations to use best 10 of last 20 official matches."
}