{
  "backend/main.mo": "Motoko canister handling access control, user approvals, invite-only mode, and user profiles with permission checks.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to involved frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of short summaries describing the purpose of various frontend React components and pages.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation explaining a UI-only change that reorders Start and Resume buttons in ModeCard.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens and light/dark theme variables.",
  "frontend/index.html": "Basic HTML shell loading the React application entry point.",
  "frontend/src/App.tsx": "Main React app routing setup with TanStack Router, theme provider, AuthGate, and all page routes.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component displaying wins and losses per ball count for Accepting Gifts performance.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Button component representing an APA ball with clickable scoring states and styled state variants.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types and computes rack point totals with special handling for one‑away 9‑ball scoring.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Manages 9‑ball rack scoring with ball state tracking, inning flow, auto‑dead logic, and live/match completion updates.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results including winner, points, innings, defensive shots, and PPI for both players.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form for creating or editing APA match logs with validation, identity checks, and backend save/update actions.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Hook managing APA inning flow, active player, turn changes, rack resets, and inning counting.",
  "frontend/src/components/auth/AuthGate.tsx": "Controls access based on identity, approval, admin status, and invite‑only mode, showing fallbacks or gated content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with error handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Manages user profile creation and editing, handling loading state, backend connectivity, and saving profile data.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Displays sortable match history with running win/loss stats and supports selecting and bulk-deleting matches.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, navigation, footer, and handles auth-related UI and connection status.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Provides a confirmation dialog and logic to delete a single match and navigate afterward.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Reusable confirmation dialog for ending a match with customizable text and pending state.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Renders a summary card for a match, deriving labels and outcome details based on match mode and data.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card UI for starting or resuming game modes, handling navigation and session resume detection.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders two line charts for PPI/aPPI trends and match results using processed APA aggregate data with a custom timestamp tooltip.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Builds a histogram of straight‑shot counts and displays it in a bar chart with frequency mapping.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Shows a summary table of straight‑shot session stats including wins, losses, and first win dates.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Displays a composed chart of straight‑shot trends over time with a custom tooltip for full timestamps.",
  "frontend/src/dev/straight-shot-spot-check.md": "Provides a manual QA checklist for validating Straight Shot gameplay, data saving, and UI behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a helper to clear and refetch the actor query to retry backend connection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider, handling auth client creation, identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for match, user profile, and level index operations using the actor interface.",
  "frontend/src/index.css": "Sets Tailwind layers and defines CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level Accepting Gifts progression system with helpers for clamping, retrieving levels, computing max attempts, and updating baseline levels.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Manages Accepting Gifts session state, updating scores and attempts per input and preparing the next set.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match datapoints and computes aggregate series using timestamps, PPI, aPPI, and scoring fields.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Provides APA 9-ball skill levels with their points-to-win, plus helpers for validation and formatting.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines the 20‑point APA 9‑ball match point chart and thresholds for converting loser points to match outcomes.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcomes using player scores, skill levels, and the match point chart.",
  "frontend/src/lib/apa/apaScoring.ts": "Implements APA 9‑ball rack scoring, PPI calculation, rack validation, and player stat aggregation.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill levels based on PPI and aPPI using predefined numeric ranges.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Defines the expected PPI lookup table by win% buckets and skill levels, plus helper functions to bucket win% and fetch expected PPI.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Computes official APA win/loss/unknown outcomes based on skill levels and scores, and provides a wrapper that prefers a saved didWin value.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Implements PPI and aPPI calculations, including parsing inputs, computing win%, and deriving contextual aPPI using match history.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds match result narrative strings for various match types and computes Accepting Gifts outcomes.",
  "frontend/src/lib/history/matchWinLoss.ts": "Derives win/loss outcomes for multiple match modes and contains helpers for tallying win/loss records.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses official APA dates with validation and provides effective match timestamp and formatted date utilities.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds official APA match log records, deriving didWin from inputs, and re-exports other match builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Builds APA 9-ball practice match records, generating IDs, computing outcomes, and formatting player stats.",
  "frontend/src/lib/session/inProgressSessions.ts": "Provides helpers for checking, clearing, and listing in-progress session keys stored in sessionStorage.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes win/loss stats for Accepting Gifts matches grouped by starting ball count (2–7).",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Calculates total sessions and rolling averages of ending ball counts for Accepting Gifts matches.",
  "frontend/src/lib/stats/officialApaStats.ts": "Computes official APA stats including wins, win rate, PPI, and APPI from match data.",
  "frontend/src/lib/stats/straightShotStats.ts": "Generates Straight Shot statistics including trends, averages, histograms, and summary rows.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider, rendering the root component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Loads and manages an Accepting Gifts drill session, handling attempts, set progression, persistence, and match saving.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays rules and structure of the Accepting Gifts drill including levels, match format, and progression.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Provides setup UI for starting or resuming an Accepting Gifts session, selecting levels, and initializing session state.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Runs the APA practice match session, restoring state, tracking racks and scoring, and saving results when complete.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Collects player names, skill levels, and notes to configure and start a new APA practice match, with duplicate-name checks and resume handling.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Loads an existing official APA match log and renders a form to edit and save its data.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Displays a form for creating a new official APA match log entered after the match.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Displays an invite‑only access page and lets users request approval, showing a confirmation once submitted.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Shows detailed match information including APA-specific stats, handling loading and missing match states.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Lists all matches with tabs and view modes, filtering by match type and rendering as cards or a table.",
  "frontend/src/pages/HomePage.tsx": "Displays the main navigation hub with mode cards and optional match history link based on authentication.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page for managing user approvals and invite‑only mode with approve/reject actions and status filtering.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays a player's APA aggregate statistics, predicted skill levels, and charts derived from match history.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Provides a deployment verification page with navigation tests and quick links to Home and History.",
  "frontend/src/pages/stats/MatchupsPage.tsx": "Builds opponent lists and filters matches to show head‑to‑head stats by opponent and match mode.",
  "frontend/src/pages/stats/StatsPage.tsx": "Displays overall stats across APA, Straight Shot, and Accepting Gifts modes, pulling match data and rendering charts and summaries.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Manages an in-progress Straight Shot session with persistence, input handling, and match submission to the backend.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Shows the rules and instructions for the Straight Shot drill using a simple card layout.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Starts or resumes Straight Shot sessions, displaying recent performance and storing session state in sessionStorage.",
  "frontend/src/utils/errorText.ts": "Extracts a readable error message from various error shapes, handling nested and unknown formats.",
  "frontend/src/utils/playerName.ts": "Provides helper functions for normalizing and comparing player names case-insensitively.",
  "frontend/src/utils/playerRoutes.ts": "Generates route paths for player-specific stats pages.",
  "frontend/src/utils/urlParams.ts": "Utility for retrieving, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout and throws an error if it exceeds the limit.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Defines project state and requirements for updating Match History table logic, limiting changes to APA match identification, aPPI display rules, and unified sorting. Lists existing features, pending requests, and architectural notes for surgical logic updates."
}