{
  "backend/main.mo": "Actor implementing access control, user approvals, invite‑only mode, and user profile storage with various guards and admin‑only operations.",
  "feature_evidence.json": "Evidence report listing feature requirements, affected files, components, and tests for chart fixes and debug taps.",
  "frontend-file-summaries.txt": "Aggregated summaries describing purposes and behavior of many frontend components and pages.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation describing a UI-only change that reorders Start New Game and Resume Game buttons in ModeCard.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark modes, and base element styling.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main router configuration with routes, layout, AuthGate, and global error fallback components.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component showing Accepting Gifts win/loss records per ball count.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Clickable APA ball button with color states for scoring and accessibility labels.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types and calculates rack point totals including one-away 9-ball adjustments.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Manages scoring for an APA 9-ball rack with ball state tracking, inning flow, auto-dead logic, and match-context-aware point calculation.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results including winner, points, innings, defensive shots, and PPI for both players.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form for creating or editing a real APA match with validation, skill-level logic, connection handling, and save/update operations.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Custom hook managing APA inning flow, active player, inning counts, and turn progression.",
  "frontend/src/components/auth/AuthGate.tsx": "Controls gated access based on authentication, approval, admin status, and invite-only mode before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button tied to Internet Identity with automatic session handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating or editing a user profile with name and APA skill level, including connection warnings and save logic.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Table displaying match history with derived APA stats like PPI, aPPI, and win rate, plus navigation to match details.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation controls, profile setup, login button, and connection status handling.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button and confirmation dialog to delete a match and navigate back or trigger a callback after deletion.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Generic confirmation dialog for ending a match with customizable text and pending state handling.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Card summarizing a match with mode-specific details, score, outcome, and navigation to the match view.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card for selecting or resuming a game mode with start and optional resume actions.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Builds multiple APA stat time-series from data points and renders combined Recharts line charts inside a card.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Converts shot count frequencies into a histogram and displays them using a Recharts bar chart.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Renders a table summarizing wins, losses, and first-win dates for Straight Shot sessions.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Plots shot count trends over time using a composed bar and line chart with an average value.",
  "frontend/src/dev/straight-shot-spot-check.md": "Manual QA checklist for verifying Straight Shot session flow and expected behavior.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor tied to Internet Identity, invalidating dependent queries on changes.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a helper to clear and refetch the actor query for reconnecting to the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, status, and provider setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating match and user data through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining light/dark color tokens and global styling.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level Accepting Gifts progression plus helpers for clamping, retrieving levels, computing max attempts, and updating baseline levels.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Manages Accepting Gifts session state and provides functions to apply attempt results and reset sets between races.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts cleaned APA match stats per player from practice and official matches, computing PPI/aPPI and related fields.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Provides APA 9-ball skill-level-to-points mappings and helpers for formatting and validating skill levels.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines the APA 20‑point match conversion chart and thresholds for determining match outcomes based on loser SL and points.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcomes using targets and the match‑point chart to determine winner and match points.",
  "frontend/src/lib/apa/apaScoring.ts": "Implements APA rack scoring, PPI calculations, validation, and aggregation of per‑rack player stats.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill level based on PPI or aPPI by matching ranges to estimated SL values.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Contains the official expected PPI lookup table and helpers to bucket win% and retrieve expected PPI by SL.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Derives win/loss/unknown APA outcomes from skill levels and scores and provides a helper that falls back to derivation when didWin is undefined.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Computes official APA PPI/aPPI values and win percentages using match context and validates numeric inputs.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds concise match result narrative strings based on match mode and available score data.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses user-entered dates for APA logs and determines effective timestamps for sorting and display.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds official APA match log records and derives didWin automatically, re-exporting other match builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Constructs APA practice and other non-official match records with UUIDs, stats, and outcome computation.",
  "frontend/src/lib/session/inProgressSessions.ts": "Manages in-progress session state per game mode in sessionStorage, including checks and clearing.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes win/loss counts for Accepting Gifts matches grouped by starting ball count.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Calculates total sessions and rolling averages of ending ball counts for Accepting Gifts matches.",
  "frontend/src/lib/stats/officialApaStats.ts": "Aggregates official APA match stats including win rate, average PPI, and average aPPI from valid matches.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes straight-shot statistics including averages, trends, histogram data, and win/loss summaries from match history.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Manages Accepting Gifts game state, handling attempts, set progression, persistence, and match saving.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays rules and structure of the Accepting Gifts drill, including levels and match format.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start screen for Accepting Gifts sessions allowing player setup, level selection, and session creation or resume.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Handles APA practice game scoring, state persistence, rack updates, and match completion flow with optional save and retry connection handling.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Provides form to start an APA practice session, including player names, skill levels, duplicate checks, and session management.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Loads an existing official APA match and displays a prefilled edit form, redirecting if the match is missing.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Displays a blank form for creating an official APA match log after the fact.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Shows an access-blocked message and lets the user request approval, with success feedback.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays detailed match information with APA‑specific stats and navigation to related player pages.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows match history with sorting, tab filters, card/table views, and navigation origin handling.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with navigation cards for different practice modes and optional link to match history.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page for viewing and managing user approval requests and toggling invite-only mode.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays a player's APA aggregate statistics, charts, win rate, and predicted skill levels.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Provides a deployment smoke-check page with verification checklist and navigation buttons.",
  "frontend/src/pages/stats/StatsPage.tsx": "Main stats dashboard showing APA, Straight Shot, and Accepting Gifts analytics with navigation to detailed player stats.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Handles an in-progress Straight Shot session, including shot tracking, session persistence, and match submission.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Static rules panel explaining how the Straight Shot drill works.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for creating or resuming a Straight Shot session with player input, rules, and recent averages.",
  "frontend/src/utils/errorText.ts": "Utility to extract human-readable messages from various error formats.",
  "frontend/src/utils/playerName.ts": "Helper functions for normalizing and comparing player names.",
  "frontend/src/utils/playerRoutes.ts": "Builds route paths for navigating to a player's stats page.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL and hash query parameters, store/retrieve them from sessionStorage, and persist or clear them as needed.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting with an error if it exceeds the specified duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, container settings, and enabling several Tailwind plugins.",
  "project_state.json": "Tracks the project’s build state, including expanded Accepting Gifts overhaul requirements, APA mode design rules, UI/logic constraints, and known issues."
}