{
  "backend/main.mo": "Backend actor handling access control, user approvals, profiles, and core match-related types with admin‑gated mutations.",
  "feature_evidence.json": "Feature evidence report describing required visual-only Line stroke changes and connectNulls updates in ApaAggregateCharts.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files used for reference in build planning.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation of UI-only change moving Resume Game button below Start New Game in ModeCard.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "Root HTML file bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app router configuration with AuthGate, layout, route definitions, and global error fallback.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component showing wins and losses by ball count for Accepting Gifts mode.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Interactive APA ball button rendering ball state with color-coded styles and accessibility labels.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball states, point values, and rack total calculations including one-away 9‑ball rule adjustments.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Rack scoring UI managing ball states, inning flow, auto-dead logic, and live/match completion updates.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results, player stats, and team match point outcomes.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form for creating or editing APA match records with validation, saving, and connection handling.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Hook managing inning flow, active player turns, and shared inning counting.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate that handles login, access checks, invite-only rules, and renders children if authorized.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating or editing a user profile, handling backend readiness, validation, and save actions.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Renders a match history table with derived APA metrics, outcomes, and navigation to match details.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation controls, connection state indicators, and routed content.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Provides a confirmation dialog and logic to delete a match and redirect or trigger a callback.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Reusable confirmation dialog for ending a match with configurable text and pending state.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a summary card for a match, including mode, date, scores, and computed outcomes.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card UI for selecting or resuming a game mode with navigation and session resume logic.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders APA performance trend charts by merging and sorting datapoints, showing multiple line charts with custom markers.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Builds a frequency histogram of shot counts and displays it using a bar chart.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Shows a summary table of straight-shot results including wins, losses, and first win date by ball count.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Displays shot trends over time with a composed bar and line chart and computes average shots.",
  "frontend/src/dev/straight-shot-spot-check.md": "Manual QA checklist for verifying Straight Shot functionality after changes.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a hook to clear and refetch the cached actor for reconnection attempts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, managing login, stored identity, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on matches and user profiles using the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers and custom CSS variables for light and dark themes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level Accepting Gifts progression and helpers for clamping, lookup, max attempts, and baseline updates.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Manages Accepting Gifts session state and updates scores or prepares new sets based on attempt results.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts cleaned APA match datapoints from practice and official matches, computing PPI/aPPI and related stats.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Maps APA skill levels to points-to-win values and provides validation and formatting utilities.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines the APA 9-ball 20‑point conversion chart and thresholds based on loser skill level and points.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcomes using loser SL/points and converts them to match‑point results.",
  "frontend/src/lib/apa/apaScoring.ts": "Provides APA rack scoring, PPI calculation, validation, and aggregation of player rack statistics.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill levels using PPI or aPPI ranges against predefined lookup thresholds.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Contains the official expected PPI table and utilities for bucketing win% and looking up expected PPI by SL.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Derives official APA win/loss/unknown outcomes based on skill levels and scores and exposes a helper that prefers a saved didWin flag when present.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Computes APA PPI and aPPI values and calculates win percentages and context‑aware aPPI using match history.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds short narrative result strings for match history across APA, Official APA, Accepting Gifts, and Straight Shot modes.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses official date strings and determines the effective match timestamp, preferring user-entered official dates when valid.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds Official APA match log records and auto-derives didWin based on skill levels and scores, re-exporting other builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Constructs APA practice and related match records, including outcome and player stats calculations.",
  "frontend/src/lib/session/inProgressSessions.ts": "Provides helpers for checking, clearing, and listing in-progress sessionStorage states per game mode.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes wins and losses for Accepting Gifts matches grouped by starting ball count (2–7).",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Aggregates Accepting Gifts stats including total sessions and rolling average of ending ball counts.",
  "frontend/src/lib/stats/officialApaStats.ts": "Aggregates Official APA stats including win rate, average PPI, and average aPPI across all official matches.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes straight-shot practice statistics including averages, trends, histogram data, and win-loss summaries from match records.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Runs the Accepting Gifts drill session, managing game state, progression, scoring, and match saving.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules and structure of the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for the Accepting Gifts drill allowing player setup, level selection, and session creation or resume.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Manages the APA practice game flow, restoring and saving session state, tracking rack scoring, and handling match completion and saving.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Displays the setup form for starting an APA practice match, handling player names, skill levels, duplicate checks, and restoring in‑progress sessions.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Loads an existing official APA match and renders an editable form, redirecting if the match is missing.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Provides a form to manually create an official APA match log after the fact.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Shows an access‑denied message and allows users to request approval to use the app.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays detailed information for a single match, including APA‑specific stats and navigation to related views.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows the full match history with sorting, filtering by match type, and card or table view modes.",
  "frontend/src/pages/HomePage.tsx": "Renders the home screen with navigation cards for different game modes and optional match history link.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page to view and manage user approvals and toggle invite-only mode with approve/reject actions.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays a player's APA aggregate stats, charts, win rate, and predicted skill levels with navigation handling.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Provides a deployment verification page with basic navigation tests.",
  "frontend/src/pages/stats/StatsPage.tsx": "Shows the logged-in user's APA, Straight Shot, and Accepting Gifts stats with charts and navigation to detailed views.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Handles active Straight Shot drill sessions, including session persistence, shot tracking, and saving match results.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Static panel describing rules and objectives of the Straight Shot drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for new Straight Shot sessions with player input, moving average display, and resume/overwrite logic.",
  "frontend/src/utils/errorText.ts": "Utility to extract readable error messages from various error object formats.",
  "frontend/src/utils/playerName.ts": "Functions for normalizing and comparing player names case-insensitively.",
  "frontend/src/utils/playerRoutes.ts": "Builds the route path for a player's aggregate stats page using URL encoding.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL and hash params, persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects with an error if the limit is exceeded.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, color tokens, typography, animations, and plugin setup.",
  "project_state.json": "Project state file describing build scope, gameplay architecture notes, and current known issues."
}