{
  "backend/main.mo": "Actor managing access control, user approval, invite-only mode, and per-user profiles.",
  "feature_evidence.json": "Feature evidence report listing feature changes, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend files.",
  "frontend/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React app with router setup, theme provider, AuthGate, and global error fallback.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Button component for APA balls showing number, state-based styling, and accessible labels.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball scoring helpers including ball values, state labels, and rack total calculations.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Manages rack scoring UI for APA 9-ball, including ball states, innings, defensive shots, auto-dead logic, and live updates.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results with player stats, points, innings, defensive shots, and match point outcomes.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Provides a form for creating or editing official APA match logs with validation, connection handling, and save/update actions.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Hook that manages inning flow logic, active player turns, shared innings, and reset behavior for APA racks.",
  "frontend/src/components/auth/AuthGate.tsx": "Gates app access based on authentication, approval, admin status, and invite-only mode, showing login or restriction screens as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that manages Internet Identity auth and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating or editing a user profile, handling form state, validation, and saving via backend hooks.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, footer, login controls, and profile setup/edit dialogs.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button with confirmation dialog to delete a match and optionally navigate or trigger a callback.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Dialog to confirm ending and saving a match session with async handling and error reporting.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Card displaying a match summary, including mode, date, players, and outcome details.",
  "frontend/src/components/navigation/ModeCard.tsx": "Clickable card that displays a game mode and navigates to start a new match.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Charts showing APA performance trends using computed PPI and match result series with rolling averages.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages the authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useActorRetry.ts": "Hook providing a function to clear and refetch the actor query to retry backend connection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating match data and user profiles through an actor-based backend API.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and sets light/dark theme CSS variables for colors and layout.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Implements state transitions for an \"accepting gifts\" game mode, including scoring updates and set progression.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match data points and win-rate statistics from match history, including practice and official logs.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA skill levels and point targets, with helpers for validation and formatting.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Provides APA 9-ball match point conversion charts and types for determining match-point outcomes based on loser SL and points.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA practice match outcomes by determining the winner, applying the match-point chart, and returning structured results.",
  "frontend/src/lib/apa/apaScoring.ts": "Defines interfaces and helpers for APA 9-ball rack scoring, validation, and PPI/stat calculations.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Computes official APA match outcomes based on skill levels and scores, with helpers for fallback outcome resolution.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Parses inputs and calculates official APA PPI using score divided by innings minus defensive shots, with formatting utilities.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses user-entered dates and derives an effective match timestamp for sorting and display.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds official APA match log records, deriving win/loss when possible and delegating other builders to the original file.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Implements builders for APA practice, Accepting Gifts, and Straight Shot match records with detailed stats.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Runs the active Accepting Gifts drill, loading and persisting game state, handling attempts and set transitions, and syncing baseline counts to the backend.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules, scoring, progression, and tips for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Configures and starts a new Accepting Gifts session, managing player info, baseline ball count, and session initialization.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Runs the APA practice match flow, handling rack scoring, state persistence, match completion, and saving results.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Collects player names and skill levels, prevents duplicates, computes race targets, and initializes a new APA practice session.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Loads an existing official APA match log for editing and passes the data into the form, redirecting if the match is missing.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Provides a form for creating a new official APA match log manually after the match.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Displays an invite‑only access block and lets the user request approval, showing confirmation once submitted.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Loads and displays detailed match information with APA‑specific stats and navigation controls.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows a sortable, filterable list of past matches grouped by mode with navigation back to home.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with navigation cards for match modes and a link to match history.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page for managing user approvals and invite‑only mode, including approving, rejecting, and bulk actions.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Aggregates and displays APA player statistics, including win rates, PPI averages, and match breakdowns.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Provides a deployment verification page with navigation tests to Home and Match History.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Handles straight‑shot game state, persistence, and saving match results, with UI for editing shots and ending the game.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Displays the rules, objectives, and win conditions for the Straight Shot drill using a card layout.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Renders the start page for the Straight Shot drill with player inputs, rules toggle, moving average calculation, and navigation to the game.",
  "frontend/src/utils/errorText.ts": "Provides a helper to extract a readable error message from various error shapes, including nested objects.",
  "frontend/src/utils/playerName.ts": "Contains utilities to normalize and compare player names case‑insensitively.",
  "frontend/src/utils/playerRoutes.ts": "Generates the route path for a player's stats page using URL encoding.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and persisting URL parameters and session parameters.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout and rejects with a custom error if exceeded.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, plugins, colors, typography, and custom animations.",
  "project_state.json": "Describes the project’s current state, goals, architectural notes, and known issues for the pool practice app."
}