{
  "backend/main.mo": "Actor implements access control, user approvals, invite-only mode, and basic user profile storage with permission checks.",
  "backend/migration.mo": "Defines old and new match record types to support data migration for multiple match modes.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of high-level summaries for various frontend files and components.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with theme and auth providers.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Button component representing an APA ball with state-based styling and accessibility labeling.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types and helpers to compute ball values and total rack scoring contributions.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Interactive rack-scoring UI managing ball states, innings, defensive shots, and auto-dead logic for 9-ball APA scoring.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results, per-player stats, and match-point outcomes with styled summary cards.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Custom hook managing player turns, innings, and ball-scoring flow for APA gameplay.",
  "frontend/src/components/auth/AuthGate.tsx": "Wraps protected content, handling identity login, access checks, and invite-only restrictions.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button using Internet Identity with auto-retry handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating or editing user profiles with name and optional APA skill level.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation, auth controls, profile editing, and routed content.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Delete button that opens a confirmation dialog and deletes a match via mutation before navigating or calling a callback.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Dialog for confirming end-of-session actions, triggering an async save and closing when complete.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Clickable card that formats and displays match metadata and summary text, navigating to match details on click.",
  "frontend/src/components/navigation/ModeCard.tsx": "UI card for selecting a game mode with icon, description, and a button that navigates to a start path.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Generates PPI and match result trend charts using computed series and rolling averages for APA player data.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, invalidating related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identity loading, and login lifecycle state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, matches, and accepting-gifts data through the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light and dark theme CSS variables for colors and layout.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Implements state updates for the Accepting Gifts drill, including attempt handling and set progression.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match stats for a player and provides helpers for PPI, match results, rolling averages, and date formatting.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA skill levels, points-to-win mappings, and formatting/validation helpers.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Holds the APA 9-ball match point conversion charts and related types.",
  "frontend/src/lib/apa/apaScoring.ts": "Provides APA rack scoring utilities, PPI calculation, validation, and player stat aggregation.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds APA 9-ball practice match records with stats, PPI, racks, and metadata.",
  "frontend/src/main.tsx": "Initializes React app with query client, identity provider, and global styles.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Loads, updates, and persists an Accepting Gifts drill game state, handling attempt outcomes, set progression, and baseline syncing.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules, setup, scoring, and progression details for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Collects user input to initialize a new Accepting Gifts session and persists the starting baseline before navigating to the game.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Manages APA practice match state, processes rack results, checks completion, and saves match data.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Captures player info and skill levels to initialize an APA practice match and stores initial match state.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Provides a form for logging an official APA match with validation and saves the result to history.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Displays an invite-only access message and allows users to request approval, showing confirmation once submitted.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Fetches and displays detailed information for a specific match with mode-specific styling and metadata.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows a tab-filterable list of past matches with navigation and loading states.",
  "frontend/src/pages/HomePage.tsx": "Renders the app homepage with navigation cards for practice modes and match history.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page for managing user approvals, invite-only mode, and bulk rejection actions.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Aggregates and displays APA match statistics for a specific player with summary metrics and charts.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Manages the Straight Shot drill session, tracking strokes and events, and saving results as a match.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Shows rules and instructions for the Straight Shot Strokes Drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for the Straight Shot drill that collects player input, initializes game state, shows recent moving-average stats, and navigates to the game screen.",
  "frontend/src/utils/playerName.ts": "Provides name normalization and comparison helpers for consistent player matching.",
  "frontend/src/utils/playerRoutes.ts": "Generates the stats route path for a given player name.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, animations, and plugins.",
  "project_state.json": "Project state metadata describing app scope, architecture notes, issues, and existing features."
}