{
  "backend/main.mo": "Main backend actor handling authorization, invite-only mode, user approvals, profile storage, and match-related type definitions.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, file impacts, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries for numerous frontend components and pages describing their roles and behaviors.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation describing the ModeCard UI change that moves the Resume button below Start New Game.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and global styling.",
  "frontend/index.html": "Base HTML file loading the root React application and main module script.",
  "frontend/src/App.tsx": "Top-level React router configuration with routes, error boundaries, layout, and AuthGate integration.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Card/table component that displays Accepting Gifts win/loss performance by starting ball count.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Button component for representing an APA ball with scoring state styles and accessibility labels.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types and helpers including ball values and rack total calculations with one‑away 9‑ball adjustments.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Manages per-rack APA 9-ball scoring, ball states, defensive shots, auto-dead-ball logic, inning flow, and sends rack updates and completion data.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays post-match summary showing winner, match points, and detailed stats for both players such as skill level, points, innings, and PPI.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Provides a form to create or edit APA match logs with validation, identity checks, and save/update mutations.",
  "frontend/src/components/apa/useApaInningFlow.ts": "React hook that tracks active player, shared innings, and inning transitions for APA rack play.",
  "frontend/src/components/auth/AuthGate.tsx": "Controls access by checking identity, approval, admin status, and invite-only mode before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that handles login/logout via Internet Identity and clears cached queries on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating or editing a user profile, handling identity state, backend readiness, and saving profile data.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Renders a match history table with APA-derived stats and navigation to match details.",
  "frontend/src/components/layout/AppLayout.tsx": "App-wide layout with header, navigation buttons, connection status, profile setup, and routed content.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button and confirmation dialog to delete a match and optionally navigate afterward.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Reusable confirmation dialog for ending a match with customizable text and pending state.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Summary card displaying key match info, mode labels, and computed outcome or score.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card UI for starting or resuming a game mode with navigation and session resume support.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Generates multiple APA performance trend datasets from match data and renders charts with Recharts.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Builds a frequency histogram from shot counts and displays it in a bar chart.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Displays a summary table of wins, losses, and first-win dates grouped by ball count.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Shows shot-count trends over time using a combined bar and line chart with an average indicator.",
  "frontend/src/dev/straight-shot-spot-check.md": "Manual QA checklist for verifying Straight Shot session flow and correctness after code changes.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a helper to clear and refetch the actor query to retry backend connection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity persistence via context.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating match data, user profiles, approvals, and related backend calls.",
  "frontend/src/index.css": "Tailwind base/theme configuration defining CSS variables for light and dark UI color palettes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Defines game state and provides helpers to clamp ball counts, apply attempt results, and advance to the next set.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match stats for a player and computes PPI/aPPI data points and best‑of‑20 averages.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Provides APA skill levels, points‑to‑win mapping, and formatting/validation utilities.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines the 20‑point match outcome chart and thresholds for converting loser points to match scores.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA practice match outcomes using targets, loser SL, and point‑conversion charts.",
  "frontend/src/lib/apa/apaScoring.ts": "Implements APA rack scoring utilities, PPI calculation, and player stats aggregation.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill level based on PPI or aPPI ranges.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Provides the official expected PPI table with win‑percent buckets and lookup helpers.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Determines official APA match outcome from scores and skill levels, with fallback to didWin flag.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Implements PPI/aPPI calculations, input validation, win-percentage lookup, and context-dependent Official APA aPPI computation.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds human-readable match result strings for various match modes including Official APA, APA practice, Accepting Gifts, and Straight Shot.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses official match dates safely and computes a consistent effective timestamp for sorting and display.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds Official APA match log records and re-exports other match builders, deriving outcome when skill levels and scores are available.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Contains builders for APA Nine Ball, Accepting Gifts, and other legacy match modes, constructing match records with detailed stats.",
  "frontend/src/lib/session/inProgressSessions.ts": "Provides helpers to check, clear, and list in-progress sessionStorage entries for different game modes.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes Accepting Gifts win/loss totals grouped by starting ball count from match history.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Calculates summary stats for Accepting Gifts sessions, including total sessions and rolling average of ending ball counts.",
  "frontend/src/lib/stats/officialApaStats.ts": "Computes aggregated Official APA stats including win rate, average PPI, and average aPPI across applicable matches.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes statistics for straight-shot matches including averages, trends, histogram data, and win/loss summaries.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Manages the Accepting Gifts game session state, handling attempts, set progression, persistence, and match saving.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Shows rules and guidance for the Accepting Gifts drill including objectives, setup, scoring, and tips.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Allows users to start or resume an Accepting Gifts session, configure initial details, and view rules.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Loads and manages APA practice game state, handles rack scoring, completion logic, and saving the match.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Collects player names and skill levels to start a new APA practice game, handling validation and in‑progress sessions.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Fetches an existing official APA match and renders a form for editing its logged data.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Provides a page to create a new official APA match log using the form component.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Shows an access-denied message and allows users to request approval to use the app.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays detailed information for a specific match, including APA-specific stats and navigation options.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows sortable match history with card and table views, grouped by match mode.",
  "frontend/src/pages/HomePage.tsx": "Displays the home dashboard with navigation cards for all game modes and match history access.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page to view and manage user approval requests and toggle invite-only mode.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays a player's APA aggregate stats, charts, win rate, and predicted skill levels.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Provides a deployment verification page with basic navigation tests to Home and Match History.",
  "frontend/src/pages/stats/StatsPage.tsx": "Shows the logged-in user's aggregated stats across multiple modes with navigation to detailed views.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Runs an in-progress Straight Shot session, saving state and submitting the completed match.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Presents rules and instructions for the Straight Shot drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Starts a new Straight Shot session, showing recent averages and handling in‑progress session conflicts.",
  "frontend/src/utils/errorText.ts": "Extracts a readable error message from various error shapes.",
  "frontend/src/utils/playerName.ts": "Provides utilities for normalizing and comparing player names.",
  "frontend/src/utils/playerRoutes.ts": "Builds URL paths for navigating to player stats pages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL params (including hash routing), storing them in sessionStorage, and retrieving or clearing persisted values.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout and rejects with an error if the timeout is exceeded.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Project state file describing current build version, scoped upcoming work on APA stats/graphs, architectural notes, and known issues."
}