{
  "backend/main.mo": "Main Motoko canister implementing user profiles, authorization checks, match data structures, and preparation for data migration.",
  "backend/migration.mo": "Migration module adding agSessions to persisted state while preserving existing user profiles and match history.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Reference file containing short textual summaries of key frontend files and their roles.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/index.html": "Base HTML document loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Root React component configuring themes, auth gate, layout, and all application routes.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Button component representing a numbered APA ball with state-based styles and scoring value.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types and helpers for ball values, labels, and calculating rack point totals.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Interactive 9‑ball rack scoring panel managing ball states, innings, defensive shots, and auto‑dead logic before reporting rack results.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match summary including winner, match points, and detailed stats for both players.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Custom hook tracking active player, inning counts, and turn flow with methods to update state.",
  "frontend/src/components/auth/AuthGate.tsx": "Gate component that blocks content until identity loads, showing login or children accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with error handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter and save a profile name via a dialog.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, footer, login button, routed content outlet, and profile setup dialog.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button with confirmation dialog for deleting a match and navigating afterward.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Dialog to confirm ending and saving a match session with loading states.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a clickable match summary card with mode label, date, players, and mode-specific summary info.",
  "frontend/src/components/navigation/ModeCard.tsx": "Renders a navigation card with icon, description, and button to start a new game mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates related queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, matches, and Accepting Gifts baseline values using the actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Implements Accepting Gifts session logic including ball count clamping, attempt updates, and set progression.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Contains APA skill-level utilities including required points-to-win mapping and formatting helpers.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines APA 9-ball match point conversion charts mapping loser points to match point outcomes.",
  "frontend/src/lib/apa/apaScoring.ts": "Defines APA 9-ball scoring models and utilities for rack validation, PPI calculation, and player stat aggregation.",
  "frontend/src/lib/matches/matchBuilders.ts": "Creates APA 9-ball match records, generating IDs, timestamps, player stats, and rack summaries for persistence.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Manages the active Accepting Gifts drill session, handling scoring, state progression, persistence, and match saving.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules and structure of the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Initializes a new Accepting Gifts session, handling player input, baseline loading, and session setup.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Controls APA 9-ball practice matches, tracking racks, cumulative stats, completion state, and saving results.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "UI for starting an APA 9‑ball practice match by entering player names, skill levels, and notes, then saving initial game state to sessionStorage.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays details for a selected match, including players, mode‑specific info, and deletion, using match data fetched by ID.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Lists all saved matches with filtering by mode and navigation to match details, pulling data from useGetAllMatches.",
  "frontend/src/pages/HomePage.tsx": "Renders the home screen with navigation cards for different game modes and match history.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Runs the Straight Shot drill, updating strokes and events in sessionStorage and saving the match when finished.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Static rules panel describing objectives and scoring for the Straight Shot drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start screen for the Straight Shot drill, collecting player info, showing moving average, and initializing session state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store and retrieve them from sessionStorage, and clear parameters from session or URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the project's frontend styling.",
  "project_state.json": "Describes the project’s versioned state, feature set, rules for pool scoring modes, architectural notes, and known issues."
}