{
  "backend/main.mo": "Actor implements access control, user approval, invite-only logic, user profiles, and match-related types with various query and update methods.",
  "backend/migration.mo": "Migration module returning old state as new state without changes.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of multiple frontend files across components, pages, and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode palettes, and base styling rules.",
  "frontend/index.html": "HTML entry point loading the root element and main frontend script.",
  "frontend/src/App.tsx": "React router configuration defining all routes and wrapping the app in ThemeProvider, AuthGate, and layout components.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Reusable button for APA balls showing state, styling, and accessibility labels with click handling.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types, scoring values, labels, and utilities to compute rack totals.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Rack scoring UI managing ball states, innings, auto-dead logic, validation, and rack completion callbacks.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results with winner info, points, innings, defensive shots, and PPI.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form for creating or editing logged APA matches with validation, identity checks, and save/update mutations.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Custom hook tracking active player, innings, and turn flow with helpers to update inning state.",
  "frontend/src/components/auth/AuthGate.tsx": "Access control wrapper handling identity login, admin/approval checks, invite-only mode, and gated rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating or editing a user profile with name and APA skill level selection.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header, navigation actions, outlet content, footer, and profile dialogs.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button with confirmation dialog that deletes a match and navigates or triggers a callback.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Dialog that confirms saving and ending a match session with async handling and error toasts.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Card displaying match mode, date, and computed summary text with navigation to details.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card representing a game mode with icon, description, and a button navigating to start a match.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Generates PPI and match result charts using computed series and rolling averages for a player.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, auto-refreshing dependent queries when updated.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a retry mechanism that clears and refetches the cached actor query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating match data and user profiles via the backend actor with timeout and error handling.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and base styling.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Utility functions to update game state for the Accepting Gifts mode, including attempts, set progression, and ball count adjustments.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match stats, computes PPI, and aggregates outcomes for charting and win-rate calculations.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA skill levels, points-to-win mappings, and helpers for formatting and validating skill levels.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Provides APA 9-ball match point conversion tables and outcome thresholds based on loser points.",
  "frontend/src/lib/apa/apaScoring.ts": "Implements scoring logic for APA 9-ball racks, including point validation, PPI calculation, and per-player stat aggregation.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Determines official APA match outcomes using skill levels and scores, with fallback derivation logic when didWin is absent.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Calculates official APA PPI from string inputs with validation and formatting support.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses date strings for APA matches and returns a reliable timestamp, preferring official log dates over dateTime, and formats them for display.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds official APA match log records with derived win/loss outcome and re-exports other match builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Defines builders for APA 9-ball, Accepting Gifts, and other match types, constructing MatchLogRecord objects with stats and metadata.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Manages the Accepting Gifts drill gameplay loop, session persistence, scoring, and match saving.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules, scoring, and progression overview for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Provides the setup form for starting an Accepting Gifts session, including baseline selection and session initialization.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Handles APA practice match flow, loading/saving game state, updating rack results, and marking match completion.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Collects player names and skill levels to initialize a new APA practice match and stores the game state to sessionStorage.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Loads an existing official APA match and renders a form to edit its data, redirecting if not found.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Displays a form for creating a new official APA match log entered after the fact.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Shows an invite-only access warning and lets users submit an approval request.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays detailed information for a specific match, including APA-specific stats and outcomes.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Lists all past matches with filtering, sorting, and navigation to details.",
  "frontend/src/pages/HomePage.tsx": "Renders the home screen with navigation cards for all match modes and a link to match history.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page listing pending, approved, and rejected user approvals with actions to approve, reject, toggle invite-only mode, and reject all pending users.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays aggregate APA stats for a selected player, computing win rates, averages, and rendering charts and summary cards.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Runs the Straight Shot drill session, tracks strokes and events, persists state, and saves the completed match to the backend.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Shows the rules and instructions for the Straight Shot strokes drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for creating a new Straight Shot session, capturing player info and showing recent moving‑average performance.",
  "frontend/src/utils/errorText.ts": "Converts unknown error objects into readable strings, handling nested and serialized errors safely.",
  "frontend/src/utils/playerName.ts": "Normalizes and compares player names case‑insensitively and checks membership against a list.",
  "frontend/src/utils/playerRoutes.ts": "Builds the route path for a player's aggregate stats page.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, with fallback to sessionStorage and hash‑based routing support.",
  "frontend/src/utils/withTimeout.ts": "Provides a helper that wraps a promise with a timeout using Promise.race and rejects with a custom error if exceeded.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata detailing version, app summary, architectural notes, and known issues for an APA pool practice scorekeeper."
}