{
  "backend/main.mo": "Main backend actor implementing invite-only mode, user approval system, user profiles with APA skill levels, and match entry storage (APA practice, Accepting Gifts, Straight Shot) with CRUD operations and aggregate statistics queries.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: creating MatchupAnalysisDropdownPlayerStats.tsx as a copy of MatchupAnalysisDropdown.tsx, and updating the import in PlayerAggregateStatsPage.tsx to use the new component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing authentication, routing, game modes (APA Practice, Accepting Gifts, Straight Shot), match history, statistics, and UI components with their specific behaviors and state management.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation describing a UI-only change to ModeCard.tsx that reorders buttons to show \"Start New Game\" above \"Resume Game\" without changing any session logic, navigation, or gameplay functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, charts, and semantic tokens (primary, secondary, destructive, etc.).",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and title describing the app as an APA-style pool practice scorekeeper with multiple game modes.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all route definitions (home, game modes, history, stats, admin), error boundaries with custom fallback UI, and wrapping with ThemeProvider and AuthGate.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component displaying win/loss statistics for each ball count level (2-7) in Accepting Gifts mode, with empty state handling.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Circular button component representing a pool ball with four states (unscored, playerA, playerB, dead), displaying ball number and handling click events with appropriate styling and accessibility labels.",
  "frontend/src/components/apa/apaBallStyles.ts": "Utility module defining ball state types and calculation functions for APA 9-ball scoring, including the one-away rule where the 9-ball counts as 1 point instead of 2 when a player needs exactly 1 point to win.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Interactive rack scoring panel for APA 9-ball matches that tracks ball states (pocketed by player A/B, dead, unscored), manages inning flow, defensive shots, and applies auto-dead ball logic when match completion is imminent or 9-ball is pocketed.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results summary showing winner, skill levels, points earned/needed, defensive shots, innings, PPI, and team match points for both players in a card-based layout.",
  "frontend/src/components/apa/MatchupAnalysisDropdown.tsx": "Dropdown menu component that extracts unique opponent names from official APA matches and allows selection of an opponent for matchup analysis.",
  "frontend/src/components/apa/MatchupAnalysisDropdownPlayerStats.tsx": "Duplicate of MatchupAnalysisDropdown.tsx with identical functionality for selecting opponents from official APA match history.",
  "frontend/src/components/apa/MatchupAnalysisPanel.tsx": "Displays head-to-head statistics against a specific opponent including win/loss record, win rate, average PPI, and chronologically sorted match history from both official and practice APA matches.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form component for creating or editing official APA match records with fields for match date, opponent info, skill levels, scores, innings, defensive shots, and notes, including validation and connection retry logic.",
  "frontend/src/components/apa/useApaInningFlow.ts": "React hook managing APA 9-ball inning flow state, tracking active player (A/B), shared innings count, and ball-scoring status with turn-over logic that increments innings when Player B's turn ends.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate component that checks Internet Identity login status and invite-only mode approval, showing login UI for unauthenticated users and access-denied page for unapproved users.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component for Internet Identity login/logout that clears query cache on logout and handles authentication errors with retry logic.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog component for creating and editing user profiles with name and APA skill level fields, automatically opening for new users and showing connection retry UI when backend is unavailable.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Table component displaying match history with multi-select checkboxes, delete functionality, and columns for date, results narrative, PPI/aPPI stats, with navigation to match details.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header containing logo, navigation buttons (stats, admin), profile setup, login button, and footer with Caffeine.ai attribution, showing connection status when authenticating.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button with confirmation dialog for deleting a single match, navigating to history page or calling custom callback after successful deletion.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Reusable confirmation dialog component for ending matches with customizable title, description, and confirm button text, handling pending states.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a summary card for a match with mode badge, date, and match-specific details (APA scores/outcomes, Accepting Gifts status, or Straight Shot results). Includes a button to navigate to the full match details page.",
  "frontend/src/components/navigation/ModeCard.tsx": "Reusable card component for game mode selection that displays title, description, icon, and action buttons. Supports showing a 'Resume Game' button when an in-progress session exists for the mode.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders line charts for APA performance trends including PPI/aPPI, points scored, and defensive shots over time. Consolidates data points by timestamp and uses custom dot shapes to differentiate metrics.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Displays a bar chart histogram showing the frequency distribution of shot counts across Straight Shot sessions. Shows empty state when no data is available.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Renders a table summarizing Straight Shot performance by ball count, showing wins, losses, and first win date for each ball count. Displays empty state when no data exists.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Displays a composed chart with bars and trend line showing shot count over time for Straight Shot sessions. Includes average shots calculation displayed below the chart.",
  "frontend/src/dev/straight-shot-spot-check.md": "QA checklist document for manually testing Straight Shot functionality including session start, shot entry, save, and history viewing. Defines pass criteria to ensure the feature remains functional after code changes.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling both authenticated and anonymous actors. Invalidates dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a retry mechanism for actor initialization by clearing cached actor queries and triggering a refetch without requiring page refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, clear, and status tracking functionality to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on matches, user profiles, and AG level index, using the actor from useActor and managing query cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and semantic color tokens.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level Accepting Gifts progression system (2+8 through 7+9) with helpers for level clamping, max attempts, and computing next baseline level after wins/losses.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Manages Accepting Gifts session state including baseline/played level indices, set scores, and functions to apply attempt results and prepare next sets.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts and aggregates APA match datapoints (PPI, aPPI, points, defensive shots) from practice and official matches, with independent field validation and null handling.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA 9-Ball skill level to points-to-win mapping (SL1=14 through SL9=75) with validation and formatting utilities.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Implements APA 9-Ball 20-point match conversion system based on loser's skill level and points pocketed, with threshold charts for each skill level.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcome using loser's skill level and points to determine 20-point match score distribution between winner and loser.",
  "frontend/src/lib/apa/apaScoring.ts": "Handles APA 9-Ball rack scoring with 10 points per rack, ball value calculations, rack validation, PPI computation, and player statistics aggregation.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Defines APA skill level ranges for PPI and aPPI metrics with functions to predict skill levels from performance averages. Includes separate range sets for Official APA Tab and Detailed Player Stats page.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Provides the official APA Expected PPI lookup table mapping win percentage buckets (10-100%) to expected PPI values for skill levels 2-7, with functions to bucket win percentages and lookup expected PPI values.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Determines Official APA match outcomes (win/loss/unknown) by comparing player scores against skill-level-based targets from the equalizer system. Includes helpers to derive outcomes from match data or use saved didWin fields.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Calculates Official APA PPI (points per inning) and aPPI (adjusted PPI) metrics from match data. For wins, aPPI uses max of PPI and expected PPI from table; for losses, aPPI equals PPI.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds formatted narrative strings for match history display, handling Official APA, APA Practice, Straight Shots, and Accepting Gifts match types with scores and win/loss indicators.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Determines effective match timestamps for sorting and display, preferring user-entered dates for Official APA matches and falling back to system dateTime. Includes date parsing and formatting utilities.",
  "frontend/src/lib/matches/matchBuilders.ts": "Provides factory function to build Official APA match log records with automatic outcome derivation from skill levels and scores. Re-exports other match type builders from original file.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Builds APA 9-Ball match records from input parameters, generating match IDs, computing outcomes, and structuring player stats with skill levels, innings, PPI, and defensive shots.",
  "frontend/src/lib/session/inProgressSessions.ts": "Provides centralized helpers for managing per-mode in-progress session state in sessionStorage, with keys for APA Practice, Accepting Gifts, and Straight Shot modes.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes Accepting Gifts performance statistics grouped by starting ball count (2-7), tracking wins and losses from completed race-to-7 sets.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Computes summary statistics for Accepting Gifts matches, including total sessions and rolling average of ending object ball counts from the last N sessions.",
  "frontend/src/lib/stats/officialApaStats.ts": "Computes official APA match statistics including total matches, win rate, average PPI for last 10 matches, and average aPPI for best 10 of last 20 matches.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes Straight Shot drill statistics including rolling and lifetime averages, lowest shot count, trend data, histogram data, and win/loss summary by ball count.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Main game page for the Accepting Gifts drill, managing live gameplay state (player vs ghost race-to-7), rack attempts, set progression, level advancement logic, and match saving with session persistence and connection retry handling.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules and objectives for the Accepting Gifts drill, explaining the 12-level progression system (2+8 through 7+9), match format (race-to-7 vs ghost), and win/loss progression rules.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for Accepting Gifts sessions where users select their starting level, view their baseline level from profile, and can start a new session or resume an in-progress one with confirmation dialogs for overwriting.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Live scoring page for APA 9-ball practice matches, managing rack-by-rack scoring, innings, defensive shots, points tracking with target clamping, match completion detection, and session persistence with actor retry logic.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Setup page for APA practice matches where users configure two players with names and skill levels (auto-loaded from profile when names match), set race targets via equalizer, and start or resume sessions with duplicate name validation.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Edit page for official APA match logs, loading existing match data by ID and rendering the RealApaMatchForm in edit mode with pre-populated fields, redirecting to history if match not found.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Entry page for creating new official APA match logs after-the-fact (not live scoring), rendering the RealApaMatchForm in create mode with navigation back to home.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Displays an access-denied page for invite-only apps with a button to request approval from the owner. Shows success confirmation after request is submitted.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Shows detailed information for a single match including player stats, scores, and mode-specific details (APA practice, straight shot, or accepting gifts). Includes edit and delete actions.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Displays a filterable list of all matches with tabs for different game modes (APA, Gifts, Straight) and toggleable card/table views. Supports sorting by date and navigation back to previous page.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying four mode cards (Official APA Match Log, APA Practice, Accepting Gifts, Straight Shot) with navigation to match history for authenticated users.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin-only page for managing user access approvals with invite-only mode toggle. Displays pending, approved, and rejected users with approve/reject actions and bulk reject functionality.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Shows aggregate APA statistics for a specific player including best 10-of-20 PPI/aPPI averages, predicted skill levels, and matchup analysis against selected opponents. Only uses official APA match data.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Deployment verification page with a checklist and navigation buttons to test routing to Home and Match History pages.",
  "frontend/src/pages/stats/StatsPage.tsx": "Main statistics dashboard with tabs for APA, Straight Shot, and Accepting Gifts game modes. Displays charts, trends, performance metrics, and matchup analysis for the current user.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Main game page for the Straight Shot drill that manages game state (player name, notes, total shots), handles session persistence via sessionStorage, and provides UI for recording shots and ending the session with backend save functionality.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Displays the rules and objectives for the Straight Shot drill, explaining that players must clear all balls in 20 shots or fewer to win.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for Straight Shot drill that displays moving average stats from recent matches, allows starting new sessions or resuming in-progress sessions, and shows confirmation dialog when overwriting existing sessions.",
  "frontend/src/utils/errorText.ts": "Utility function that extracts readable error messages from various error types (strings, Error objects, nested objects) with fallback handling.",
  "frontend/src/utils/playerName.ts": "Utility functions for normalizing and comparing player names case-insensitively, including checking if a name matches any in a list.",
  "frontend/src/utils/playerRoutes.ts": "Helper function that builds the URL route path for a player's aggregate stats page using URL-encoded player name.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/src/utils/withTimeout.ts": "Promise wrapper utility that adds timeout functionality, rejecting with an error if the wrapped promise doesn't resolve within the specified time.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking two completed features: creating a duplicate MatchupAnalysisDropdown component and updating its import in PlayerAggregateStatsPage."
}