{
  "backend/main.mo": "Canister actor implementing access control, user approvals, profiles, and match-related types with admin-gated mutations and invite-only mode.",
  "feature_evidence.json": "Feature evidence report listing three MatchHistoryTable-related frontend requirements and their associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, pages, and their responsibilities across the app.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation of a UI-only change swapping the order of Start New Game and Resume Game buttons in ModeCard.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables, light/dark palettes, and base styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React entry wiring TanStack Router routes, theming, AuthGate, layout, and query client setup.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component showing Accepting Gifts win/loss stats by ball count or a placeholder when empty.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Clickable APA ball button styled by scoring state with accessibility labels and optional disabling.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types, values, labels, and rack total calculations including the one‑away 9‑ball rule.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Manages rack-level scoring, ball states, auto-dead logic, inning flow, and emits live or final rack results.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results including winner, points, innings, defensive shots, and PPI for both players.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Handles creating or editing an official APA match entry with validation, connection checks, and save/update logic.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Tracks active player, shared innings, and turn flow with helpers for scoring and inning calculation.",
  "frontend/src/components/auth/AuthGate.tsx": "Controls access based on authentication, approval, admin status, and invite‑only mode, gating children accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button tied to Internet Identity with query cache clearing and retry handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating or editing a user profile, handling connection readiness, form state, and profile-saving mutations.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Sortable match history table with row selection, deletion, and per-bucket running win–loss statistics.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level app layout with header navigation, connection status, profile setup handling, and routed content.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Button with confirmation dialog to delete a match and redirect or call a callback after deletion.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Reusable confirmation dialog for ending a match with customizable text and pending state.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Card summarizing a match with mode-specific labels and concise descriptive text based on match data.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card for selecting a play mode, supporting start and resume actions based on in-progress sessions.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Generates two Recharts line charts showing PPI, aPPI, match points, and defensive shots with custom timestamp tooltips.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Builds a histogram of straight-shot counts using a bar chart generated from frequency-mapped shot data.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Displays a summary table of wins, losses, and first-win dates grouped by ball count.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Renders a composed bar/line chart for straight-shot trends with date labels and detailed timestamp tooltips.",
  "frontend/src/dev/straight-shot-spot-check.md": "Provides a manual QA checklist for validating Straight Shot session creation, saving, history display, and win/loss logic.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useActorRetry.ts": "Offers a helper to clear and refetch the cached actor query for retrying connection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login handling, identity persistence, and related status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for matches, user profiles, and settings, using the backend actor for CRUD operations.",
  "frontend/src/index.css": "Configures Tailwind layers and defines CSS variables for light/dark themes and global styles.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level Accepting Gifts progression system with helpers for clamping, lookup, max attempts, and baseline updates.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Implements session state for Accepting Gifts, applying attempt results and preparing next sets.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match data into normalized datapoints and computes aggregate series for charting.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Provides APA skill-level validation and maps 9-ball skill levels to required points-to-win with simple formatters.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Contains the APA 20‑point conversion chart and types for determining match‑point outcomes based on loser SL and points.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcomes using targets, winner detection, and match‑point parsing from the chart.",
  "frontend/src/lib/apa/apaScoring.ts": "Defines APA 9‑ball rack scoring logic, PPI calculation, validation helpers, and per‑player stat accumulation.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill level from PPI or aPPI using predefined numeric ranges.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Defines expected PPI lookup rows, the official table, and helpers to bucket win% and fetch expected PPI by skill level.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Computes match outcomes from skill levels and scores, with helpers to parse scores and fall back to saved didWin.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Provides PPI and aPPI calculators, including parsing inputs, computing contextual win%, and deriving aPPI using outcomes and expected PPI.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds human-readable match result strings and derives outcomes for multiple match modes including Accepting Gifts.",
  "frontend/src/lib/history/matchWinLoss.ts": "Derives win/loss outcomes across match modes and defines helpers for categorizing and evaluating matches.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses and normalizes match dates, preferring official log dates, and computes timestamps and formatted display strings.",
  "frontend/src/lib/matches/matchBuilders.ts": "Constructs Official APA match log records, deriving didWin from inputs, and re-exports other match builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Builds an APA 9-ball practice match record, generating player stats, outcomes, and metadata.",
  "frontend/src/lib/session/inProgressSessions.ts": "Provides helpers for tracking, clearing, and listing per-mode in‑progress sessions via sessionStorage.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes win/loss counts for Accepting Gifts matches grouped by starting ball count (2–7).",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Calculates total sessions and rolling averages for Accepting Gifts based on ending object ball counts.",
  "frontend/src/lib/stats/officialApaStats.ts": "Generates official APA stats including wins, win rate, and average PPI/APPI from match history.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes Straight Shot trends, averages, histograms, and summary rows from recorded matches.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Loads and manages an Accepting Gifts session, handling attempts, set transitions, session persistence, and match completion flow.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules, level structure, and progression system for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Initializes or resumes an Accepting Gifts session, letting the user select a starting level and confirming overwrites.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Restores and manages an APA practice session, tracking rack scoring, match progression, and saving when complete.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Collects player names and skill levels to start a new APA practice match, handling validation and in‑progress session checks.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Loads an existing official APA match log and displays a form to edit its details.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Provides a standalone form for creating a new official APA match log after the match is completed.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Displays an invite‑only access notice and allows users to request access via a mutation with success or duplicate‑request handling.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Shows detailed information for a specific match, including APA-specific stats and navigation to player aggregates.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Lists all matches with sorting, filtering, and card/table view modes across APA, gifts, and straight‑shot categories.",
  "frontend/src/pages/HomePage.tsx": "Renders the main app landing page with navigation cards for all game modes and match history.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page for managing user approvals and invite‑only mode, supporting approving/rejecting individuals or all pending users.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays a player's APA aggregate stats, predicted skill levels, and charts computed from historical match data.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Provides a deployment smoke‑test page with basic navigation checks and verification steps.",
  "frontend/src/pages/stats/MatchupsPage.tsx": "Provides opponent-based match filtering and win/loss stats across multiple match modes using all recorded matches.",
  "frontend/src/pages/stats/StatsPage.tsx": "Loads user and match data, computes multiple stats, and renders tabbed APA, Straight Shot, and Accepting Gifts analytics with navigation.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Manages an in‑progress Straight Shot game session, syncing state to sessionStorage and saving completed matches to the backend.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Displays the rules and objectives for the Straight Shot drill in a styled card.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Initializes or resumes a Straight Shot session, shows recent performance stats, and handles start/resume confirmation logic.",
  "frontend/src/utils/errorText.ts": "Extracts a readable message from various error types, handling nested and serialized error objects.",
  "frontend/src/utils/playerName.ts": "Provides utilities for normalizing and comparing player names case‑insensitively.",
  "frontend/src/utils/playerRoutes.ts": "Builds a URL path for navigating to a player's stats page.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage fallback and hash support.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the operation exceeds a specified duration.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, container settings, and plugin integrations.",
  "project_state.json": "Defines the project’s current state, including required fixes for per‑mode running W‑L/Win% and restoring sortable date behavior, along with related feature metadata and known issues."
}