{
  "backend/main.mo": "Actor managing access control, user approvals, invite-only mode, and user profiles with authorization checks and profile storage.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files and components.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation explaining the UI-only change that moves the Resume Game button below Start New Game in ModeCard.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables, dark mode values, and global background/foreground styles.",
  "frontend/index.html": "HTML entrypoint loading the root React element and main.tsx script.",
  "frontend/src/App.tsx": "Main React router setup configuring all app routes, error boundaries, layout, and the AuthGate wrapper.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Component rendering a table of Accepting Gifts win/loss stats by ball count with fallback when no data exists.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Renders a circular APA ball button with state-based styling and ARIA labeling. Triggers clicks and optionally disables interaction.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball state types and helpers for ball labels and values, plus rack total calculation including one-away 9-ball adjustments. Ensures rack accounting stays consistent at 10 points.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Manages rack scoring logic including ball states, innings, defensive shots, auto-dead rules, and live scoring updates. Integrates inning flow and match context to compute rack totals.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays final match results with winner info, match points, and detailed player statistics. Uses badges and icons to show skill level, points, innings, and PPI.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form for creating or editing logged APA matches with validation, connection handling, and save/update mutations. Manages fields for scores, innings, defensive shots, and player skill levels.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Hook managing inning flow, tracking active player, shared innings, and ball activity. Provides methods to mark shots, switch turns, reset racks, and compute final innings.",
  "frontend/src/components/auth/AuthGate.tsx": "Protects routes by enforcing login, approval, admin, and invite-only access rules. Shows loading, login prompt, or access-denied views as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with fallback handling for already-authenticated errors. Clears query cache on logout and updates UI state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for creating or editing a user profile, handling form state, backend readiness, and save logic.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Renders a match history table with derived APA stats, match details, and navigation to individual match pages.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation buttons, connection status, profile setup, and routed content.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Provides a confirmation dialog and mutation logic to delete a match and redirect or trigger a callback.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Reusable confirmation dialog for ending a match with customizable text and pending state handling.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a summary card for a match including mode, date, score, outcome, and navigation to details.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card UI for selecting a game mode with start and optional resume actions based on session state.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders PPI and match result trend charts for APA data, computing sorted datapoints and best-10 averages.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Builds a histogram of straight-shot counts by frequency and displays it in a bar chart.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Shows a table summarizing wins, losses, and first win dates grouped by ball count.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Displays a composed chart of straight-shot counts over time along with an average value.",
  "frontend/src/dev/straight-shot-spot-check.md": "Manual QA checklist ensuring Straight Shot flow, win/loss logic, data persistence, and UI remain correct.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity changes, invalidating related react-query caches.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a helper to clear and refetch the actor query for reconnection attempts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating matches, profiles, and approval data using the backend actor.",
  "frontend/src/index.css": "Tailwind base and theme variables for light/dark mode, defining UI color tokens and global styles.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Implements state updates for the Accepting Gifts drill, including ball count clamping, attempt scoring, and advancing to the next set.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match datapoints, computes PPI/aPPI, official outcomes, and calculates averages such as best‑10‑of‑20 and win rate.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Provides APA skill levels, points‑to‑win mappings, and helpers for validating and formatting skill levels and targets.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines the APA match‑point chart and threshold ranges used to convert loser SL and points into 20‑point outcomes.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA practice match outcomes using player targets, loser SL, and the match‑point chart.",
  "frontend/src/lib/apa/apaScoring.ts": "Implements APA rack scoring, PPI calculation, rack validation, and aggregation of per‑player rack stats.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill level based on PPI or aPPI using predefined numeric ranges.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Determines official APA win/loss/unknown outcomes based on skill levels, scores, and optional didWin flags.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Parses text inputs and computes official APA PPI/aPPI values with validation and formatting helpers.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds human‑readable match history summary strings for all match modes based on stored match data.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses match date strings safely and computes a consistent timestamp for sorting and formatting official APA matches.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds official APA match log records, deriving outcomes and generating match IDs, and re-exports other match builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Provides builders for APA Nine Ball, Accepting Gifts, and other match types, constructing full MatchLogRecord structures.",
  "frontend/src/lib/session/inProgressSessions.ts": "Manages in-progress session state in sessionStorage with helpers to check, clear, and list active game modes.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes Accepting Gifts win/loss performance grouped by starting ball count levels 2–7.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Calculates summary stats for Accepting Gifts sessions, including totals and rolling average of ending ball counts.",
  "frontend/src/lib/stats/officialApaStats.ts": "Aggregates official APA stats including win rate, total matches, and average PPI/APPI values.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes Straight Shot statistics such as averages, lowest shots, trend data, histograms, and win/loss summaries.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Loads and manages an Accepting Gifts drill session, handling attempts, set progression, session persistence, and match completion.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Displays the rules, setup, scoring, and tips for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for a new Accepting Gifts session with player info, notes, rules, ball count, and resume/start handling.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Manages APA practice match state, scoring, rack input, session persistence, and match completion logic.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Start page for APA practice matches, handling player names, skill levels, validation, and in‑progress session prompts.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Loads an APA match by ID, redirects if missing, and renders a prefilled edit form for official match log data.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Displays a page for creating a new official APA match log using the RealApaMatchForm in create mode.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Shows an invite‑only access notice and allows users to request approval, displaying confirmation once submitted.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Fetches and displays detailed match data, including APA‑specific stats, with navigation to related views.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Lists all matches with sorting, filtering, and card/table views, supporting APA, gifts, and straight match modes.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with navigation cards for all game modes and a link to match history when authenticated.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Provides an admin interface to manage user approvals and invite‑only mode, including approving, rejecting, and bulk actions.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays aggregated APA stats for a specific player, including charts, win rates, and predicted skill levels.",
  "frontend/src/pages/SmokeCheckPage.tsx": "A simple deployment verification page with a checklist and navigation buttons to Home and Match History.",
  "frontend/src/pages/stats/StatsPage.tsx": "Renders the main stats dashboard, loading match data and computing APA, Straight Shot, and Accepting Gifts statistics with navigation to related views.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Manages an active Straight Shot session, persisting state, handling input, and saving the match through backend actors.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Displays the rules and instructions for the Straight Shot drill in a styled card.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Provides a start screen for new Straight Shot sessions, showing moving averages and handling in‑progress session logic.",
  "frontend/src/utils/errorText.ts": "Converts unknown error values into readable text, handling nested error objects and fallbacks.",
  "frontend/src/utils/playerName.ts": "Provides helper functions for normalizing and comparing player names case-insensitively.",
  "frontend/src/utils/playerRoutes.ts": "Builds the URL path for a player's aggregate stats page.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout that rejects if the operation exceeds a specified duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, animations, and plugin integrations.",
  "project_state.json": "Tracks current release scope, architectural rules for drill and APA 9-ball logic, and a list of active bugs across scoring, UI, login, and persistence systems."
}