{
  "backend/main.mo": "Actor implementing access control, invite-only mode, user approval flows, and user profile storage.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short summaries describing each component or page.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying base styles.",
  "frontend/index.html": "HTML entry point loading the root div and main TypeScript bundle.",
  "frontend/src/App.tsx": "Main app router defining all routes, layout wrappers, and the new real APA match placeholder route.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Button component for APA balls showing number, scoring state, and click handling.",
  "frontend/src/components/apa/apaBallStyles.ts": "Provides helpers for ball state labels, ball values, and calculating total points per rack. Supports tracking player and dead-ball scoring for 9-ball.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Rack scoring component handling ball states, inning flow, automatic dead-ball logic, and rack completion callbacks.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays a completed APA match summary including winner, match points, and detailed stats for both players. Uses formatting helpers and UI cards to present skill level, points, defensive shots, innings, and PPI.",
  "frontend/src/components/apa/useApaInningFlow.ts": "React hook managing inning flow, tracking active player, inning counts, and whether balls were made. Includes functions for scoring, undoing, turnovers, and reset.",
  "frontend/src/components/auth/AuthGate.tsx": "Handles authentication flow and access control, showing login, loading, or restricted-access screens as needed. Ensures only approved or admin users can proceed when invite-only mode is enabled.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button tied to Internet Identity. Handles authentication state, logout cleanup, and retry on stale authentication errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for creating or editing a user profile, allowing name and default APA skill level entry. Automatically opens for first-time users and saves profile updates.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the app’s main layout with header, footer, navigation controls, and profile dialogs. Displays admin tools and login/profile options based on authentication state.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Delete button with confirmation dialog for removing a match. Calls delete API and redirects or triggers a callback after deletion.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Dialog for ending and saving a match session, with confirmation and loading states. Invokes a provided async save handler.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a clickable match summary card with mode, date, players, and mode-specific score info.",
  "frontend/src/components/navigation/ModeCard.tsx": "Renders a selectable game mode card with icon, description, and a button that navigates to start a game.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Generates PPI and match‑result trend charts using APA data points with rolling averages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, invalidating queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for user profiles, matches, and Accepting Gifts settings.",
  "frontend/src/index.css": "Configures Tailwind styles and CSS variables for light and dark themes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Defines Accepting Gifts game state helpers for clamping ball counts, applying attempts, and progressing sets.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts APA match data for a player and provides helpers for chart series, rolling averages, and date formatting.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA 9-ball skill levels and maps them to required points, with utilities for validation and formatting.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Implements the APA 20‑point match conversion chart with thresholds based on loser points by skill level.",
  "frontend/src/lib/apa/apaScoring.ts": "Provides APA rack scoring logic, PPI calculation, validation helpers, and utilities for aggregating player stats.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds standardized match records, including APA 9‑ball practice matches with player stats and PPI calculations.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider, then renders the root component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Manages state and progression for the Accepting Gifts drill, handling attempts, set transitions, and match saving.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Shows the rules, setup, scoring, and progression details for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Renders the start page for the Accepting Gifts drill, managing player input, baseline ball count, rules panel, and session initialization in sessionStorage.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Loads and manages APA practice match state, processes rack results, tracks completion, and saves progress to sessionStorage.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Collects player names and skill levels, validates setup, auto-fills user profile data, and initializes a new APA practice match in sessionStorage.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Displays a placeholder page describing upcoming official APA match logging features.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Shows an access-restricted message and lets users submit an approval request with basic success handling.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Fetches and displays detailed information for a saved match, including players, mode, date, stats, and deletion options.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Displays match history with filtering by mode and navigating to home or match details.",
  "frontend/src/pages/HomePage.tsx": "Displays the main navigation page with mode cards for practice modes and a link to match history.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page for managing user approval requests, invite-only mode, and bulk rejection.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Shows aggregate APA stats for a specific player, including summaries and charts.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Manages active Straight Shot drill gameplay, tracking strokes and saving match results.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Presents the rules and instructions for the Straight Shot drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start screen for Straight Shot drill, capturing player info and showing moving average stats.",
  "frontend/src/utils/playerName.ts": "Utility functions for normalizing and comparing player names.",
  "frontend/src/utils/playerRoutes.ts": "Generates URL paths for player stats pages.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to get URL parameters (including hash routing), persist them in sessionStorage, and clear them from storage or the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "JSON metadata describing project version, app summary, architectural notes, issues, and existing feature records."
}