{
  "backend/main.mo": "Main Motoko actor implementing access control, user approval, invite-only mode, user profiles, and match history storage for multiple game modes (Accepting Gifts, Straight Shot, APA Practice, Official APA Match Log) with CRUD operations and query endpoints.",
  "feature_evidence.json": "Feature evidence report documenting four completed features related to removing the Resume/Undo button from APA Practice mode and enforcing post-finalization gameplay lock with corrected save logic for authoritative score values.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing authentication, routing, game mode pages, scoring components, match history, and UI layout with recent changes to APA Practice finalization and Accepting Gifts 12-level system.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation describing a UI-only change to ModeCard component that reorders buttons to show 'Start New Game' first and 'Resume Game' second, with no changes to session storage, navigation, or gameplay logic.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color tokens including background, foreground, primary, secondary, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title describing the app as an APA-style pool practice scorekeeper, and script tag loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Root application component defining TanStack Router with error boundaries for all routes (home, APA practice, Accepting Gifts, Straight Shot, match history, stats, admin), wrapped with ThemeProvider, AuthGate, and Toaster.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "Table component displaying win/loss performance statistics grouped by starting ball count (2-7) for Accepting Gifts mode with empty state handling.",
  "frontend/src/components/apa/ApaBallButton.tsx": "A button component representing a pool ball (1-9) with visual states (unscored, playerA, playerB, dead) and hover effects based on the active player. Supports locked/disabled states and displays an X icon for dead balls.",
  "frontend/src/components/apa/apaBallStyles.ts": "Utility functions for ball state management and rack scoring calculations, including the one-away 9-ball rule where the 9-ball counts as 1 point instead of 2 when a player needs exactly 1 point to win.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Main rack scoring panel for APA 8-ball matches that tracks ball states, calculates points (with special 9-ball logic), manages dead ball mode, defensive shots, and innings flow. Handles live updates and rack completion with full match context including point targets and active player tracking.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays a match completion summary card showing winner, skill levels, points earned/needed, defensive shots, innings, and PPI for both players. Parses match point outcomes to show team points awarded to winner and loser.",
  "frontend/src/components/apa/MatchupAnalysisDropdown.tsx": "A dropdown menu component that extracts unique opponent names from official APA match data and allows selection of an opponent for matchup analysis. Disables when no opponents are available.",
  "frontend/src/components/apa/MatchupAnalysisDropdownPlayerStats.tsx": "Enhanced matchup analysis dropdown that filters matches by opponent name with a toggle to include/exclude practice matches, then displays a MatchupAnalysisPanel with the filtered results. Normalizes player names and sorts matches chronologically.",
  "frontend/src/components/apa/MatchupAnalysisPanel.tsx": "Panel component that analyzes head-to-head matchup statistics between a player and opponent across both official and practice APA matches. Extracts win/loss outcomes and PPI data from match records, handling different data structures for official vs practice matches.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form component for creating and editing APA 9-ball matches with validation for scores, innings, defensive shots, skill levels, and connection retry logic for backend actor availability.",
  "frontend/src/components/apa/useApaInningFlow.ts": "React hook managing APA inning flow state with shared innings counter that increments when the bottom player's turn ends, tracking active player and handling rack resets.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate component that checks Internet Identity login status, invite-only mode, and user approval/admin status before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component for Internet Identity login/logout with query cache clearing on logout and error handling for already-authenticated state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog component for creating and editing user profiles with name and APA skill level fields, auto-opening for new users and including connection retry logic.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Table component displaying match history with multi-select checkboxes, bulk delete functionality, and navigation to individual match details showing date, results, PPI, and aPPI.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with header, navigation, authentication status, admin controls, and footer. Displays a connecting indicator while actor/profile loads.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Confirmation dialog button for deleting a match. Triggers mutation and navigates to history or calls onDeleted callback after successful deletion.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Reusable alert dialog component for confirming match end actions with customizable title, description, and confirm text. Handles pending and disabled states.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a match summary card with mode badge, date, and contextual details (APA scores, Accepting Gifts status, Straight Shot result). Navigates to match details on click.",
  "frontend/src/components/navigation/ModeCard.tsx": "Reusable card component for game mode selection with icon, description, and action buttons. Shows resume button if an in-progress session exists for the mode.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders line charts for APA performance trends including PPI, aPPI, points scored, and defensive shots over time. Unifies data points by timestamp and uses custom dot shapes for differentiation.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Bar chart component displaying frequency distribution of shot counts for Straight Shot sessions. Aggregates data into histogram bins sorted by shot count.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Table component showing win/loss records by ball count for Straight Shot sessions, including first win date for each ball count.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Composed chart displaying shot count trend over time with bars and line overlay. Calculates and displays average shots across all sessions.",
  "frontend/src/dev/straight-shot-spot-check.md": "QA checklist document for manually testing Straight Shot (20-shot game) functionality to ensure it remains unaffected by APA Practice changes.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorRetry.ts": "React hook that provides a retry mechanism for actor initialization by clearing and refetching the cached actor query without requiring a page refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on matches, user profiles, and AG level index, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes for UI components including sidebar, charts, and semantic colors.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level Accepting Gifts progression system (2+8 through 7+9) with helpers for level management, clamping, and computing next baseline level based on win/loss outcomes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Manages Accepting Gifts game session state and logic, including applying attempt results (player vs ghost scoring) and preparing the next set after race-to-7 completion.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts and aggregates per-player APA match statistics (PPI, aPPI, points, defensive shots) from both practice and official matches with independent field validation and null handling.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines the APA 9-Ball Equalizer system mapping skill levels (1-9) to points-to-win targets (14-75) with validation and formatting utilities.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines APA 9-Ball match point conversion chart mapping loser's skill level and points pocketed to 20-point match outcomes (e.g., '20-0', '19-1'). Includes functions to calculate and parse match point outcomes.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcomes by determining the winner based on target points reached, then using the loser's skill level and points to calculate the 20-point match score distribution.",
  "frontend/src/lib/apa/apaScoring.ts": "Handles APA 9-Ball rack scoring with 10 points per rack, validates rack totals, and calculates PPI (points per inning) statistics for players across multiple racks.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill levels (1-9) based on PPI and aPPI averages using two sets of ranges: one for Official APA Tab and another for Detailed Player Stats page.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Provides the official APA Expected PPI lookup table mapping win percentage buckets (10-100%) to expected PPI values for skill levels 2-7, with functions to bucket and lookup values.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Derives Official APA match outcomes ('win', 'loss', or 'unknown') by comparing player scores against their skill-level-based target points, handling ambiguous cases where both or neither player reached their target.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Calculates Official APA PPI (score divided by effective innings) and aPPI (adjusted PPI using expected PPI table for wins), with win percentage computed from last 20 eligible matches.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Builds narrative strings for match history rows, formatting match results differently for Official APA, APA Practice, Straight Shots, and Accepting Gifts modes with scores, opponents, and win/loss indicators.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Provides utilities to parse, extract, and format match dates, preferring user-entered dates for Official APA matches and falling back to dateTime timestamps for other match types.",
  "frontend/src/lib/matches/matchBuilders.ts": "Exports a builder function for Official APA match logs that derives win/loss outcomes from skill levels and scores, and re-exports builders for other match types.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Contains builder functions for APA Practice, Accepting Gifts, and Straight Shot matches, creating MatchLogRecord objects with player stats, scores, and computed outcomes.",
  "frontend/src/lib/session/inProgressSessions.ts": "Provides centralized helpers for managing per-mode in-progress session state in sessionStorage, with separate slots for APA Practice, Accepting Gifts, and Straight Shot modes.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Computes Accepting Gifts performance statistics grouped by starting ball count (2-7), tracking wins and losses from completed race-to-7 sets.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Computes summary statistics for Accepting Gifts matches including total sessions and rolling average of ending object ball counts over the last N sessions.",
  "frontend/src/lib/stats/officialApaStats.ts": "Computes Official APA statistics including win rate, average PPI (last 10 matches), and average aPPI (best 10 of last 20), sorting matches chronologically by effective timestamp.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes Straight Shot statistics including rolling and lifetime averages, lowest shot count, trend data, histogram data, and win/loss summary by ball count.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Game page for the Accepting Gifts drill that manages game state (levels, scores, attempts), handles attempt input, set completion, and match saving with Internet Identity integration. Loads and persists session state from sessionStorage.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Static informational component displaying the rules, objectives, level system, match format, and progression rules for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for Accepting Gifts drill allowing users to select a starting level, view rules, and either start a new session or resume an in-progress session. Loads baseline level from user profile.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Game page for APA 9-Ball practice matches that manages rack-by-rack scoring, tracks innings and defensive shots, handles match completion, and saves results. Loads session state from sessionStorage and displays players based on lag winner.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Page for starting an APA 9-ball practice match with player name/skill level inputs, lag selection dialog, and session management to resume or start new matches.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Page for editing an existing official APA match log, loading match data by ID and rendering the RealApaMatchForm in edit mode.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Page for creating a new official APA match log entry after the fact (not for live scoring), rendering RealApaMatchForm in create mode.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Access denied page for invite-only mode, allowing users to request approval from the app owner with success feedback.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Detailed view page for a single match showing mode-specific stats (APA practice, official APA, or other modes), player performance metrics, and edit/delete actions.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Match history listing page with tabs for filtering by match type (all/APA/gifts/straight), sortable by date, and toggleable card/table view modes.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying four game mode cards (Official APA Match Log, APA 9-Ball Practice, Accepting Gifts, Straight Shot) with navigation and session resume functionality. Shows a link to match history for authenticated users.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin-only page for managing user access approvals with pending/approved/rejected lists, invite-only mode toggle, and bulk rejection functionality.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays aggregate APA statistics for a specific player, including win rate, PPI/aPPI metrics, skill level predictions, and matchup analysis. Filters to show only official APA matches and provides navigation back to stats or history pages.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Deployment verification page with a checklist and navigation buttons to test routing to Home and Match History pages. Used for post-deployment smoke testing.",
  "frontend/src/pages/stats/StatsPage.tsx": "Main statistics dashboard showing official APA stats, straight shot trends, accepting gifts performance, and matchup analysis for the logged-in user. Provides navigation to player aggregate stats and match history.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Active game page for the straight shot drill where users track total shots taken to clear the table. Manages session state in sessionStorage and saves completed matches to the backend.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Displays the rules and objectives for the straight shot strokes drill, explaining that players must clear all balls in 20 shots or fewer to win.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Starting page for straight shot drill sessions that displays moving average statistics from recent matches and allows users to start new sessions or resume in-progress ones.",
  "frontend/src/utils/errorText.ts": "Utility function to extract readable error messages from various error types including strings, Error objects, nested errors, and objects with message properties.",
  "frontend/src/utils/playerName.ts": "Provides utility functions for normalizing and comparing player names case-insensitively, including checking if a name matches any in a list.",
  "frontend/src/utils/playerRoutes.ts": "Builds URL-encoded route paths for player aggregate stats pages.",
  "frontend/src/utils/urlParams.ts": "Comprehensive utilities for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/src/utils/withTimeout.ts": "Utility function that wraps a Promise with a timeout, rejecting with an error if the promise doesn't resolve within the specified milliseconds.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for APA Practice pool scorekeeper, documenting architectural decisions around match finalization (End Rack as sole trigger, no resume/undo), save logic using authoritative state values, and four pending feature requests to remove Resume functionality and fix save logic."
}