{
  "backend/main.mo": "Motoko canister defining user profiles, access control, and detailed types for multiple pool match modes.",
  "feature_evidence.json": "Feature evidence report linking a specific APA 9‑ball rack‑scoring feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend files describing UI components and pages for all game modes.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack router, global theme, auth gate, layout, and all route definitions.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Renders a styled button for an APA ball with color‑coded states and scoring metadata.",
  "frontend/src/components/apa/apaBallStyles.ts": "Defines ball states and helpers for scoring 9-ball racks, including point values and total calculations.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "APA rack scoring UI with inning flow, ball state tracking, and auto-dead logic when the 9‑ball is pocketed.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Renders a detailed APA match results summary showing winner, match-point breakdown, and per-player stats including PPI and innings.",
  "frontend/src/components/apa/useApaInningFlow.ts": "React hook managing APA inning flow, tracking active player, inning counts, and ball-scoring state.",
  "frontend/src/components/auth/AuthGate.tsx": "Wrapper component that blocks access until Internet Identity login completes, showing loading or login UI as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with error recovery and cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog shown after first login to capture and save a user's display name.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout with header, footer, router outlet, login controls, and profile setup dialog.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Provides a confirmation dialog to delete a match and redirect or notify when done.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Dialog that confirms ending and saving a match session, showing loading state during save.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Clickable card summarizing a match with mode-specific labels, date/time, players, and score summary.",
  "frontend/src/components/navigation/ModeCard.tsx": "Card UI for selecting a gameplay mode, showing icon, description, and a button to start a new game.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, matches, and accepting-gifts data via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Implements game state helpers for adjusting object ball counts and updating set and attempt results.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Defines APA 9-ball skill levels and functions for mapping skill levels to required points and formatting values.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Provides match point conversion charts for APA 9‑ball based on loser points and skill level.",
  "frontend/src/lib/apa/apaScoring.ts": "Implements APA rack scoring utilities, validation, PPI calculation, and stat aggregation for players.",
  "frontend/src/lib/matches/matchBuilders.ts": "Constructs APA 9-ball match records, generating IDs, timestamps, and player stats based on scoring and rack data.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Manages gameplay state for the Accepting Gifts drill, handling attempts, set progression, and session persistence.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Shows rules and instructions for the Accepting Gifts drill.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for the Accepting Gifts drill, allowing player setup and baseline configuration.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Runs APA 9-ball practice games, updates scoring per rack, and detects match completion.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Form page to start an APA 9‑ball practice match, collecting player names, skill levels, notes, and initializing game state in session storage.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays detailed information for a selected match, including players, mode-specific data, and deletion options.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows a filterable list of past matches with tabs by mode and links to match summaries.",
  "frontend/src/pages/HomePage.tsx": "Displays the home screen with navigation cards for practice modes and history.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Manages the Straight Shot drill session, tracking strokes and events, saving results, and allowing match completion.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Static panel explaining rules and scoring for the Straight Shot Strokes Drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for the Straight Shot drill, collecting player info, showing moving average stats, and initializing game state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from session or the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the app’s current project state, architecture notes, APA 9‑ball scoring rules, practice modes, and known issues for development tracking."
}