{
  "backend/main.mo": "Backend actor implementing access control, user approval, invite-only mode, user profiles, and match-related types with various query and update methods.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like text providing short summaries of multiple frontend source files for reference.",
  "frontend/docs/v48-modecard-resume-button-order.md": "Documentation describing a UI-only change to reorder Start and Resume buttons in ModeCard.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML file loading the React application and mounting it to the root element.",
  "frontend/src/App.tsx": "Main React router setup defining routes, error boundaries, layout, and authentication gate.",
  "frontend/src/components/accepting-gifts/AcceptingGiftsPerformanceByBallCountTable.tsx": "React component displaying a table of Accepting Gifts win/loss performance by ball count.",
  "frontend/src/components/apa/ApaBallButton.tsx": "Circular ball button component that displays ball number, state styling, and accessibility label, invoking a click handler.",
  "frontend/src/components/apa/apaBallStyles.ts": "Provides ball state labels, ball values, and rack total calculations including one‑away 9‑ball adjustments.",
  "frontend/src/components/apa/ApaRackScoringPanel.tsx": "Manages rack scoring logic including ball states, inning flow, auto‑dead rules, and emits rack-complete or live updates.",
  "frontend/src/components/apa/ApaResultsSummary.tsx": "Displays match results with winner info, points, stats, and formatted PPI and match‑point outcome.",
  "frontend/src/components/apa/RealApaMatchForm.tsx": "Form for creating or editing a real APA match with validation, identity checks, and save/update mutations.",
  "frontend/src/components/apa/useApaInningFlow.ts": "Hook managing active player, shared innings, and inning transitions with helpers for scoring flow.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication and access‑control wrapper that handles login, loading states, and invite‑only restrictions.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button tied to Internet Identity with automatic session clearing and retry handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Manages a dialog for creating or editing a user profile, handling identity state, backend readiness, and form submission.",
  "frontend/src/components/history/MatchHistoryTable.tsx": "Renders a match history table with row selection and bulk deletion, including confirmation and error handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, navigation buttons, connection indicators, and footer.",
  "frontend/src/components/matches/DeleteMatchButton.tsx": "Provides a delete button with a confirmation dialog to remove a single match and navigate after deletion.",
  "frontend/src/components/matches/EndMatchDialog.tsx": "Shows a reusable confirmation dialog for ending a match with customizable text and loading state.",
  "frontend/src/components/matches/MatchSummaryCard.tsx": "Displays a summary card for a match, generating mode-specific labels and result text.",
  "frontend/src/components/navigation/ModeCard.tsx": "Shows a selectable mode card with start and optional resume actions, reflecting in‑progress sessions.",
  "frontend/src/components/players/ApaAggregateCharts.tsx": "Renders APA performance line charts by merging and sorting datapoints, showing trends for PPI, aPPI, and related metrics.",
  "frontend/src/components/straight-shot/StraightShotHistogram.tsx": "Builds a frequency histogram from shot counts and displays it using a bar chart.",
  "frontend/src/components/straight-shot/StraightShotSummaryTable.tsx": "Displays a summary table of straight-shot results with wins, losses, and first win dates.",
  "frontend/src/components/straight-shot/StraightShotTrendChart.tsx": "Shows shot-count trends over time with a composed bar/line chart and average calculation.",
  "frontend/src/dev/straight-shot-spot-check.md": "Manual QA checklist ensuring Straight Shot functionality works after changes.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor via React Query, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useActorRetry.ts": "Provides a helper to clear and refetch the actor query for retrying actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, and status management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating match data, profiles, and other backend fields using the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying base styles.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsLevels.ts": "Defines the 12-level Accepting Gifts progression, utilities for clamping and retrieving levels, and rules for updating the baseline level after a match.",
  "frontend/src/lib/accepting-gifts/acceptingGiftsSession.ts": "Provides session state structure and helpers to apply attempt results and advance sets without altering baseline level.",
  "frontend/src/lib/apa/apaAggregateStats.ts": "Extracts cleaned APA practice and official match stats per player, producing PPI/aPPI and related datapoints.",
  "frontend/src/lib/apa/apaEqualizer.ts": "Maps APA skill levels to points-to-win values and includes helpers for validation and formatted output.",
  "frontend/src/lib/apa/apaMatchPoints.ts": "Defines the 20-point APA match point conversion chart and structures used to determine outcomes based on loser SL and points.",
  "frontend/src/lib/apa/apaPracticeMatchOutcome.ts": "Computes APA Practice match outcomes by determining the loser, mapping points to a 20-point result, and assigning match points.",
  "frontend/src/lib/apa/apaScoring.ts": "Implements APA rack scoring utilities, PPI calculation, rack validation, and aggregation of per-player stats.",
  "frontend/src/lib/apa/apaSkillLevelPrediction.ts": "Predicts APA skill levels from PPI and aPPI using predefined numeric ranges.",
  "frontend/src/lib/apa/officialApaExpectedPpiTable.ts": "Provides the official expected PPI lookup table and helpers to bucket win% and fetch expected PPI for skill levels.",
  "frontend/src/lib/apa/officialApaOutcome.ts": "Determines APA match outcome based on skill levels and scores, returning win, loss, or unknown. Also exposes a helper that falls back to derived outcome when didWin is undefined.",
  "frontend/src/lib/apa/officialApaPpi.ts": "Computes official APA PPI and aPPI, plus win percentage context for matches. Includes validation helpers and logic integrating outcome and expected PPI tables.",
  "frontend/src/lib/history/matchHistoryRowModel.ts": "Generates human‑readable match result strings for various match modes. Handles APA official logs, practice matches, Accepting Gifts, and Straight Shot.",
  "frontend/src/lib/matches/effectiveMatchDate.ts": "Parses match date strings and determines effective timestamps for sorting. Prefers user‑entered APA log dates when valid and formats them for display.",
  "frontend/src/lib/matches/matchBuilders.ts": "Builds Official APA match log records and derives didWin from scores and skill levels. Re‑exports other match builders.",
  "frontend/src/lib/matches/matchBuildersOriginal.ts": "Creates APA 9‑Ball practice match records, computing targets, outcomes, and player stats. Includes a UUID generator and point‑to‑win lookup.",
  "frontend/src/lib/session/inProgressSessions.ts": "Manages sessionStorage state for in‑progress sessions per match mode. Provides helpers to query, clear, and list active sessions.",
  "frontend/src/lib/stats/acceptingGiftsPerformanceByBallCount.ts": "Aggregates Accepting Gifts win/loss counts by starting ball count levels 2–7. Processes final set scores to determine outcomes.",
  "frontend/src/lib/stats/acceptingGiftsStats.ts": "Computes summary stats for Accepting Gifts sessions, including total sessions and rolling average of ending object ball counts.",
  "frontend/src/lib/stats/officialApaStats.ts": "Aggregates APA official match stats including win rate, average PPI, and average aPPI. Uses PPI/aPPI calculators and win‑rate extraction.",
  "frontend/src/lib/stats/straightShotStats.ts": "Computes straight-shot stats from match data including averages, trends, histogram, and win/loss summary. Filters straight-shot matches and calculates rolling and lifetime metrics.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider. Renders the root App component.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsGamePage.tsx": "Handles the Accepting Gifts game loop including session loading, scoring, set progression, and match saving. Manages UI state such as dialogs and retry logic.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsRulesPanel.tsx": "Shows the rules and structure of the Accepting Gifts drill including levels, scoring, and progression.",
  "frontend/src/pages/accepting-gifts/AcceptingGiftsStartPage.tsx": "Start page for Accepting Gifts that loads profile and baseline level, configures a new session, or resumes an existing one.",
  "frontend/src/pages/apa/PracticeGamePage.tsx": "Loads and manages APA practice match state, handles rack scoring, persistence, completion, and match saving.",
  "frontend/src/pages/apa/PracticeStartPage.tsx": "Collects player names, skill levels, and notes to initialize a new APA practice game with session handling.",
  "frontend/src/pages/apa/RealApaMatchEditPage.tsx": "Fetches an existing official APA match and displays a form for editing its recorded details.",
  "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx": "Provides a form to manually create an official APA match log after the match is finished.",
  "frontend/src/pages/auth/AccessNotAllowedPage.tsx": "Shows an access-denied screen and allows users to request approval to use the app.",
  "frontend/src/pages/history/MatchDetailsPage.tsx": "Displays detailed information for a specific match, including APA stats, metadata, and navigation options.",
  "frontend/src/pages/history/MatchHistoryPage.tsx": "Shows match history with sorting, filtering, and card/table views for all match types.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with navigation cards for all game modes and a link to match history when authenticated.",
  "frontend/src/pages/owner/OwnerApprovalsPage.tsx": "Admin page for viewing and managing user approval statuses and invite-only mode, including approving, rejecting, and bulk rejection.",
  "frontend/src/pages/players/PlayerAggregateStatsPage.tsx": "Displays a player's APA aggregate stats, predictions, and charts with navigation handling and fallbacks when no data exists.",
  "frontend/src/pages/SmokeCheckPage.tsx": "Provides a deployment verification page with a checklist and buttons to test navigation to Home and Match History.",
  "frontend/src/pages/stats/StatsPage.tsx": "Shows the logged‑in user's aggregated stats across multiple game modes with tabs, charts, and navigation to detailed player stats or history.",
  "frontend/src/pages/straight-shot/StraightShotGamePage.tsx": "Handles an active Straight Shot drill session, persisting progress, validating backend connectivity, and saving completed sessions.",
  "frontend/src/pages/straight-shot/StraightShotRulesPanel.tsx": "Static panel describing rules and objectives for the Straight Shot drill.",
  "frontend/src/pages/straight-shot/StraightShotStartPage.tsx": "Start page for Straight Shot sessions, managing saved sessions, recent performance stats, and new session initialization.",
  "frontend/src/utils/errorText.ts": "Utility to extract readable error messages from various unknown or nested error formats.",
  "frontend/src/utils/playerName.ts": "Provides helper functions for normalizing and comparing player names case‑insensitively.",
  "frontend/src/utils/playerRoutes.ts": "Builds the URL path for a player's aggregate stats page using an encoded name.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clear hash parameters for routing.",
  "frontend/src/utils/withTimeout.ts": "Wraps a promise with a timeout, rejecting if it exceeds the specified duration.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended colors, typography, container queries, animations, and custom theme settings.",
  "project_state.json": "Describes the project’s current build state, constraints, required feature updates, and known issues for surgical changes."
}