{
  "kind": "build_request",
  "title": "Revamp APA 9-Ball scoring UI to a ball-based per-inning workflow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Replace the current APA rack scoring entry UI (numeric inputs for points/innings) with a seamless per-inning GUI for APA 9-ball practice matches: show balls 1–9 for the current rack, allow the scorekeeper to tap/select which balls were pocketed during the current inning, and provide a clear \"Turn Over\" control to advance to the next player's inning.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i want it more seemless. i would want more or less a gui that has 9 balls (numbered 1-9) for each round. turns would alternate and you select which balls were pocketed per inning. then a button kind of for turn over."
        ]
      },
      "acceptanceCriteria": [
        "On the APA Practice game screen, rack scoring no longer relies on manually typing player points for the rack; instead, balls 1–9 are displayed as selectable controls for the current rack.",
        "Tapping a ball marks it as scored for the currently active player for the current inning; tapping again unmarks it (until the rack is completed).",
        "A \"Turn Over\" button toggles the active player for the next inning entry, and the UI clearly indicates whose inning it is.",
        "The 9-ball is scored as 2 points; balls 1–8 are scored as 1 point each, consistent with existing APA logic.",
        "The rack can only be completed when exactly 10 rack points are accounted for via (player-scored balls + dead balls), matching POINTS_PER_RACK = 10.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Implement automatic innings tracking for APA Practice gameplay based on the per-inning flow: innings should be incremented automatically as the scorekeeper uses the \"Turn Over\" workflow (no manual innings numeric input fields).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "innings are automatically adjusted."
        ]
      },
      "acceptanceCriteria": [
        "The APA Practice game screen no longer requires the user to manually enter innings values per rack for either player.",
        "Each press of \"Turn Over\" increments innings for the player whose inning is being ended, and then switches the active player indicator.",
        "The player cards on the game screen continue to show innings totals and PPI updates correctly as innings advance.",
        "Existing end-of-match summary (ApaResultsSummary) continues to display innings and PPI without regression."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add in-flow controls to mark dead balls and defensive shots during APA per-inning entry, without breaking the existing per-rack 10-point accounting and defensive-shot totals.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "we mark deadballs somehow and defensive shot too see."
        ]
      },
      "acceptanceCriteria": [
        "The rack scoring UI includes a way to mark one or more balls as \"dead\" for the rack; dead balls count toward the 10-ball accounting but add 0 points to either player.",
        "The rack scoring UI includes a way to record a defensive shot for the currently active player during an inning (e.g., a toggle/button that increments a defensive-shot counter for that player).",
        "Defensive shots recorded during the rack update the defensive shot totals shown on the game screen player cards and persist into the saved match summary as they do today.",
        "The UI prevents impossible states (e.g., more dead balls than remaining unscored balls in the rack)."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update the APA Practice game flow to compute and submit the existing per-rack summary data (playerA/playerB points, dead balls, innings, defensive shots) from the new per-inning ball-based UI, keeping the saved match record shape and Match History/Details rendering compatible with existing APA match persistence.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I love what it saves. but the interface is laccking. lets correct these things first."
        ]
      },
      "acceptanceCriteria": [
        "Completing a rack via the new GUI produces the same RackData shape used today by PracticeGamePage (rackNumber, playerA points/innings/defensiveShots, playerB points/innings/defensiveShots, deadBalls).",
        "The APA Practice match can still be completed and saved successfully using the existing save flow, and saved matches continue to appear in Match History and Match Details with correct totals.",
        "No backend schema/state migration is required for this UI-only change; saved APA matches created before the change remain viewable.",
        "The rack history section (if kept) displays correct per-rack totals derived from the new UI."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; all Motoko logic stays in backend/main.mo.",
    "Use English for all user-facing text.",
    "Do not introduce external services, databases, or unsupported frameworks."
  ],
  "nonGoals": [
    "Do not add full turn-by-turn shot log persistence to match history unless explicitly requested later.",
    "Do not change APA 9-ball Equalizer rules, match-point conversion tables, or existing saved-match summary fields beyond what is needed to support the new UI.",
    "Do not add real-time/multiplayer features or third-party auth providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}