{
  "kind": "build_request",
  "title": "Fix APA 9-Ball Practice rack completion so match can end without waiting for the 9-ball (do not touch Straight Shot)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-153",
      "text": "Fix APA 9-Ball Practice so that when either player reaches/exceeds their points-to-win target during live rack entry, the current rack can be completed immediately without requiring the 9-ball to be pocketed (i.e., do not force the user to score the 9-ball just to enable “Complete Rack”).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "the apa 9 ball practice doesnt end the rack/game when the score is met it seems to wait for the 9ball why is that happening ?  and how are you going to fix it?"
        ]
      },
      "acceptanceCriteria": [
        "In APA Practice, if Player 1 or Player 2 reaches/exceeds their target based on (match current points + current rack live points), the UI provides a path to immediately finish the rack and proceed to match completion without pocketing the 9-ball.",
        "The “Complete Rack” action becomes enabled in the above scenario even when ball 9 remains unscored, and the user can proceed to the match completion screen.",
        "Any remaining unaccounted rack points are treated as dead for rack accounting so the rack finalizes cleanly (10 points accounted), without putting the 9-ball into a user-visible 'Dead Ball' state.",
        "After the match is complete, further rack scoring interactions are blocked as they are today (no additional points/innings can be added after completion)."
      ]
    },
    {
      "id": "REQ-154",
      "text": "Update the APA rack-scoring UI messaging/feedback to accurately describe the above behavior in English when match completion is reached mid-rack and the rack can be finalized without the 9-ball.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "the apa 9 ball practice doesnt end the rack/game when the score is met it seems to wait for the 9ball"
        ]
      },
      "acceptanceCriteria": [
        "When match completion is reached mid-rack, the UI shows clear English guidance that the rack can be completed now and any remaining balls/points will be treated as dead for rack accounting.",
        "The messaging does not instruct the user that they must pocket the 9-ball to proceed in the match-completion-imminent scenario."
      ]
    },
    {
      "id": "REQ-155",
      "text": "Ensure the Straight Shot (20-shot game) codepath is not modified as part of this change (no logic, UI, persistence, or copy changes).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "the 20 shot game is working perfectly so please DONT EVER TOUCH IT"
        ]
      },
      "acceptanceCriteria": [
        "No files under `frontend/src/pages/straight-shot/` are changed.",
        "No Straight Shot match-building, saving, history rendering, rules copy, or stats code is changed.",
        "Straight Shot behavior remains identical after deployment (spot-check: start a session, enter total shots, save, view in history)."
      ]
    }
  ],
  "constraints": [
    "Do not modify Straight Shot (20-shot game) implementation or any files under `frontend/src/pages/straight-shot/`.",
    "User-facing text must be in English.",
    "Respect existing APA 9-ball constraints: 9-ball must not become a user-visible 'Dead Ball' state (manual or automatic)."
  ],
  "nonGoals": [
    "Do not change Accepting Gifts behavior.",
    "Do not add new modes, backend schema changes, or persistence changes as part of this fix.",
    "Do not redesign the APA Practice UI beyond what is required to fix the rack/match completion gating behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}