{
  "kind": "build_request",
  "title": "APA 9-ball: End the rack immediately when the 9-ball is made",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Update APA 9-ball rack scoring so that once the 9-ball is recorded as pocketed by either player, the rack is treated as over: automatically mark all remaining unscored balls (1–8) as dead, and prevent any further ball scoring/dead-ball changes for that rack except allowing the user to undo/unmark the 9-ball to correct mistakes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ummm, once the nine ball is made thats the end of the rack for apa score keeper"
        ]
      },
      "acceptanceCriteria": [
        "In the APA rack scoring panel, if ball 9 is marked as pocketed by Player A or Player B, all remaining unscored balls 1–8 are automatically set to Dead Ball so the rack totals reach 10 points.",
        "After ball 9 is marked as pocketed, the UI disallows changing the state of balls 1–8 (including marking/unmarking dead balls) and disallows switching turns, unless the user first unmarks ball 9.",
        "If ball 9 is unmarked after being pocketed, any balls that were auto-marked dead solely due to the 9-ball being made are reverted back to unscored, restoring normal editing for the rack.",
        "The existing behavior of awarding the 9-ball’s 2 points to the player who pocketed it (based on the active player at the time of selection) remains intact.",
        "All user-facing text related to this behavior is in English and clearly states that making the 9-ball ends the rack."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all changes within the existing single-actor backend architecture; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change APA match-point conversion, skill level targets, or overall match completion rules.",
    "Do not add new game modes or alter Accepting Gifts or Straight Shot logic.",
    "Do not implement additional APA rule variations beyond the specific '9-ball ends the rack' behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}