{
  "kind": "build_request",
  "title": "Fix Official APA charts rendering and add console debug taps before LineChart input",
  "projectName": "Pool Scorekeeper",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-233",
      "text": "Fix the Official APA Performance Charts so they render reliably (not blank) by removing the current merged `dateMap`/single-dataset approach in `frontend/src/components/players/ApaAggregateCharts.tsx` and instead building five fully independent per-series datasets (`ppiSeries`, `appiSeries`, `yourPointsSeries`, `opponentPointsSeries`, `defensiveShotsSeries`). Each series must include only entries that have (1) a valid x-axis date derived from the datapoint timestamp and (2) a valid numeric value for that specific series. Render each series as its own `<Line>` such that missing/invalid values for one metric never suppress the other lines. Preserve the existing chart sections and English legend labels: PPI, aPPI, Your Points, Opponent Points, Defensive Shots.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the graphs and add the debug taps!!!"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/components/players/ApaAggregateCharts.tsx`, the charts no longer use a merged `dateMap` dataset (`ppiAppiChartData` / `matchResultsChartData`) as the sole data source.",
        "The component builds five separate arrays: `ppiSeries`, `appiSeries`, `yourPointsSeries`, `opponentPointsSeries`, `defensiveShotsSeries` where each element contains the x-axis key (`date`) and only the y-value for that series (e.g., only `ppi` for `ppiSeries`).",
        "The PPI & aPPI Trend chart renders PPI and aPPI as two independent line series that can render even if the other series has no points.",
        "The Match Results chart renders Your Points, Opponent Points, and Defensive Shots as three independent line series that can render even if one of the other series has no points.",
        "With at least one datapoint containing a valid numeric value for any one of the metrics, the corresponding line is visible (the chart is not fully blank as shown in the uploaded screenshot)."
      ]
    },
    {
      "id": "REQ-234",
      "text": "Add console-only debug taps in `frontend/src/components/players/ApaAggregateCharts.tsx` immediately before the data is fed into each `<Line>` so it is possible to see the exact per-series arrays being passed to Recharts. Keep any existing debug tap(s) earlier in the pipeline (e.g., in `frontend/src/lib/apa/apaAggregateStats.ts`) unchanged, and do not add any on-screen debug UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ii want an addtional debug tap right before the data goes into linechart...",
          "console only",
          "(dont do yet)...just add the debugs to the next build plan.",
          "fix the graphs and add the debug taps!!!"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/players/ApaAggregateCharts.tsx` logs the final arrays for: `ppiSeries`, `appiSeries`, `yourPointsSeries`, `opponentPointsSeries`, `defensiveShotsSeries` to the browser console right before those arrays are provided to their corresponding `<Line>` components.",
        "No debug output is rendered in the UI (console only).",
        "No changes are made to existing debug logging in `frontend/src/lib/apa/apaAggregateStats.ts` (it remains present and behaviorally unchanged)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not edit any files under `frontend/src/components/ui` or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep this change tightly scoped to the Official APA chart pipeline; modify only `frontend/src/components/players/ApaAggregateCharts.tsx` and (only if absolutely required for compatibility) `frontend/src/lib/apa/apaAggregateStats.ts`.",
    "All user-facing text must remain in English."
  ],
  "nonGoals": [
    "Do not add any on-screen/debug UI panels or overlays for chart datasets (console logging only).",
    "Do not change match history routing, sorting, table rendering, or any backend Motoko code as part of this charts/debug build.",
    "Do not change the underlying PPI/aPPI computation rules; this build is focused on getting valid series data into Recharts and making the charts render."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}