{
  "kind": "build_request",
  "title": "Fix empty Official APA charts by plotting each series from its own filtered dataset + ensure legends",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-215",
      "text": "Update the Stats → Official APA tab chart rendering so the PPI Trend chart always renders when any Official/APA datapoints contain a valid numeric PPI or aPPI value by generating two separate chart datasets: (1) a PPI-only dataset containing only matches with numeric PPI, and (2) an aPPI-only dataset containing only matches with numeric aPPI. Do not allow missing values in one series to suppress rendering of the other series.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i want the graph to graph the points that i can obviously see in the match thing...so how about we generate two lists...one for aPPI and one for PPI (but like seperately so other colmns that are thrown out cause they arent there cant affect it)",
          "1. yes"
        ]
      },
      "acceptanceCriteria": [
        "On Stats → Official APA → PPI Trend, if at least one match has a numeric PPI value, the PPI line renders (even if aPPI is missing/unknown for some or all matches).",
        "On Stats → Official APA → PPI Trend, if at least one match has a numeric aPPI value, the aPPI line renders (even if PPI is missing/unknown for some or all matches).",
        "The PPI Trend chart x-axis remains based on effective match date (per existing getEffectiveMatchTimestamp usage).",
        "No runtime errors occur in the charts due to null/undefined/NaN values in any saved match record."
      ]
    },
    {
      "id": "REQ-216",
      "text": "Update the Stats → Official APA tab Match Results chart rendering so each plotted series is built from its own filtered dataset: (1) Your Points-only dataset, (2) Opponent Points-only dataset, and (3) Defensive Shots-only dataset. Do not allow missing values in any one series to suppress rendering of the other series.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. yes"
        ]
      },
      "acceptanceCriteria": [
        "On Stats → Official APA → Match Results, if at least one match has numeric Your Points, the Your Points line renders even if Opponent Points or Defensive Shots is missing for other matches.",
        "On Stats → Official APA → Match Results, if at least one match has numeric Opponent Points, the Opponent Points line renders even if the other series have missing values in some matches.",
        "On Stats → Official APA → Match Results, if at least one match has numeric Defensive Shots, the Defensive Shots line renders even if the other series have missing values in some matches.",
        "The Match Results chart x-axis remains based on effective match date (per existing getEffectiveMatchTimestamp usage)."
      ]
    },
    {
      "id": "REQ-217",
      "text": "Ensure both Official APA charts display a visible legend with exactly these English labels for the plotted lines: PPI, aPPI, Your Points, Opponent Points, Defensive Shots.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "include a legend with the plots as well.",
          "3. yes"
        ]
      },
      "acceptanceCriteria": [
        "Stats → Official APA → PPI Trend shows a legend with items labeled exactly “PPI” and “aPPI”.",
        "Stats → Official APA → Match Results shows a legend with items labeled exactly “Your Points”, “Opponent Points”, and “Defensive Shots”.",
        "Legend colors/markers correspond to the actual rendered lines (no mismatched legend)."
      ]
    },
    {
      "id": "REQ-218",
      "text": "Keep `extractPlayerApaMatches(...)` producing clean numeric values (or null) for chart-consumed fields for both APA Practice and Official APA matches, and adjust any remaining parsing/coercion so values the user entered in the Official APA match log (scores and defensive shots) reliably reach the chart datasets as numbers when valid.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "do it cleanly and make sure the graph gets the data to plot."
        ]
      },
      "acceptanceCriteria": [
        "For Official APA match logs, myScore/theirScore/defensiveShots that are valid non-negative integers are reflected in `ApaMatchDataPoint.yourPoints`, `opponentPoints`, and `defensiveShots` as numbers (not strings).",
        "For APA Practice matches, `ApaMatchDataPoint.yourPoints`, `opponentPoints`, and `defensiveShots` are numbers when present in match data; invalid/unknown values become null (not NaN).",
        "No valid numeric values are discarded due to overly strict checks (e.g., values like 0 remain graphable where appropriate)."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep this build tightly scoped to fixing Stats → Official APA chart data/plotting and legends; avoid broad refactors.",
    "Do not introduce backend changes or schema migrations for this build."
  ],
  "nonGoals": [
    "Do not change Official APA match-log data entry fields, validation rules, or persistence schema.",
    "Do not change APA aPPI/PPI math rules beyond numeric coercion and dataset construction for charting.",
    "Do not modify Straight Shot gameplay, history rendering, or other non-Official-APA screens as part of this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}