{
  "kind": "build_request",
  "title": "Surgical Match History table logic: Official APA aPPI display + unified effective timestamp sorting",
  "projectName": "Match History",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Identify “Official APA match” rows using the existing match-type/mode discriminator already used elsewhere in the codebase (same mechanism as in frontend/src/lib/history/matchWinLoss.ts, frontend/src/lib/history/matchHistoryRowModel.ts, and the match builders). Do not add any new flags/fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Do not invent a new flag/field. Use the existing match-type/mode detection already used elsewhere (same mechanism used in matchWinLoss.ts / history row model / match builders)."
        ]
      },
      "acceptanceCriteria": [
        "No new properties/flags are added to ApiMatch or any saved match payloads to represent Official APA vs APA Practice.",
        "Official APA rows are detected using the same discriminator logic already present in the referenced modules (i.e., reuse the existing pattern rather than introducing a new classifier)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix Match History table aPPI display so that aPPI is displayed for Official APA rows only, using the existing official APA aPPI computation utility (with full context), and show \"—\" for Official APA rows where aPPI cannot be computed due to missing inputs. For all non-Official rows (APA Practice / Accepting Gifts / Straight Shot), always display \"—\" in the aPPI column.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "aPPI should display for Official APA rows (and only those rows).",
          "This is a display issue, not a “change the formula” request. Use the existing official APA aPPI computation/util (the same one used in the rest of the app).",
          "If aPPI cannot be computed for a given Official APA row due to missing inputs, show — for that row (do not fake it)."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/components/history/MatchHistoryTable.tsx, Official APA rows compute aPPI via the existing official APA context-aware util (frontend/src/lib/apa/officialApaPpi.ts: computeOfficialApaAppiWithContext + existing formatter) using the full match list passed into the table.",
        "For an Official APA row where the util returns invalid/null, the table displays \"—\" in the aPPI cell.",
        "For any non-Official APA row, the aPPI cell is always \"—\" (no computation attempted).",
        "No changes are made to the aPPI formula/logic in the util; only wiring/display in the table is updated."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the Match History “All History” ordering uses one unified sort key: sort strictly by the numeric value returned by the existing getEffectiveMatchTimestamp(match) (no new helper), newest first. Keep the Date display exactly as it is now (date-only).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "There should be one unified sort key: Sort by the numeric value from the existing getEffectiveMatchTimestamp(match) (no new helper).",
          "Keep Date display exactly as it is now (date-only)."
        ]
      },
      "acceptanceCriteria": [
        "Match ordering in the All tab (and the table view fed by it) is determined solely by getEffectiveMatchTimestamp(match), descending (newest first), without introducing new sorting helpers.",
        "Official APA matches sort based on the user-entered official APA match date as encoded by getEffectiveMatchTimestamp; drills/practice sort using their saved high-resolution timestamp (dateTime) as encoded by getEffectiveMatchTimestamp.",
        "When multiple drills occur on the same calendar date, they appear in correct chronological order based on their high-resolution timestamps, without changing the date-only display formatting in the Date column (formatEffectiveMatchDate remains date-only)."
      ]
    }
  ],
  "constraints": [
    "NO LAYOUT CHANGES. Surgical table logic only.",
    "Do not invent/add new match flags/fields for Official APA detection; reuse existing discriminator logic already used in matchWinLoss.ts / matchHistoryRowModel.ts / match builders.",
    "Do not create a new sorting helper; use the existing getEffectiveMatchTimestamp(match).",
    "Keep the Date column display exactly as it is now (date-only).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change any page/table layout, styling, column order, spacing, or UI structure.",
    "Do not change the aPPI formula, expected PPI table, or official APA calculation logic; only fix display wiring for the table.",
    "Do not change how dates are formatted/displayed (no time shown in the Date column).",
    "Do not add new backend fields, endpoints, or persistence changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}