{
  "kind": "build_request",
  "title": "Persist Accepting Gifts object-ball progression across sessions (min 2) with resume + reset controls",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Persist the Accepting Gifts drill progression per user so the current object-ball count (and optionally the in-progress session state) is saved server-side and automatically restored after logout/login, page reloads, or starting a new Accepting Gifts session.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the number of object balls needs to change and be tracked ... even the next time i login ... it should tell me where we left off (even if in middle of session match). once its saved then it continues from there"
        ]
      },
      "acceptanceCriteria": [
        "When a signed-in user changes the Accepting Gifts current object-ball count via normal gameplay (set win/loss progression), the latest value is persisted to the backend under that user.",
        "If the user returns later (new browser session / after re-authentication) and starts Accepting Gifts, the app defaults to the last persisted object-ball count instead of always defaulting to 3.",
        "If the user leaves in the middle of an Accepting Gifts session, the app can restore that in-progress session state after reload/login (resume flow) without requiring the user to re-enter the starting ball count.",
        "If no persisted Accepting Gifts state exists for the user, the app uses 3 object balls as the initial default."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Enforce a minimum object-ball count of 2 (not 1) for Accepting Gifts progression and inputs, and update all related UI copy to reflect the 2–7 range in English.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "with lowest being 2 balls"
        ]
      },
      "acceptanceCriteria": [
        "The Accepting Gifts object-ball clamp logic enforces 2–7 inclusive (backend-validated and frontend-validated).",
        "The Accepting Gifts Start page numeric input prevents values below 2 and above 7.",
        "Any rules/help text that currently says clamped between 1 and 7 is updated to say clamped between 2 and 7.",
        "Existing saved matches with starting/ending object-ball counts of 1 still render without crashing; however new gameplay cannot produce values below 2."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Add a user-controlled reset/override mechanism for Accepting Gifts so the user can explicitly set the starting/current object-ball count (2–7) and have that choice persisted as the new carry-forward baseline.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i shoould also be able to reset to a number if i want like say, i just try for 7 one day and go from there"
        ]
      },
      "acceptanceCriteria": [
        "On the Accepting Gifts Start page, the starting object-ball count field is pre-filled from the user’s persisted baseline (or 3 if none).",
        "The user can change the starting object-ball count (2–7) before starting, and if they proceed, that chosen value becomes the session’s starting/current count and is persisted as the new baseline for future sessions.",
        "An explicit “Reset” or “Set baseline” action is available (Start page and/or Game page) to set the baseline count without requiring the user to finish and save a match; the change persists across reload/login.",
        "All user-facing text for these controls is in English and clearly indicates the allowed range (2–7)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Implement backend API support for Accepting Gifts carry-forward state and in-progress session storage tied to the authenticated principal, and wire it into the existing React Query data layer.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes authenticated methods to: (a) get the caller’s Accepting Gifts persistent baseline/current object-ball count, (b) set/update that baseline/current count, (c) get the caller’s in-progress Accepting Gifts session (if any), (d) save/update in-progress session state, and (e) clear in-progress state when the session is ended/saved.",
        "Frontend adds React Query hooks/mutations (in the existing hooks pattern) to call these new backend methods and keep UI state in sync.",
        "When the user saves an Accepting Gifts match, the in-progress backend session state is cleared, and the persisted baseline/current count is updated to match where the session ended (ending/current object-ball count).",
        "Authorization rules match existing profile/match rules: only the caller can read/write their own Accepting Gifts state."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Respect single-actor backend architecture: all Motoko logic in backend/main.mo; add backend/migration.mo only if required by existing stable state changes per the conditional migration policy.",
    "Do not edit files under frontend immutablePaths (auth hooks, main.tsx, and UI component sources); compose existing UI components instead.",
    "Do not introduce external databases or third-party auth providers; Internet Identity remains the only auth method."
  ],
  "nonGoals": [
    "Do not change Accepting Gifts scoring rules beyond (a) persisting progression state across sessions and (b) enforcing the minimum of 2 object balls.",
    "Do not redesign other modes (APA Practice, Straight Shot) as part of this change.",
    "Do not add real-time/multiplayer features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}