{
  "kind": "build_request",
  "title": "Restore Match History date sort toggle and fix per-mode running W-L/Win% (exclude unknowns)",
  "projectName": "Match History",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix MatchHistoryTable running W-L and Win% so each row’s displayed W-L/Win% is computed only from matches of the same mode/bucket as that row (Official APA, APA Practice, Accepting Gifts, Straight Shot), using the current displayed sort order and counting from the start of that mode’s sequence up through the current row (i.e., running within mode regardless of adjacency).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "In Match History Table “All” view, W-L and Win% continue accumulating across mode boundaries (Accepting Gifts → APA → Straight Shot) instead of resetting per mode.",
          "Running totals are per-mode, regardless of adjacency."
        ]
      },
      "acceptanceCriteria": [
        "Given a mixed-mode list, each row’s W-L/Win% only reflects prior rows (including itself) that are the same bucket as that row in the currently displayed order.",
        "If a bucket appears, then other buckets, then the same bucket again later, the later row’s running totals include earlier same-bucket rows (i.e., not reset due to interleaving).",
        "Unknown outcomes do not increment wins or losses and are excluded from the Win% denominator.",
        "W-L column displays the per-row bucket running wins-losses (not a combined total across buckets).",
        "Win% column displays the per-row bucket running win percentage based on wins/(wins+losses); when denominator is 0, Win% displays 0%."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore the missing toggleable “Sort by date” behavior in MatchHistoryTable using the existing getEffectiveMatchTimestamp(match) comparator, without changing the default ordering behavior that exists today; sorting must only change when the user uses the table’s existing sort UI control (do not add new controls).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "Restore/implement the table “Sort by date” behavior.",
          "Toggleable exactly as it behaved before it broke.\n\nDefault on load stays whatever it is today (do not change default ordering behavior).\n\nApply sort only through the existing UI control (whatever the table already had).\nDo not add new controls."
        ]
      },
      "acceptanceCriteria": [
        "Sorting uses getEffectiveMatchTimestamp(match) as the single sort key (no new timestamp helpers).",
        "Default ordering on initial render remains exactly as it is today (do not change default direction or default sorted/unsorted behavior).",
        "User can toggle date sort direction via the existing sort UI control that the table already had (no additional/novel controls beyond restoring what was missing/broken).",
        "Running W-L/Win% calculations are based on the currently displayed (post-toggle) row order."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Keep MatchHistoryTable UI layout/columns and date display unchanged while implementing the logic fixes, limiting changes to frontend/src/components/history/MatchHistoryTable.tsx (plus any already-existing sort control wiring required).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "Do not change layout or columns.",
          "Proceed with the surgical update in MatchHistoryTable.tsx only (plus any already-existing sort control wiring required), no layout changes."
        ]
      },
      "acceptanceCriteria": [
        "No columns are added/removed/reordered; existing table layout remains unchanged.",
        "Date display remains date-only (continues using formatEffectiveMatchDate(match)); hover title can remain as-is.",
        "Code changes are confined to MatchHistoryTable.tsx except for minimal wiring needed to connect to an already-existing sort control if present elsewhere."
      ]
    }
  ],
  "constraints": [
    "Frontend-only change focused on frontend/src/components/history/MatchHistoryTable.tsx (allow only minimal existing sort-control wiring if required).",
    "Do not change default ordering behavior on load.",
    "Do not add new UI controls for sorting; only restore the existing sort control behavior.",
    "Do not change layout or columns.",
    "Use existing getEffectiveMatchTimestamp(match) for date sorting; do not introduce new timestamp helper functions.",
    "Use existing matchWinLoss.ts (deriveMatchOutcome/classifyMatchBucket) for win/loss/unknown; do not parse notes.",
    "Unknown outcomes must be excluded from wins, losses, and Win% denominator."
  ],
  "nonGoals": [
    "Changing date formatting beyond the current date-only display.",
    "Changing any PPI/aPPI logic or display behavior beyond what is necessary to keep the table functioning.",
    "Backend/canister changes, data migrations, or schema changes.",
    "Adding new filters, tabs, columns, or additional sorting controls."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}