{
  "kind": "build_request",
  "title": "Build 1: Official APA aPPI + Match History table derived fields + Official APA Win% last-20",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-199",
      "text": "Implement an Official APA aPPI (Adjusted/Applied PPI) value and ensure it is available wherever Official APA match metrics are rendered, using only existing lookup-table logic if it already exists in the current codebase; otherwise fall back to aPPI = PPI for both wins and losses (no new tables, no hardcoded values, no placeholders).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use the lookup table that already exists in the current codebase.\n\nDo NOT invent a new table.\nDo NOT reuse anything from past conversations.\nDo NOT hardcode values.\n\nIf an expected-PPI / aPPI lookup table already exists anywhere in the app (for example the same table used for skill-level prediction or APA aggregation), reuse that exact table and logic.\n\nIf no such table exists in the current codebase, then:\n- Implement aPPI using ONLY this rule for now:\n  - If win: aPPI = PPI\n  - If loss: aPPI = PPI\n\nDo NOT block Build 1 waiting on a table.\nDo NOT add placeholders.\nDo NOT change UI or charts."
        ]
      },
      "acceptanceCriteria": [
        "If the codebase contains an existing expected-PPI/aPPI lookup table or helper logic, Official APA aPPI uses that exact existing table/logic (no duplicated table definitions).",
        "If no such lookup exists, Official APA aPPI equals the computed Official APA PPI for all Official APA matches (regardless of win/loss).",
        "No win%→aPPI lookup values are newly introduced or hardcoded as part of Build 1.",
        "Build 1 does not introduce new UI elements beyond rendering the required aPPI value in existing Official APA metric sections (see REQ-200/REQ-201)."
      ]
    },
    {
      "id": "REQ-200",
      "text": "Update Official APA Match Details rendering to show an aPPI line directly under the existing PPI line in the Official APA section (English label exactly: \"aPPI:\"), showing a numeric value when computable and showing \"—\" when not available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0"
        ],
        "quotes": [
          "Build 1 fixes (data/metrics correctness):\n\n1) Official APA: aPPI must exist and show under PPI everywhere Official APA appears.\n- Expected in match details view and match history:\n  PPI: X.XX\n  aPPI: Y.YY"
        ]
      },
      "acceptanceCriteria": [
        "On `frontend/src/pages/history/MatchDetailsPage.tsx`, for `match.officialApaMatchLogData`, the \"You\" card shows both lines:\n- \"PPI: X.XX\" (existing)\n- \"aPPI: Y.YY\" directly underneath it (new)",
        "If Official APA PPI is invalid/unavailable (see `computeOfficialApaPpi`), the UI displays \"PPI: —\" and also displays \"aPPI: —\" (not missing).",
        "All user-facing text added/changed in this requirement is in English."
      ]
    },
    {
      "id": "REQ-201",
      "text": "Populate Match History Table derived columns for APA matches (at minimum for Official APA match logs), so that PPI, aPPI, Rolling 10/20, APA 10/20, Wins/Losses, and Win % are not rendered as \"—\" when sufficient data exists.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0"
        ],
        "quotes": [
          "2) Match History TABLE: derived columns must populate for NEW records at minimum:\n- PPI, aPPI, Win%, rolling 10/20 and APA 10/20 fields should not be blank for APA matches."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/history/MatchHistoryTable.tsx` no longer renders a fixed \"—\" for the derived metric columns for APA rows when the inputs required for those values exist.",
        "For an Official APA match row with valid PPI inputs (myScore, innings, defensiveShots), the PPI column shows a formatted numeric value (e.g. 0.79) instead of \"—\".",
        "For the same row, the Adjusted PPI (aPPI) column shows a formatted numeric value (or \"—\" only if aPPI truly cannot be computed under REQ-199/REQ-200 rules).",
        "Win % and Wins/Losses in the table reflect the same Official APA last-20-by-match-date window used on Stats (REQ-202) for the signed-in user context where that table is shown.",
        "Non-APA drill modes (Accepting Gifts, Straight Shot) continue to display \"—\" for APA-only derived columns."
      ]
    },
    {
      "id": "REQ-202",
      "text": "Fix Official APA win% computation to use the last 20 Official APA matches (or fewer if <20 exist), ordered by effective match date, not a smaller window (e.g., not last-10).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0"
        ],
        "quotes": [
          "3) Stats → Official APA: Win% must be last-20 matches (or fewer if <20 exist), not last-10."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/lib/stats/officialApaStats.ts` computes win rate using at most the 20 most-recent Official APA matches by effective match date.",
        "The window includes fewer than 20 matches if fewer than 20 Official APA matches exist.",
        "Win rate excludes matches with unknown outcome from the denominator (preserve existing known-outcome behavior).",
        "No chart behavior is changed as part of this requirement (this is a computation/windowing change only)."
      ]
    }
  ],
  "constraints": [
    "STOP after Build 1; do not start Build 2.",
    "Minimal changes only; no redesigns and no refactors beyond what is required to implement Build 1.",
    "Do not invent a new expected-PPI/aPPI lookup table.",
    "Do not reuse anything from past conversations.",
    "Do not hardcode lookup values.",
    "If no expected-PPI/aPPI lookup table exists in the current codebase, implement Official APA aPPI as PPI for both wins and losses (do not block Build 1).",
    "Do not change UI or charts except where explicitly required to (a) display aPPI under PPI for Official APA and (b) populate the Match History table derived columns."
  ],
  "nonGoals": [
    "Do not modify Stats charts, APA chart series, or any chart date logic in Build 1.",
    "Do not implement Straight Shot or Accepting Gifts stats/chart fixes in this build.",
    "Do not add multi-select delete to Match History table in this build.",
    "Do not change backend schemas or Motoko types for this build.",
    "Do not add new persistence fields for aPPI; compute it client-side for Build 1."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}