{
  "kind": "build_request",
  "title": "Fix login persistence regression and correct APA mode to APA 9-ball Equalizer scoring",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Investigate and fix the regression where a previously authenticated user is unexpectedly logged out (or forced to re-authenticate) after an app update/reload, so that Internet Identity sessions persist as expected across page reloads and routine redeploys (until the delegation expires or the user explicitly logs out).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "you lost my login and i had to redo...."
        ]
      },
      "acceptanceCriteria": [
        "After logging in once, refreshing the page keeps the user authenticated (AuthGate does not return to the login prompt).",
        "Navigating between routes does not clear authentication state.",
        "A user is only logged out when they click Logout, or when the delegation is actually expired/invalid (and the UI provides a clear, English message indicating the session expired).",
        "No changes are made to immutable hook files; fixes are implemented via safe composition/wrappers where needed."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Remove all APA Practice UI/logic that treats APA as a 'race to X' format, and update the APA Practice start and game screens to be APA 9-ball Equalizer point-based tracking (points-to-win by skill level) rather than a rack race.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-18"
        ],
        "quotes": [
          "why does it say race to 5? 9 ball doesnt work like that.",
          "APA 9-ball rules follow a rotation format but use a unique point-per-ball system known as The Equalizer® handicap system. Unlike standard 9-ball, matches are not a race to a specific number of games, but a race to a total point count based on your skill level."
        ]
      },
      "acceptanceCriteria": [
        "The APA Practice Start page no longer labels the target as 'Race to' and does not use a rack-race target model.",
        "The APA Practice Game page no longer displays 'Race to {target}'.",
        "Users can set each player skill level (SL 1–9) and the UI displays the correct points-to-win target for each player (SL1=14, SL2=19, SL3=25, SL4=31, SL5=38, SL6=46, SL7=55, SL8=65, SL9=75).",
        "The match ends based on reaching the required point total (not based on a rack count)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Implement APA 9-ball rack-by-rack scoring capture in the APA Practice flow, including: 10 total points per rack (1–8 = 1 point each, 9-ball = 2 points), dead balls tracked as 0 points, and defensive shots tracking, in a way that mirrors core APA scorekeeper behaviors for practice use.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-18"
        ],
        "quotes": [
          "Each rack has 10 points available: Balls 1–8: Each worth 1 point. 9-Ball: Worth 2 points. Dead Balls... count for 0 points.",
          "Failing to mark defensive shots (safeties) is considered a serious scorekeeping error that can artificially inflate skill levels"
        ]
      },
      "acceptanceCriteria": [
        "For each rack, the UI supports recording ball points for the active shooter, including recording a 9-ball worth 2 points.",
        "For each rack, the UI supports recording dead balls (0 points) such that rack accounting is always enforced: playerA_points + playerB_points + dead_balls = 10.",
        "The UI supports recording defensive shots per player (count).",
        "Innings are tracked in an APA-appropriate way for point-per-inning (PPI) calculation (the UI clearly indicates what counts as an inning).",
        "The app calculates and displays PPI for each player using the captured points and innings."
      ]
    },
    {
      "id": "REQ-15",
      "text": "At the end of an APA 9-ball practice match, calculate and display APA 20-point match result conversion (winner 12–20 / loser 0–8) using the user-provided SL-specific chart thresholds based on the losing player’s ball points earned relative to their SL goal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-18"
        ],
        "quotes": [
          "APA 9-Ball Match Point Conversion Chart ... (Source: Official APA 9-Ball Scoresheet)"
        ]
      },
      "acceptanceCriteria": [
        "On match completion, the results screen shows: both players’ SL, required points-to-win, points earned, defensive shots, innings, PPI, and the computed team match points for winner and loser.",
        "The conversion uses the exact threshold ranges provided by the user for SL1–SL9 and produces one of: 20-0, 19-1, 18-2, 17-3, 16-4, 15-5, 14-6, 13-7, 12-8.",
        "No 'race to X' terminology appears anywhere in the APA results UI."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update persisted match data structures so APA Practice saved matches store the new APA 9-ball Equalizer fields (skill levels, points-to-win targets, per-rack scoring with dead balls, defensive shots, innings/PPI, and match-point conversion outcome) and ensure Match History and Match Details render a correct APA 9-ball summary for these matches.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-18",
          "msg-20"
        ],
        "quotes": [
          "i want it to keep track of ppi and defensive shots and what the apa scorekeeper does so this is wrong",
          "can you please build correct app!! it was correct before and you lost my login and i had to redo...."
        ]
      },
      "acceptanceCriteria": [
        "Saving an APA Practice match persists the APA 9-ball-specific fields needed to reconstruct scoring and results (including dead balls and defensive shots).",
        "Match History summary cards for APA matches show APA-relevant stats (points earned/required and/or PPI) rather than the current practice attempts/makes placeholders.",
        "Match Details for APA matches displays the full APA 9-ball summary and end-of-match match-point conversion.",
        "If changing backend stable types requires a state upgrade, add a conditional migration in backend/migration.mo to preserve existing saved matches without traps (policy: conditional)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update any app branding elements that incorrectly imply 8-ball for an APA 9-ball-focused scorekeeper (e.g., the '8' badge in the header/login card), while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-18"
        ],
        "quotes": [
          "the apa app is for 9ball not 8ball",
          "APA 9-ball rules follow..."
        ]
      },
      "acceptanceCriteria": [
        "The header badge and login screen badge no longer show an '8' if the intended primary mode is APA 9-ball.",
        "No user-facing copy suggests APA mode is 8-ball or uses rack-race language.",
        "All updated/added user-facing text is English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Only create/modify backend/migration.mo if required to preserve existing stable state during upgrade (conditional migration policy).",
    "Do not edit any frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui (compose instead).",
    "Do not add third-party authentication providers; only Internet Identity is supported."
  ],
  "nonGoals": [
    "Do not add new game modes beyond APA Practice, Accepting Gifts, and Straight Shot.",
    "Do not implement real-time/multiplayer scorekeeping or shared live matches.",
    "Do not integrate external databases or third-party APIs for APA rules.",
    "Do not change Straight Shot or Accepting Gifts scoring rules unless required by shared persistence/schema adjustments."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}