{
  "kind": "build_request",
  "title": "Add 4th mode tile on Home screen linking to a blank placeholder page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-53",
      "text": "Add a 4th mode tile/card to the Home screen mode grid that navigates to a new placeholder route for a future “real APA match logging” mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "“Add a 4th mode tile on the home screen that links to a blank page.”"
        ]
      },
      "acceptanceCriteria": [
        "Home screen (frontend/src/pages/HomePage.tsx) shows four ModeCard tiles instead of three.",
        "The new tile has an English title and description indicating it is for official/real APA match logging and/or that it is a placeholder.",
        "Clicking the new tile navigates to the new placeholder route without errors."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Create a new blank placeholder page component for the 4th mode and register a new TanStack Router route for it in the app router.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "“Add a 4th mode tile on the home screen that links to a blank page.”"
        ]
      },
      "acceptanceCriteria": [
        "A new page component exists (new file under frontend/src/pages/...) that renders a simple, blank/placeholder experience with English text (e.g., heading + short message).",
        "The placeholder page includes a clear way to navigate back to Home (e.g., a “Back to Home” button).",
        "frontend/src/App.tsx registers a new route path (new, dedicated path) that renders the placeholder page.",
        "Navigating directly to the new route path renders the placeholder page successfully."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/immutablePaths must not be edited (compose existing UI components instead).",
    "Keep this change limited to adding the 4th mode tile + a blank placeholder page; do not modify existing match modes, match history behavior, or backend APIs.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Do not implement the real APA match logging form fields yet.",
    "Do not add persistence/saving for the 4th mode yet.",
    "Do not add new backend types, endpoints, or migrations for this placeholder step."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}