{
  "kind": "build_request",
  "title": "Fix regression: matches can no longer be saved",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-99",
      "text": "Investigate and fix the regression where the user can no longer save a match. Reproduce the failure for each mode that supports saving (APA Practice, Straight Shot, Accepting Gifts, and Official/Real APA Match Log) and identify whether the failure is caused by frontend validation/disabled actions, backend traps, or frontend-backend type mismatches.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now i cant save a match anymore"
        ]
      },
      "acceptanceCriteria": [
        "From each mode’s normal end-of-session flow, saving succeeds and the new match appears in Match History without errors.",
        "If saving fails for any reason, the UI displays a clear English error message that includes the underlying error text when available (not only a generic failure).",
        "No backend call involved in saving (saveMatch/updateMatch) traps during normal usage for an authenticated user with access."
      ]
    },
    {
      "id": "REQ-100",
      "text": "Fix any frontend-backend schema/type mismatches that can prevent saving or listing matches, especially for Official/Real APA Match Logs. Ensure the Motoko `ApiMatch.officialApaMatchLogData` shape matches the data actually stored in `APADetailedOfficial` and what the frontend sends via `buildOfficialApaMatchLog` (including removal of any stale fields such as `points` if they are no longer collected/sent).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now i cant save a match anymore"
        ]
      },
      "acceptanceCriteria": [
        "Saving an Official/Real APA Match Log via the form succeeds and navigates to the saved match details page.",
        "Match History list rendering and Match Details rendering work for newly saved Official/Real APA Match Logs and for previously saved ones.",
        "The backend `convertToApiMatch` projection for `#officialApaMatchLog` returns a consistent `officialApaMatchLogData` object with only the supported fields, and does not require any removed fields to exist.",
        "The frontend generated types/IDL bindings compile cleanly after the schema alignment."
      ]
    },
    {
      "id": "REQ-101",
      "text": "Harden the save flows so that the user is not blocked from saving due to avoidable client-side state issues. Specifically: ensure save buttons are not permanently disabled due to stale `actorFetching/isFetching` state, and ensure save actions fail fast with a clear English message when the backend actor/identity is not ready.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now i cant save a match anymore"
        ]
      },
      "acceptanceCriteria": [
        "When the backend connection is not ready, the user sees an English message like \"Backend connection not ready. Please wait and try again.\" and can successfully save after the actor becomes ready.",
        "Save buttons re-enable appropriately after transient failures (e.g., a failed attempt does not leave the UI stuck disabled).",
        "No mode’s save button is disabled solely because of unrelated loading states once the actor is ready."
      ]
    },
    {
      "id": "REQ-102",
      "text": "Ensure backend access control does not unexpectedly block saving matches in public mode. When `inviteOnlyMode` is disabled, an authenticated (non-anonymous) caller must be able to save and list matches without being rejected as \"must be approved\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "now i cant save a match anymore"
        ]
      },
      "acceptanceCriteria": [
        "With `inviteOnlyMode = false`, a logged-in user can save a match successfully even if they are not on an approval allowlist.",
        "Backend error messages related to access/approval do not occur during normal save/list operations in public mode.",
        "With `inviteOnlyMode = true`, existing approval rules still apply as designed (no regression)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor; all Motoko logic stays in backend/main.mo.",
    "Only create backend/migration.mo changes if required by a stable type/state upgrade (conditional migration policy).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead).",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Adding new match features or new match types beyond restoring the ability to save existing ones.",
    "Changing the app’s overall UI theme or navigation unrelated to the save regression.",
    "Introducing external databases or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}