{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "APA Practice — End-of-Match Finalization (Surgical Fix)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the 'Resume (Undo Accidental Win)' button from the APA Practice game interface after match finalization",
      "acceptanceCriteria": [
        "Resume button is not visible after a winning rack is finalized",
        "No UI elements allow undoing a finalized match"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/apa/PracticeGamePage.tsx",
          "operation": "modify",
          "description": "Remove the 'Resume (Undo Accidental Win)' button from the UI. Delete the button element and its conditional rendering logic from the JSX. Ensure no visual trace of the Resume functionality remains after match finalization."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the Resume button handler and all snapshot/rollback plumbing used exclusively for the Resume functionality in APA Practice mode",
      "acceptanceCriteria": [
        "No handler code exists for resuming after finalization",
        "Rack snapshot/restore logic for post-finalization rollback is removed",
        "No state corruption occurs from attempted rollback operations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/apa/PracticeGamePage.tsx",
          "operation": "modify",
          "description": "Remove the handleResume function and all associated state variables used for snapshot/rollback (e.g., previousRackSnapshot, snapshotBeforeWin, or similar). Delete any useEffect hooks or logic that creates snapshots when a win is detected. Remove state restoration code that would revert the match to a pre-finalization state."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Enforce that after pressing 'End Rack' on a winning rack in APA Practice, gameplay stops permanently: balls become unclickable, the rack scoring panel does not render again, and the match enters a final summary state where it can only be saved or discarded",
      "acceptanceCriteria": [
        "After 'End Rack' finalizes a winning rack, no ball buttons are clickable",
        "Rack scoring panel does not appear after finalization",
        "Only save/discard actions are available post-finalization",
        "No code path allows returning to gameplay after finalization"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/apa/PracticeGamePage.tsx",
          "operation": "modify",
          "description": "Add or strengthen the matchCompleted guard to ensure that when a winning rack is finalized (via 'End Rack'), the ApaRackScoringPanel component is not rendered and no gameplay controls are shown. Ensure the 'End Rack' handler sets matchCompleted=true immediately when a winner is determined. Verify that the ApaResultsSummary component is shown exclusively after finalization, and only save/discard buttons are available in that state. Remove any code paths that allow re-entering gameplay after matchCompleted is true."
        },
        {
          "path": "frontend/src/components/apa/ApaRackScoringPanel.tsx",
          "operation": "modify",
          "description": "Ensure that when the component receives a signal indicating the match is finalized (e.g., a prop or parent state check), all ball buttons become non-interactive. Add or strengthen disabled logic on ApaBallButton components to prevent clicks after finalization. Verify that no state changes or ball selections can occur once the match is completed."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix the save logic in APA Practice to persist authoritative values as-is without recalculation: use player1TotalScore and player2TotalScore for scores, session.sharedInnings for innings (same value for both players), and sum of session.racks[].playerXDefensiveShots for defensive shots",
      "acceptanceCriteria": [
        "Save logic reads player1TotalScore and player2TotalScore directly without recalculation",
        "Innings value is taken from session.sharedInnings for both players",
        "Defensive shots are computed as sum of defensive shot values across racks",
        "No scoring logic re-derives totals from ball states at save time"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/apa/PracticeGamePage.tsx",
          "operation": "modify",
          "description": "Modify the handleSave or handleSaveMatch function to use player1TotalScore and player2TotalScore directly from state without recomputing from ball states or racks. Use session.sharedInnings for the innings value for both players (not per-player inning counts). Compute defensive shots as the sum of playerADefensiveShots and playerBDefensiveShots across all racks in session.racks. Remove any logic that recalculates scores, innings, or defensive shots from raw ball state data at save time."
        },
        {
          "path": "frontend/src/lib/matches/matchBuildersOriginal.ts",
          "operation": "modify",
          "description": "Update the buildApaNineBallMatch function to accept finalized score, innings, and defensive shot values as parameters and use them directly in the constructed match record. Remove any internal recalculation or derivation logic that processes ball states or rack data to compute these values. Ensure the function acts as a pure mapper from provided authoritative values to the MatchLogRecord structure."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "In buildApaNineBallMatch for APA Practice, preserve both totalScore and pointsEarnedRunningTotal fields by persisting the same finalized value into both fields without zeroing, removing, or combining them",
      "acceptanceCriteria": [
        "Both totalScore and pointsEarnedRunningTotal are present in saved match records",
        "Both fields contain the same finalized score value",
        "No aggregation or combination logic manipulates these fields",
        "Neither field is zeroed out or removed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/matches/matchBuildersOriginal.ts",
          "operation": "modify",
          "description": "In the buildApaNineBallMatch function, ensure that for each player's ApaPlayerStats, both totalScore and pointsEarnedRunningTotal are set to the same finalized score value passed in from the caller. Do not zero, remove, or aggregate these fields. Simply assign the same authoritative score to both fields so they are preserved identically in the saved match record."
        }
      ]
    }
  ]
}