{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "APA 9-Ball Practice: allow rack completion once points-to-win reached mid-rack (without forcing 9-ball), leaving Straight Shot untouched",
  "requirements": [
    {
      "id": "REQ-153",
      "summary": "Enable “Complete Rack” in APA Practice as soon as either player reaches/exceeds their points-to-win target mid-rack, without requiring the 9-ball to be pocketed, while keeping rack accounting clean and blocking scoring after completion.",
      "acceptanceCriteria": [
        "In APA Practice, if Player 1 or Player 2 reaches/exceeds their target based on (match current points + current rack live points), the UI provides a path to immediately finish the rack and proceed to match completion without pocketing the 9-ball.",
        "The “Complete Rack” action becomes enabled in the above scenario even when ball 9 remains unscored, and the user can proceed to the match completion screen.",
        "Any remaining unaccounted rack points are treated as dead for rack accounting so the rack finalizes cleanly (10 points accounted), without putting the 9-ball into a user-visible 'Dead Ball' state.",
        "After the match is complete, further rack scoring interactions are blocked as they are today (no additional points/innings can be added after completion)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/apa/ApaRackScoringPanel.tsx",
          "operation": "modify",
          "description": "Adjust APA Practice rack completion gating so that when match completion is imminent mid-rack, the rack can be finalized immediately without scoring ball 9: (1) treat any remaining unaccounted rack points as implicit dead points for rack accounting (reaching 10 points) without setting ball 9 to a visible 'dead' state, (2) ensure \"Complete Rack\" becomes enabled under this condition, and (3) ensure the rack-finalization callback uses the same accounting so it finalizes cleanly. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/apa/PracticeGamePage.tsx",
          "operation": "modify",
          "description": "Confirm APA Practice match-completion flow still blocks further scoring interactions after match completion (rack panel hidden/disabled) and that live totals + rack finalization correctly transition into the existing match completion UI after the updated rack-completion behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-154",
      "summary": "Update APA rack-scoring UI messaging to clearly explain mid-rack match completion and that the rack can be completed without pocketing the 9-ball, with remaining points treated as dead for rack accounting.",
      "acceptanceCriteria": [
        "When match completion is reached mid-rack, the UI shows clear English guidance that the rack can be completed now and any remaining balls/points will be treated as dead for rack accounting.",
        "The messaging does not instruct the user that they must pocket the 9-ball to proceed in the match-completion-imminent scenario."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/apa/ApaRackScoringPanel.tsx",
          "operation": "modify",
          "description": "Update the match-completion-imminent alert/copy to clearly state in English that the rack can be completed immediately and remaining points will be treated as dead for rack accounting, and ensure no copy implies the 9-ball must be pocketed to proceed in this scenario. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-155",
      "summary": "Ensure Straight Shot (20-shot game) is not modified as part of this change.",
      "acceptanceCriteria": [
        "No files under `frontend/src/pages/straight-shot/` are changed.",
        "No Straight Shot match-building, saving, history rendering, rules copy, or stats code is changed.",
        "Straight Shot behavior remains identical after deployment (spot-check: start a session, enter total shots, save, view in history)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/dev/straight-shot-spot-check.md",
          "operation": "create",
          "description": "Add a lightweight manual QA checklist documenting the required Straight Shot spot-check steps (start a session, enter total shots, save, view in history) to help ensure the Straight Shot codepath remains untouched while implementing APA Practice changes."
        }
      ]
    }
  ]
}