{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Official APA charts: per-series filtered datasets + guaranteed legends",
  "requirements": [
    {
      "id": "REQ-215",
      "summary": "Render PPI Trend by plotting PPI and aPPI from separate filtered datasets so one series never suppresses the other while keeping x-axis based on effective match date.",
      "acceptanceCriteria": [
        "On Stats → Official APA → PPI Trend, if at least one match has a numeric PPI value, the PPI line renders (even if aPPI is missing/unknown for some or all matches).",
        "On Stats → Official APA → PPI Trend, if at least one match has a numeric aPPI value, the aPPI line renders (even if PPI is missing/unknown for some or all matches).",
        "The PPI Trend chart x-axis remains based on effective match date (per existing getEffectiveMatchTimestamp usage).",
        "No runtime errors occur in the charts due to null/undefined/NaN values in any saved match record."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/players/ApaAggregateCharts.tsx",
          "operation": "modify",
          "description": "Refactor the Official APA PPI Trend chart data construction to build (1) a PPI-only dataset (only rows with finite numeric PPI) and (2) an aPPI-only dataset (only rows with finite numeric aPPI), and plot each line from its own dataset (so missing values in one series never remove points from the other). Keep x-axis keyed off effective match date via getEffectiveMatchTimestamp, and harden mapping to avoid passing null/undefined/NaN into Recharts."
        }
      ]
    },
    {
      "id": "REQ-216",
      "summary": "Render Official APA Match Results by plotting each series (Your Points, Opponent Points, Defensive Shots) from its own filtered dataset so missing values never suppress other lines.",
      "acceptanceCriteria": [
        "On Stats → Official APA → Match Results, if at least one match has numeric Your Points, the Your Points line renders even if Opponent Points or Defensive Shots is missing for other matches.",
        "On Stats → Official APA → Match Results, if at least one match has numeric Opponent Points, the Opponent Points line renders even if the other series have missing values in some matches.",
        "On Stats → Official APA → Match Results, if at least one match has numeric Defensive Shots, the Defensive Shots line renders even if the other series have missing values in some matches.",
        "The Match Results chart x-axis remains based on effective match date (per existing getEffectiveMatchTimestamp usage)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/players/ApaAggregateCharts.tsx",
          "operation": "modify",
          "description": "Refactor the Official APA Match Results chart data construction to build three separate datasets: (1) Your Points-only, (2) Opponent Points-only, (3) Defensive Shots-only (each containing only rows with finite numeric values for that series), and plot each <Line> from its own dataset. Preserve the effective match date x-axis via getEffectiveMatchTimestamp and ensure missing values in any series do not filter out other series' points."
        }
      ]
    },
    {
      "id": "REQ-217",
      "summary": "Ensure both Official APA charts show visible legends with exact required English labels matching the rendered lines.",
      "acceptanceCriteria": [
        "Stats → Official APA → PPI Trend shows a legend with items labeled exactly “PPI” and “aPPI”.",
        "Stats → Official APA → Match Results shows a legend with items labeled exactly “Your Points”, “Opponent Points”, and “Defensive Shots”.",
        "Legend colors/markers correspond to the actual rendered lines (no mismatched legend)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/players/ApaAggregateCharts.tsx",
          "operation": "modify",
          "description": "Adjust the Recharts legend configuration so legends are always rendered when the chart is rendered, and ensure each plotted <Line> provides the exact label via the 'name' prop: “PPI”, “aPPI”, “Your Points”, “Opponent Points”, “Defensive Shots”. Confirm legend entries correspond to the actual line strokes/markers after switching to per-series datasets."
        }
      ]
    },
    {
      "id": "REQ-218",
      "summary": "Keep extractPlayerApaMatches producing clean numeric values (or null) for chart fields across practice and official matches, ensuring official log values reliably reach chart datasets as numbers when valid.",
      "acceptanceCriteria": [
        "For Official APA match logs, myScore/theirScore/defensiveShots that are valid non-negative integers are reflected in `ApaMatchDataPoint.yourPoints`, `opponentPoints`, and `defensiveShots` as numbers (not strings).",
        "For APA Practice matches, `ApaMatchDataPoint.yourPoints`, `opponentPoints`, and `defensiveShots` are numbers when present in match data; invalid/unknown values become null (not NaN).",
        "No valid numeric values are discarded due to overly strict checks (e.g., values like 0 remain graphable where appropriate)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/apa/apaAggregateStats.ts",
          "operation": "modify",
          "description": "Tighten numeric parsing/coercion in extractPlayerApaMatches so chart-consumed fields are always either a finite number or null (never NaN). For APA Practice matches, guard Number(...) conversions from possibly-missing values and ensure 0 remains valid; for Official APA logs, keep/adjust parsing so valid non-negative integers for myScore/theirScore/defensiveShots reliably map to numeric yourPoints/opponentPoints/defensiveShots."
        }
      ]
    }
  ]
}