{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 4th Home mode tile and placeholder route for future real APA match logging",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Add a fourth ModeCard tile on Home that navigates to the new real APA match logging placeholder page.",
      "acceptanceCriteria": [
        "Home screen (frontend/src/pages/HomePage.tsx) shows four ModeCard tiles instead of three.",
        "The new tile has an English title and description indicating it is for official/real APA match logging and/or that it is a placeholder.",
        "Clicking the new tile navigates to the new placeholder route without errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a 4th tile to the existing mode grid using the existing ModeCard component (card UI + built-in navigation via TanStack Router). Verify the component's usage instructions before implementing. Update the grid layout (currently lg:grid-cols-3) to a 4-tile-friendly layout (e.g., lg:grid-cols-4) and wire the new tile's path to the new dedicated placeholder route path. Ensure all new user-facing text is in English and clearly labeled as official/real APA match logging placeholder."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Create a new placeholder page component for the 4th mode and register a new TanStack Router route to render it.",
      "acceptanceCriteria": [
        "A new page component exists (new file under frontend/src/pages/...) that renders a simple, blank/placeholder experience with English text (e.g., heading + short message).",
        "The placeholder page includes a clear way to navigate back to Home (e.g., a “Back to Home” button).",
        "frontend/src/App.tsx registers a new route path (new, dedicated path) that renders the placeholder page.",
        "Navigating directly to the new route path renders the placeholder page successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/apa/RealApaMatchPlaceholderPage.tsx",
          "operation": "create",
          "description": "Create a new placeholder page that displays a simple heading and short English message indicating this is a placeholder for official/real APA match logging. Include a clear 'Back to Home' control using the existing shadcn/ui Button component and TanStack Router navigation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new dedicated TanStack Router route path that renders the new placeholder page component, and add it to the route tree so direct navigation to the path works."
        }
      ]
    }
  ]
}