{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Post-deploy smoke verification for core navigation",
  "requirements": [
    {
      "id": "REQ-122",
      "summary": "Add lightweight frontend smoke-check scaffolding and safer routing error handling to help verify the deployed app loads and core navigation works.",
      "acceptanceCriteria": [
        "A new deployment run is triggered using the current repository state.",
        "The deployment run completes successfully (no build/deploy error status).",
        "After deployment, the app loads to the Home page without a fatal error.",
        "Basic navigation works (Home -> Match History -> Home)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden router initialization against runtime failures by adding a user-friendly route-level error screen (using existing UI primitives) so the deployed app does not present a blank/fatal crash on unexpected errors, and wire a dedicated SmokeCheckPage route for quick post-deploy verification."
        },
        {
          "path": "frontend/src/pages/SmokeCheckPage.tsx",
          "operation": "create",
          "description": "Create a minimal SmokeCheckPage that renders an English-only checklist view with prominent navigation controls to Home and Match History, plus optional inline guidance for verifying the key flows after deployment (no new product features beyond verification scaffolding)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add stable QA selectors (e.g., data-testid attributes) to the primary Home call-to-action that navigates to Match History, and ensure navigation uses router-safe primitives so Home -> Match History works reliably after deployment."
        },
        {
          "path": "frontend/src/pages/history/MatchHistoryPage.tsx",
          "operation": "modify",
          "description": "Add stable QA selectors (e.g., data-testid attributes) to the 'Back to Home' control and ensure it navigates reliably to '/', so Match History -> Home works reliably after deployment."
        }
      ]
    }
  ]
}