{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Match History: Official APA aPPI display + unified effective timestamp sorting",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Detect “Official APA match” rows using the existing match-type/mode discriminator logic already used in history modules, without adding new flags/fields.",
      "acceptanceCriteria": [
        "No new properties/flags are added to ApiMatch or any saved match payloads to represent Official APA vs APA Practice.",
        "Official APA rows are detected using the same discriminator logic already present in the referenced modules (i.e., reuse the existing pattern rather than introducing a new classifier)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/history/MatchHistoryTable.tsx",
          "operation": "modify",
          "description": "Replace any direct Official APA detection checks with the existing discriminator used elsewhere (e.g., reuse classifyMatchBucket(match) === 'officialApa') so the table uses the same mechanism as matchWinLoss.ts/matchHistoryRowModel.ts and match builders; do not add new match flags/fields."
        },
        {
          "path": "frontend/src/pages/history/MatchHistoryPage.tsx",
          "operation": "modify",
          "description": "Update APA tab filtering logic to rely on the same existing discriminator pattern for identifying Official APA vs APA Practice (consistent with matchWinLoss.ts/matchHistoryRowModel.ts), without introducing new classifier helpers or fields."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show aPPI only for Official APA rows by wiring the existing official APA aPPI context utility into the Match History table; show “—” otherwise.",
      "acceptanceCriteria": [
        "In frontend/src/components/history/MatchHistoryTable.tsx, Official APA rows compute aPPI via the existing official APA context-aware util (frontend/src/lib/apa/officialApaPpi.ts: computeOfficialApaAppiWithContext + existing formatter) using the full match list passed into the table.",
        "For an Official APA row where the util returns invalid/null, the table displays \"—\" in the aPPI cell.",
        "For any non-Official APA row, the aPPI cell is always \"—\" (no computation attempted).",
        "No changes are made to the aPPI formula/logic in the util; only wiring/display in the table is updated."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/history/MatchHistoryTable.tsx",
          "operation": "modify",
          "description": "Wire Official APA aPPI display to computeOfficialApaAppiWithContext(match, allMatches) and formatOfficialAppi for Official APA rows only; for non-Official rows always render \"—\" and avoid calling the util. Keep existing date-only display behavior intact."
        },
        {
          "path": "frontend/src/pages/history/MatchHistoryPage.tsx",
          "operation": "modify",
          "description": "Pass the full match list (sorted full history) into MatchHistoryTable as an additional context prop used exclusively for Official APA aPPI computation, while still passing the filtered list for rows to render (no layout/styling changes)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure All History ordering uses a single unified sort key: getEffectiveMatchTimestamp(match) numeric value, newest first, without changing date-only display formatting.",
      "acceptanceCriteria": [
        "Match ordering in the All tab (and the table view fed by it) is determined solely by getEffectiveMatchTimestamp(match), descending (newest first), without introducing new sorting helpers.",
        "Official APA matches sort based on the user-entered official APA match date as encoded by getEffectiveMatchTimestamp; drills/practice sort using their saved high-resolution timestamp (dateTime) as encoded by getEffectiveMatchTimestamp.",
        "When multiple drills occur on the same calendar date, they appear in correct chronological order based on their high-resolution timestamps, without changing the date-only display formatting in the Date column (formatEffectiveMatchDate remains date-only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/history/MatchHistoryPage.tsx",
          "operation": "modify",
          "description": "Centralize and confirm sorting for match history views uses only getEffectiveMatchTimestamp(match) (descending) as the sole ordering key for the All tab data and the data passed down to the table/cards (no new sorting helper introduced)."
        },
        {
          "path": "frontend/src/components/history/MatchHistoryTable.tsx",
          "operation": "modify",
          "description": "Ensure the table’s rendered order follows the parent-provided ordering based on getEffectiveMatchTimestamp(match) (descending) and does not introduce any alternative sort keys; keep Date cell formatting as-is (date-only via formatEffectiveMatchDate)."
        }
      ]
    }
  ]
}