{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remember primary player APA skill level in profile UI and auto-fill APA practice match setup",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Add an APA 9-ball skill level selector to the Profile Setup / Edit Profile dialog, prefill from profile, and save alongside name.",
      "acceptanceCriteria": [
        "In Edit Profile mode, the dialog pre-fills both the current saved name and the current saved APA skill level (if present).",
        "Saving the dialog updates the backend profile so subsequent loads show the updated skill level.",
        "All new/updated UI copy in this dialog is English-only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Extend the dialog to view/edit the primary player’s APA 9-ball skill level alongside name, and persist both via useSaveCallerUserProfile. Use the existing shadcn-ui Select component to render the selector UI and use APA_SKILL_LEVELS/formatSkillLevel utilities from frontend/src/lib/apa/apaEqualizer.ts for options/labels (verify the component's usage instructions before implementing). Ensure the field is optional (supports unset), pre-fills from userProfile.apaSkillLevel when present, and saves as a bigint-compatible value when provided. Update dialog copy in English to clearly indicate it is the default for APA matches (e.g., label like “APA 9-Ball Skill Level (Default)”)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Confirm the profile query/mutation typing and cache invalidation correctly supports the additional optional apaSkillLevel field on UserProfile (no behavior change beyond ensuring the new field is carried through saveCallerUserProfile and reflected in the cached currentUserProfile)."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Auto-fill the primary player's APA skill level on APA practice match start from the saved profile, without overriding manual changes.",
      "acceptanceCriteria": [
        "If the user has a saved APA skill level in their profile, opening the APA Practice Start page shows that skill level selected by default for the primary player.",
        "If the user changes the skill level on the start page, starting the match uses the changed value (not forcibly overwritten by profile defaults).",
        "If the user has no saved APA skill level, the start page continues to behave sensibly (e.g., keeps the current default)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/apa/PracticeStartPage.tsx",
          "operation": "modify",
          "description": "When userProfile.apaSkillLevel is present, initialize Player 1 skill level default from it (convert bigint to number and validate against APA_SKILL_LEVELS). Implement one-time/guarded autofill so it does not overwrite the user’s manual selection (e.g., track whether Player 1 SL has been touched and only apply profile default before user interaction). Keep current default behavior (SL 5) when profile has no saved skill level."
        }
      ]
    }
  ]
}