{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Official APA Match Log Save stuck on “Connecting…”",
  "requirements": [
    {
      "id": "REQ-107",
      "summary": "Enable Save/Update as soon as a backend actor instance exists (regardless of actor background fetching) and correct button label state handling.",
      "acceptanceCriteria": [
        "When logged in and on the Official APA Match Log page, the primary action button does not remain stuck showing “Connecting...” indefinitely if an actor instance is available.",
        "If the actor instance is available, the Save/Update button can be clicked (subject to existing validation and required-field rules) even when the actor hook reports isFetching=true.",
        "The button label logic distinguishes between “No actor yet” (connecting) vs “Mutation in progress” (saving) vs normal ready state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/apa/RealApaMatchForm.tsx",
          "operation": "modify",
          "description": "Update Save/Update button enablement and label logic to treat the actor as 'ready' when `actor` is non-null (do not gate on `actorFetching`). Ensure the button text distinguishes: (1) actor missing => “Connecting...”, (2) mutation pending => “Saving...”, (3) ready => “Save Match”/“Update Match”. Keep existing validation/required-field disabling behavior intact."
        }
      ]
    },
    {
      "id": "REQ-108",
      "summary": "Provide an inline error and retry flow when the backend actor never becomes available, without losing form inputs.",
      "acceptanceCriteria": [
        "If the actor is null/unavailable, the UI presents an English message indicating the backend connection is not ready and offers a retry action.",
        "Triggering retry attempts to re-establish the ability to save without losing already-entered form inputs.",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActorRetry.ts",
          "operation": "create",
          "description": "Add a small helper hook that uses React Query’s QueryClient to re-attempt actor creation by clearing/removing the cached 'actor' query and triggering a refetch. It should not require a page refresh and must not modify the existing immutable actor hook."
        },
        {
          "path": "frontend/src/components/apa/RealApaMatchForm.tsx",
          "operation": "modify",
          "description": "Add a 'connection not ready' inline message area that appears after a reasonable wait (e.g., ~8–10s) when `identity` is present but `actor` is still null. Include a “Retry connection” button wired to the new `useActorRetry` hook; ensure retry does not reset local form state/inputs. All user-facing text must be English."
        }
      ]
    },
    {
      "id": "REQ-109",
      "summary": "Add a client-side timeout and recoverable error state for save/update so long-running/hung requests re-enable the button and allow retry.",
      "acceptanceCriteria": [
        "If the save/update request does not resolve within the configured timeout window, the user sees an English error message indicating the save is taking too long and to retry.",
        "After a timeout error, the Save/Update button is re-enabled and the form remains populated with the user’s inputs.",
        "Normal successful saves still navigate to the saved match details page as currently implemented in the form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/withTimeout.ts",
          "operation": "create",
          "description": "Create a small utility to wrap a Promise with a timeout (via Promise.race) and throw an English timeout Error message when exceeded. Keep it generic for reuse."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden `useSaveMatch` and `useUpdateMatch` mutationFns by wrapping the actor calls with the new timeout utility. On timeout, throw a clear English Error so the form can surface it and the mutation leaves the pending state, re-enabling the Save/Update button for retry."
        },
        {
          "path": "frontend/src/components/apa/RealApaMatchForm.tsx",
          "operation": "modify",
          "description": "Ensure save/update errors (including timeout errors) surface clearly (English) and do not leave the primary action button in a disabled “Connecting...” state. Preserve existing successful navigation behavior."
        }
      ]
    },
    {
      "id": "REQ-110",
      "summary": "Ensure the Official/Real APA Match Log save flow fails fast and visibly (frontend) rather than appearing stuck, aligning with current backend behavior when invite-only mode is disabled.",
      "acceptanceCriteria": [
        "With invite-only mode disabled, an authenticated user can save an Official/Real APA Match Log and then immediately see it in Match History and open Match Details.",
        "If the backend rejects the save, the frontend receives a failing response and shows an error; it must not remain indefinitely in a “Connecting...” UI state.",
        "No backend traps occur during save for the Official/Real APA Match Log happy path."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure mutation error handling consistently converts backend failures into thrown Errors (using existing error extraction) so the UI can display a failure state instead of appearing stuck. Confirm success paths still invalidate match history queries so newly saved logs appear in Match History."
        },
        {
          "path": "frontend/src/components/apa/RealApaMatchForm.tsx",
          "operation": "modify",
          "description": "Confirm the form never ties the primary action disabled/label state to background actor fetching (only to actor presence + validation + in-flight mutation). Ensure backend rejections surface as English errors and leave the form usable for retry."
        }
      ]
    }
  ]
}