{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "APA 9-Ball Practice: Ball-based per-inning rack scoring UI (frontend-only)",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Replace numeric rack scoring inputs with a ball-based per-inning workflow (select balls 1–9, show active player, and provide Turn Over to switch innings).",
      "acceptanceCriteria": [
        "On the APA Practice game screen, rack scoring no longer relies on manually typing player points for the rack; instead, balls 1–9 are displayed as selectable controls for the current rack.",
        "Tapping a ball marks it as scored for the currently active player for the current inning; tapping again unmarks it (until the rack is completed).",
        "A \"Turn Over\" button toggles the active player for the next inning entry, and the UI clearly indicates whose inning it is.",
        "The 9-ball is scored as 2 points; balls 1–8 are scored as 1 point each, consistent with existing APA logic.",
        "The rack can only be completed when exactly 10 rack points are accounted for via (player-scored balls + dead balls), matching POINTS_PER_RACK = 10.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/apa/ApaRackScoringPanel.tsx",
          "operation": "modify",
          "description": "Replace the current points/innings numeric-entry form with a ball-based rack UI: render selectable controls for balls 1–9, show a clear active-player indicator for the current inning, and add a prominent \"Turn Over\" control to switch the active player. Use existing shadcn-ui components (e.g., Card/Button/Badge/Alert) for layout and interactions; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/apa/ApaBallButton.tsx",
          "operation": "create",
          "description": "Create a reusable ball control used by the rack scoring panel to display balls 1–9 with distinct visual states (unscored, scored by Player A, scored by Player B, dead) and accessible labels. Use existing shadcn-ui primitives where appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/apa/apaBallStyles.ts",
          "operation": "create",
          "description": "Add shared, UI-focused helpers for mapping ball number + state to classNames/labels so ApaRackScoringPanel and ApaBallButton stay consistent and readable (English-only text)."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Automatically track and update innings totals using the Turn Over workflow (remove manual innings entry).",
      "acceptanceCriteria": [
        "The APA Practice game screen no longer requires the user to manually enter innings values per rack for either player.",
        "Each press of \"Turn Over\" increments innings for the player whose inning is being ended, and then switches the active player indicator.",
        "The player cards on the game screen continue to show innings totals and PPI updates correctly as innings advance.",
        "Existing end-of-match summary (ApaResultsSummary) continues to display innings and PPI without regression."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/apa/useApaInningFlow.ts",
          "operation": "create",
          "description": "Implement a focused React hook to manage per-rack inning flow state: active player, inning-in-progress detection, per-player inning counts for the rack, and a Turn Over action that increments innings for the ending player and switches turns. The hook should expose derived rack totals needed by the UI."
        },
        {
          "path": "frontend/src/components/apa/ApaRackScoringPanel.tsx",
          "operation": "modify",
          "description": "Integrate the per-inning flow hook to remove manual innings inputs and to drive automatic innings updates via Turn Over. Ensure the rack completion action also finalizes inning counting consistently (without requiring numeric inputs). Use existing shadcn-ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/apa/PracticeGamePage.tsx",
          "operation": "modify",
          "description": "Adjust the APA practice gameplay page to rely on the rack panel’s computed innings (no manual inputs), ensuring the player cards update innings totals and PPI as racks are completed. Keep existing routing and save flow unchanged."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add in-flow dead ball and defensive shot controls to the per-inning UI while preventing impossible rack states.",
      "acceptanceCriteria": [
        "The rack scoring UI includes a way to mark one or more balls as \"dead\" for the rack; dead balls count toward the 10-ball accounting but add 0 points to either player.",
        "The rack scoring UI includes a way to record a defensive shot for the currently active player during an inning (e.g., a toggle/button that increments a defensive-shot counter for that player).",
        "Defensive shots recorded during the rack update the defensive shot totals shown on the game screen player cards and persist into the saved match summary as they do today.",
        "The UI prevents impossible states (e.g., more dead balls than remaining unscored balls in the rack)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/apa/ApaRackScoringPanel.tsx",
          "operation": "modify",
          "description": "Add in-flow controls for (1) marking balls as dead (with dead contributing to rack accounting but awarding 0 points) and (2) recording a defensive shot for the active player (incrementing that player’s defensive-shot counter). Prevent invalid states by disallowing dead/scored assignment on already-assigned balls and by ensuring the rack cannot be completed unless total accounted rack points equals POINTS_PER_RACK. Use existing shadcn-ui components (e.g., Button/Badge/Alert); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/apa/apaScoring.ts",
          "operation": "modify",
          "description": "Add small, shared scoring helpers needed by the new UI (e.g., compute ball value for 1–9 with 9-ball=2, compute rack totals from per-ball assignments, and a validation helper that confirms accounted rack points equals POINTS_PER_RACK). Keep existing exports working to avoid regressions."
        },
        {
          "path": "frontend/src/pages/apa/PracticeGamePage.tsx",
          "operation": "modify",
          "description": "Ensure defensive shots and dead-ball totals received from the new rack UI continue to roll up correctly into game totals and rack history display, and persist through the existing save flow."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Derive and submit the existing per-rack summary data (points, dead balls, innings, defensive shots) from the new per-inning UI while keeping saved match records and history views compatible.",
      "acceptanceCriteria": [
        "Completing a rack via the new GUI produces the same RackData shape used today by PracticeGamePage (rackNumber, playerA points/innings/defensiveShots, playerB points/innings/defensiveShots, deadBalls).",
        "The APA Practice match can still be completed and saved successfully using the existing save flow, and saved matches continue to appear in Match History and Match Details with correct totals.",
        "No backend schema/state migration is required for this UI-only change; saved APA matches created before the change remain viewable.",
        "The rack history section (if kept) displays correct per-rack totals derived from the new UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/apa/ApaRackScoringPanel.tsx",
          "operation": "modify",
          "description": "Ensure the rack completion callback produces the same numeric per-rack summary fields as before (player points, dead ball points, innings, defensive shots), derived from the ball-based per-inning UI, so PracticeGamePage can continue building RackData without changing its shape."
        },
        {
          "path": "frontend/src/pages/apa/PracticeGamePage.tsx",
          "operation": "modify",
          "description": "Keep RackData construction and session persistence compatible while accepting the new rack panel output. Ensure rack history rendering remains accurate using the derived per-rack totals from the new UI (no shape changes)."
        },
        {
          "path": "frontend/src/lib/matches/matchBuilders.ts",
          "operation": "modify",
          "description": "Confirm APA match building continues to use the same per-rack fields (points/innings/defensiveShots/deadBalls) supplied by PracticeGamePage, ensuring saved match record shape remains compatible with existing Match History/Details rendering."
        }
      ]
    }
  ]
}