{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore MatchHistoryTable date sort toggle and per-mode running W-L/Win% (exclude unknowns)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Compute running W-L and Win% per row within that row’s match bucket (mode) using the currently displayed row order, excluding unknown outcomes from totals and denominator.",
      "acceptanceCriteria": [
        "Given a mixed-mode list, each row’s W-L/Win% only reflects prior rows (including itself) that are the same bucket as that row in the currently displayed order.",
        "If a bucket appears, then other buckets, then the same bucket again later, the later row’s running totals include earlier same-bucket rows (i.e., not reset due to interleaving).",
        "Unknown outcomes do not increment wins or losses and are excluded from the Win% denominator.",
        "W-L column displays the per-row bucket running wins-losses (not a combined total across buckets).",
        "Win% column displays the per-row bucket running win percentage based on wins/(wins+losses); when denominator is 0, Win% displays 0%."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/history/MatchHistoryTable.tsx",
          "operation": "modify",
          "description": "Update computeRunningWinLoss to track running stats by bucket and emit per-row stats for the current row’s bucket only (not combined totals). Ensure deriveMatchOutcome(match) values of 'unknown' do not affect wins/losses and are excluded from the win% denominator; when wins+losses is 0, winPercentage is 0. Ensure the running calculation is based on the final displayed row order (the same list used for rendering)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore the table’s existing toggleable date sort behavior using getEffectiveMatchTimestamp(match), without changing current default ordering on initial render and without adding new UI controls.",
      "acceptanceCriteria": [
        "Sorting uses getEffectiveMatchTimestamp(match) as the single sort key (no new timestamp helpers).",
        "Default ordering on initial render remains exactly as it is today (do not change default direction or default sorted/unsorted behavior).",
        "User can toggle date sort direction via the existing sort UI control that the table already had (no additional/novel controls beyond restoring what was missing/broken).",
        "Running W-L/Win% calculations are based on the currently displayed (post-toggle) row order."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/history/MatchHistoryTable.tsx",
          "operation": "modify",
          "description": "Introduce a date sort direction state that preserves today’s initial behavior (keep the current initial ordering unchanged). Wire the existing Date header sort interaction to toggle the direction and re-sort using getEffectiveMatchTimestamp(match) only. Ensure the rendered list (post-toggle) is what feeds the running W-L/Win% computation."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement logic-only fixes while keeping MatchHistoryTable layout/columns and date display unchanged, limiting changes to MatchHistoryTable.tsx except minimal existing sort-control wiring if required.",
      "acceptanceCriteria": [
        "No columns are added/removed/reordered; existing table layout remains unchanged.",
        "Date display remains date-only (continues using formatEffectiveMatchDate(match)); hover title can remain as-is.",
        "Code changes are confined to MatchHistoryTable.tsx except for minimal wiring needed to connect to an already-existing sort control if present elsewhere."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/history/MatchHistoryTable.tsx",
          "operation": "modify",
          "description": "Keep the existing Table markup (columns, order, and date cell rendering) unchanged while making the sorting and running-stat logic changes. Continue using formatEffectiveMatchDate(match) for the visible date string and preserve the existing hover title behavior."
        }
      ]
    }
  ]
}