{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-13T21:56:30.093Z",
  "summary": "The diff adds a new ball-based rack scoring UI (ball buttons with states for Player A/B/dead), an inning-flow hook, and updates the rack scoring panel to compute rack totals from ball selections and to auto-track innings/defensive shots. However, some acceptance-criteria details are either not evidenced or appear implemented differently than requested, and there are backend changes that look unrelated to the UI-only scope.",
  "missing_requirements": [
    {
      "id": "REQ-19",
      "requirement": "Each press of \"Turn Over\" increments innings for the player whose inning is being ended, and then switches the active player indicator.",
      "reason": "The new inning flow only increments innings when `currentInningHasBalls` is true; if no balls were marked in the inning, `turnOver()` does not increment innings. This does not match the AC statement that each press increments innings for the player whose inning is being ended.",
      "evidence": [
        "frontend/src/components/apa/useApaInningFlow.ts"
      ]
    },
    {
      "id": "REQ-20",
      "requirement": "UI prevents impossible states (e.g., more dead balls than remaining unscored balls in the rack).",
      "reason": "The dead-ball toggle allows marking any unscored ball as dead without an explicit guard against exceeding the rack accounting limit; the only evidenced behavior is showing an error when totals exceed POINTS_PER_RACK. No disabling/prevention logic is shown in the provided diff summary.",
      "evidence": [
        "frontend/src/components/apa/ApaRackScoringPanel.tsx"
      ]
    },
    {
      "id": "REQ-21",
      "requirement": "Completing a rack via the new GUI produces the same RackData shape used today by PracticeGamePage (rackNumber, playerA points/innings/defensiveShots, playerB points/innings/defensiveShots, deadBalls).",
      "reason": "The updated rack panel’s `onRackComplete` payload uses `player1Points/player2Points/player1Innings/...` naming (player1/player2), not the explicitly required `playerA/playerB` RackData shape. The diff is truncated before seeing final mapping, so there is not enough evidence that the emitted data is converted back into the exact `RackData` shape as required.",
      "evidence": [
        "frontend/src/components/apa/ApaRackScoringPanel.tsx",
        "frontend/src/lib/apa/apaScoring.ts"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Backend addition of a detailed `BallState` type suggesting ball-by-ball/inning event logging structures.",
      "reason": "The BuildRequest explicitly frames this as a UI-only change with no backend schema/migration required, and non-goals include not adding turn-by-turn shot log persistence. The diff shows a new/expanded backend `type BallState = { ballNumber; inn; pocketed; by; ... }` which is not requested by REQ-18–REQ-21 and appears to introduce ball-level event schema.",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.66,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/apa/ApaBallButton.tsx",
    "frontend/src/components/apa/ApaRackScoringPanel.tsx",
    "frontend/src/components/apa/apaBallStyles.ts",
    "frontend/src/components/apa/useApaInningFlow.ts",
    "frontend/src/lib/apa/apaScoring.ts",
    "project_state.json"
  ]
}