{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-18T00:06:03.053Z",
  "summary": "Diff implements unified sorting using existing getEffectiveMatchTimestamp() in both the page-level match list and the table. It also introduces new running win/loss aggregation logic inside MatchHistoryTable, and adds imports for Official APA aPPI utilities, but the truncated diff does not show the aPPI cell wiring or definitive Official-APA-only gating behavior.",
  "missing_requirements": [
    {
      "id": "REQ-2",
      "requirement": "Fix Match History table aPPI display so that aPPI is displayed for Official APA rows only using computeOfficialApaAppiWithContext + existing formatter (with full match list context), otherwise show \"—\"; and for all non-Official rows always show \"—\" with no computation attempted.",
      "reason": "MatchHistoryTable.tsx imports computeOfficialApaAppiWithContext/formatOfficialAppi, but the provided diff is truncated before any table rendering logic that would prove: (1) Official-only detection, (2) passing full match list context (allMatches) into the util, and (3) displaying \"—\" when null/invalid or for non-Official rows.",
      "evidence": [
        "frontend/src/components/history/MatchHistoryTable.tsx (truncated)"
      ]
    },
    {
      "id": "REQ-1",
      "requirement": "Identify “Official APA match” rows using the existing discriminator logic already used elsewhere (matchWinLoss.ts / matchHistoryRowModel.ts / match builders) without adding new flags/fields.",
      "reason": "While MatchHistoryTable.tsx uses classifyMatchBucket(match) (from matchWinLoss) for running W/L stats, the truncated diff does not show that the same discriminator mechanism is actually used to gate the aPPI column specifically (Official APA rows only).",
      "evidence": [
        "frontend/src/components/history/MatchHistoryTable.tsx (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added new running win/loss and win-percentage computation for each table row (computeRunningWinLoss + rowsWithRunningStats).",
      "reason": "The BuildRequest only asks for Official APA aPPI display wiring and unified effective-timestamp sorting; it does not request new running W-L/Win% calculations in the table logic.",
      "evidence": [
        "frontend/src/components/history/MatchHistoryTable.tsx"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/history/MatchHistoryTable.tsx",
    "frontend/src/pages/history/MatchHistoryPage.tsx",
    "project_state.json"
  ]
}